{
    "main": {
        "about": "About aeSecure",
        "aeSecureRelease": "Click here to read the version information",
        "filecreated": "%s  file has been created.",
        "downloadfile": "Download this folder\/file",
        "pleasewaitcanbelong": "This action may take quite a long time. Please wait and do not close this window. Click on this notification to hide it away from the screen.",
        "filesandfolders": "Files and folders",
        "search": "Search",
        "database": "Database",
        "execute": "Execute",
        "downloadandkill": "<h3>The file that has just been downloaded has been immediately deleted from your web server web.<\/h3>Therefore, it is not accessible from a url.",
        "file": "File",
        "pro": "This feature is reserved for Business Users",
        "session_killed": "Your session has been cleared. You can close this window safely.",
        "logout": "log out",
        "helpreadonline": "Consult aeSecure website to learn more",
        "restorefromconfig": "Restore",
        "restorefromconfig_hint": "If you've already saved something in this screen before, get your latest settings by clicking on this button.",
        "restoreconfirm": "The entry isn't empty.   Do you still want to replace its value by the previously saved one ?",
        "icon_warning": "Your site ran into a configuration problem. Please click on this button to display the list of problems to be solved promptly.",
        "loadfromaesecure": "Load from aeSecure",
        "loadfromaesecure_hint": "Click this button to retrieve a list of values ​​from  aeSecure.site. This list contains values ​​already identified by the developer of aeSecure allowing you to quickly initialize the option above.",
        "add": "Add",
        "add_hint": "Click this button to display a form simplifying the addition of a new value.",
        "confirm_save": "\":\" <strong> In case you have made a syntax error, your site will immediately be inaccessible (500 error) after saving <\/strong><br\/><br\/> Before clicking the OK button, make sure you have access to your FTP or a control panel in case you need to manually make changes in the .htaccess file.",
        "invalidregex": "The regular expression you have entered seems to be incorrect. Please make sure your coding is correct.",
        "edithtaccessandsearchfor": "Manually edit the .thaccess file at the root of your site and find out the lines between  the 2 tags %ACTION_TAG_START% and %ACTION_TAG_END%. Delete the lines located between these 2 tags (tags not included). Save your file and refresh your web page. Your site will be accessible again.",
        "select_all": "Select all",
        "unselect_all": "Deselect all",
        "toggle": "Interchange",
        "result": "Result",
        "fileext": "File extension",
        "advancedoptions": "Advanced options",
        "newer_version_htaccess": "<strong> Please update your .htaccess file <\/strong><br\/> Your .htaccess version does not correspond to the latest aeSecure release. To activate the latest version, please disable option 1.1 and reactivate it immediately thereafter; This will prompt aeSecure to use the new programming.",
        "chapter4popuptitle": "Depending on whether your website is based on a CMS or not, the list of the options below will vary. <br\/><br\/> Available  options will depend on the CMS in use (Joomla!®, WordPress...).",
        "chapter8popuptitle": "The purpose of these features is to speed up the display of your site. <br\/><br\/> Site optimization is only available from aesecure Premium offer up.",
        "chapter5popuptitle": "If your web site does not use any database and \/ or if data connections are not completed in the Tools -> Options screen, the list below will be empty.",
        "configure": "Configure",
        "hiddenindemo": "The demo mode being enabled, this information is not available for reasons of confidentiality.",
        "actual_config": "Current configuration",
        "actualconfig_intro": "Your current configuration is displayed below for control purposes. This information is important and confidential. Do not send it to anyone.",
        "actualconfig": "Current configuration",
        "advanced_parameters": "Advanced parameters",
        "incorrect_token": "The execution of this action requires the presence of your security token, but it has either been omitted or it is incorrect.",
        "advancedoptionsarehidden": "Advanced functions are not displayed below. To see them, please go to  the Tools-> Options  screen and change the  'Show advanced functions' setting.",
        "chapter1popuptitle": "Functions 1.1 and 1.2 <strong style='color:red;'> must be enabled <\/strong>. If not, your aeSecure installation is incomplete.",
        "chapter2popuptitle": "If possible, <strong style='color:green;'>activate option 2.1 or better, 2.2, to protect access to a folder<\/strong> as eg your admin folder or whatever folder containing aeSecure.",
        "chapter3popuptitle": "Folders and files management: Avoid 'chmod' 777.",
        "chapter7popuptitle": "URLs Management (rewriting, referencing, redirection...)",
        "chapter9popuptitle": "Miscellaneous features.",
        "versionfreehiddenpaidoptions": "You are using the free version. Advanced teatures are not available in your version.",
        "versionpremiumhiddenpaidoptions": "You are using the Premium version. <strong style='text-decoration:underline;'>Thank you!<\/strong> Need more? Choose the Pro version.",
        "reset_snippetdone": "The code associated with that option was updated, but<strong> not Implemented<\/strong>: If you want to use it, you need to (re)activate the option. If it was already active, please click on the button to disable and enable it again.",
        "unprotect": "Remove protection",
        "unprotected": "Protection has just been removed.",
        "confirm_replacevalueaesecure": "<strong> You have already entered values for this option. <\/strong> By clicking the OK button below, aeSecure will replace your configuration (<span class='text-danger'><strong> You will lose your values <\/strong><\/span>) by the one recorded on aeSecure site related to this option. <br\/><br\/> Do you wish to proceed with this update?",
        "savefromaesecure_hint": "When you change the programming of an option (e.g. the list of values blocked by option 2.3 - limits bots and spam), the native aeSecure file containing these values is not changed but <strong> an 'override' file is created instead<\/strong>. And it is this file that will be used when you enable the option again. The created override aims at<strong> avoiding losing your changes when you update aeSecure<\/strong>.",
        "onlypro": "Sorry, this feature is strictly reserved for aeSecure <strong>Professional<\/strong> users.",
        "app_title": "aeSecure - Web sites protection",
        "aeSecureGetIt": "<a href='%s' title='%s'>Buy aeSecure<\/a>",
        "aeSecurePageTitle": "aeSecure - Protection of your web site by .htaccess",
        "actions_base": "Basic security \/ required",
        "actions_other": "Additional Security",
        "actions_optimisation": "Site Optimization",
        "actions_seo": "SEO (Referencing)",
        "actions_misc": "Miscellaneous",
        "attention": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Warning:<\/span>&nbsp;",
        "config": "aeSecure configuration for this site <span style='font-weight:bold;'>%s<\/span> (%s)",
        "contact": "Contact",
        "continue": "Next...",
        "success": "Success",
        "failure": "Failure",
        "cancel": "Cancel",
        "demo": "Demo mode",
        "days": "days",
        "modal_close": "Close this window",
        "nochange": "No changes have been made.",
        "close": "Close",
        "security": "Security",
        "login": "Login",
        "password": "Password",
        "recommanded_state": "Recommended state",
        "folder": "Folder",
        "save": "Save",
        "filecreatedorupdated": "The %s file has been created or updated.",
        "clickonprotect": "Remember to click on the 'Protect!' button for the changes to be saved.",
        "intro": "Introduction",
        "important_info": "Important information",
        "information": "Information",
        "warning": "Warning",
        "links": "Links",
        "scan": "Scan",
        "more_info": "More info",
        "authorize_popups": "Your browser blocks popup windows. Please activate popups for your site.",
        "new_version": "<h4>Available update<\/h4>Your current version of aeSecure is version <span style='font-weight:bold;color:red;'>%1<\/span>.<br\/>The latest version is version <span style='font-weight:bold;color:green;'>%2<\/span>.<br\/><br\/>Do you want to install it?",
        "ajax_new_version": "<strong>aeSecure Version %s is available. <\/strong><br\/>Click on the %s button in the top right corner if you wish to install it.",
        "version_control": "Checks on aeSecure server if yours is the latest version of the application.",
        "latest_version": "Congratulations! You have the latest version of aeSecure.",
        "optimize": "Optimize!",
        "protect": "Protect!",
        "edit": "Edit",
        "permissions": "Permissions",
        "premium": "This feature is strictly reserved for Premium users.",
        "onlypremium": "Sorry, this feature is strictly reserved for aeSecure Premium users.",
        "filereadonly": "The %s file cannot be modified.",
        "fanfacebook": "Follow aesecure on Facebook",
        "action_enabled": "Enable",
        "action_disabled": "Disable",
        "state_enabled": "Activated",
        "state_disabled": "Deactivated",
        "feature_enabled": "<span style='font-size:1.5em;'>Security is activated<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Security has been deactivated<\/span>",
        "optimization_enabled": "Optimization has been <span class='label label-success'>activated<\/span>.",
        "optimization_disabled": "Optimization has been <span class='label label-warning'>deactivated<\/span>; The lines that made optimization possible in the .htaccess file have been deleted.",
        "are_you_sure": "Are you sure?",
        "readmore": "Read more",
        "not_joomla": "Yours is not a Joomla!® site. Therefore this feature is not available.",
        "sorry_notfree": "Sorry, this feature is not available in the free version of aeSecurec.&nbsp;",
        "sure_yes": "Yes, I confirm",
        "sure_no": "No",
        "test": "Test",
        "verify": "Check",
        "pleasewait": "Displaying the tab or showing the result may take some time. Please wait.",
        "pleaseselectatleastone": "Please select at least one option.",
        "filecontent": "Content of %s file",
        "hint_folder": "Name of the folder to be protected",
        "uptodate_php": "Congratulations! You are using the latest update of your PHP version (%s)",
        "test_tip": "If you wish to 'see' how this protection is working, please click here. You will then be able to test the protection prior to and after its activation."
    },
    "options": {
        "phpautocheck": "Automatically checks PHP version.",
        "phpautocheck_hint": "When aeSecure configuration page is displayed, controls the PHP version installed on your web server. Verification is performed directly from this site:  http:\/\/www.php.net\/releases",
        "seeadvancedoptions": "See advanced functions",
        "seeadvancedoptions_hint": "By disabling this option, the Premium as well as the Pro features will not be visible anymore if you have aeSecure free version. <br\/><br\/><strong> Please take a moment to consider buying a Premium version that will increase the security of your site.<\/strong>",
        "title": "Options",
        "form_title": "aeSecure settings",
        "hint": "aeSecure settings, language configuration, email sending, etc.",
        "save_hint": "Saving your new settings which will immediately become effective",
        "saved": "Your configuration has been saved",
        "site": "Web Site",
        "sitename": "Site name",
        "sitename_hint": "Enter the site name here; the name will be used e.g in emails sent by aeSecure.  This will help differentiate your sites in case you have several of them.",
        "logging": "Logging",
        "folderlog": "Log folder location",
        "folderlog_hint": "Full name of the folder that contains your CMS log files (if you use one)",
        "foldertmp": "Temporary folder location",
        "logwrite": "Save log files",
        "logwrite_hint": "When aeSecure blocks some access, do you want a file to be created in the log folder ? This will enable you to understand how aesecure works, and to know who is trying to infiltrate your system, etc.",
        "logtype": "Log Type",
        "logtype_hint": "When you visualize the whole set of log files, which format do you want to use ? text or xml ?",
        "foldertmp_hint": "Full name of the folder containing the temporary files of your site",
        "key": "Secret key",
        "key_hint": "The secret key is used to access this page : \/aesecure\/setup.php.  It is the variable that checks whether you are legitimate or not.  If you change the secret key, choose a strong one (it should have at least 10 characters).",
        "timeout": "Session lifetime (sec)",
        "timeout_hint": "The Session lifetime sets the duration, in seconds, between the required introduction of aeSecure usage key and your next action.  Do not set too long a duration as it is useless and might lead to potential identity theft.",
        "emailfromname": "Sender's name",
        "emailfromname_hint": "Name used by the person who sends mail",
        "emailfrom": "Sender's email (From)",
        "emailfrom_hint": "Sender's email (sender's email address, that is the email 'From' field)",
        "email": "Email address (To)",
        "email_hint": "Enter the email address where some notifications of intrusion alerts should be sent or the key to your site when you want to receive notification by email.",
        "sendemail": "Email sending",
        "sendemail_hint": "Some intrusion attempts will cause email sending. Do you want to enable this feature or would you rather not be notified?<br\/>This parameter is not taken into account as far as sending the key is concerned, just in case of oblivion.",
        "autocheck": "Automatic checking of your CMS version.",
        "autocheck_hint": "<strong>Only for Joomla!®<\/strong><br\/>If you have installed a CMS, automatically checks whether you have the latest version as soon as the configuration page of aeSecure is displayed",
        "emailsubject": "Email subject",
        "emailsubject_hint": "Enter here the subject of the mail sent by aeSecure.  You can use the following variables : '%SITENAME%' or '%SITEURL%', the former uses the site name whereas the latter uses its url.",
        "language": "Interface language",
        "language_hint": "Select the language used to display the various texts in aeSecure interface.",
        "misc": "Miscellaneous",
        "geocoding": "Geolocation",
        "geocoding_hint": "Enter a URL pointing to a GPS service based on an IP address that will return results in JSON format.  This service will be sollicited while sending mail to the site webmaster when it comes to locating, on a Google Map,  the place where the attack comes from.",
        "timezone": "Default Time Zone",
        "timezone_hint": "Default Time Zone to be used by your Apache server for all the functions related to dates\/hours.",
        "db": "Database",
        "dbname": "Name",
        "dbname_hint": "If your web site is dynamic, which is the case of a CMS site, enter your database name",
        "dbtype": "Type",
        "dbtype_hint": "Database Type (mysqli, mysql, mssql or other)",
        "dbhost": "Server name",
        "dbhost_hint": "The name of the server where your database is located. It usually is <strong>localhost<\/strong>",
        "dbuser": "Login (account name)",
        "dbuser_hint": "Login to use in order to log in to your database (on a local site, it usually is <strong>root<\/strong>)",
        "dbpassword": "Password",
        "dbpassword_hint": "Password to be used (on a local site the password field is usually left blank)",
        "dbprefix": "Prefix",
        "dbprefix_hint": "Table prefixes of your database",
        "debug": "Debug",
        "debug_hint": "Activates the debug mode",
        "debuglanguage": "Language Debug",
        "debuglanguage_hint": "In order to facilitate the translation of aeSecure language strings, all the strings from the language file  are prefixed by '#' and by the code to translate (example : #title#This is the translated title)",
        "demo": "Demo Mode",
        "demo_hint": "Activates the demo mode : no action will be really accomplished in this mode."
    },
    "82_compress": {
        "notsupported": "Sorry but your host has not enabled mog_gzip or mod_deflate modules allowing you to compress your data before sending it to the user. Consequently, the site compression, on the server side,  cannot be achieved.",
        "title": "Activating server-side compression",
        "intro": "Compression by the server (mod_gzip ou mod_deflate) is a feature offered by almost all site hosts.  It enables real-time compression of your page HTML code.   This compression makes the weight of your page significantly lighter and consquently it speeds up its display.",
        "full": "Compression <a href='https:\/\/developers.google.com\/speed\/articles\/gzip' title='How gzip compression works'>gzip<\/a> will reduce the size of your web page.  Decompression is handled by the browser without the user's knowledge.  Compression will cause a much faster transfer of the page and as a consequence a better user experience on your site.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;The speed of a website is taken into account by search engines.  The faster your site is the better its ranking will be.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Ever since Apache 2.0, mod_deflate is prederred to the ageing mod_gzip.",
        "test": "In order to test the speed difference, your site must be online and you should make the speed test with the tools below.  Take the test first enabling optimization, then retest after optimization is enabled ; you should notice a significant difference.<br\/><br\/><ul><li><a href='http:\/\/checkgzipcompression.com\/?url=%s' target='_blank' title='Check GZIP compression'>http:\/\/checkgzipcompression.com<\/a><\/li><li><a href='http:\/\/www.whatsmyip.org\/http-compression-test\/?url=%s' target='_blank' title='HTTP Compression Test'>http:\/\/www.whatsmyip.org\/<\/a><\/li><li><a href='http:\/\/gtmetrix.com\/' target='_blank' title='GTMetrix | Website Speed and Performance Optimization'>GTMetrix<\/a><\/li><\/ul>",
        "feature_enabled": "<span style='font-size:1.5em;'>Optimization is activated<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Optimization is deactived<\/span>",
        "hint": "<span class='text-success'>Compresses the HTML code of your page before it is sent to your user's browser (<span style='font-weight:bold;'>requires that your host allows you to use the server-side compression, otherwise optimization will have no effect.<\/span>).<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommended<\/span><\/span>",
        "recommanded": "Activated"
    },
    "31_permissions": {
        "seefile": "Click on this icon to display the file content (text files) or view the image (image files).",
        "makezip": "Zip the folder",
        "makezip_hint": "Creates a zip archive of the current folder and offers to download it.",
        "makezipconfirm": "Do you want to compress this folder? This may take some time...",
        "killfile": "Click here if you want to delete the file from your website.",
        "title": "Files and folders",
        "intro": "Specifies access rights (chmod) restricted to folders and files on your site.  So you can define which files can never be modified or the folders where new files cannot be written.",
        "full": "Malicious scripts have in common the ability to modify some files on your site in order to write a piece of code in them which will have a popup open or which will redirect you to an unfriendly site or create new files (php, .htaccess, ...) in your folders.<br\/><br\/> Other scripts will endeavour to steal information from your site configuration (configuration.php under Joomla!® or wp_config.php under WordPress), ...<br\/><br\/> By specifying access rights to restricted files, you add an extra level of protection to your site.",
        "confirm": "<span class='text-danger'>Changing the security level of this file\/folder may bring about problems such as e.g  the impossibility to access your site.<br\/><br\/>If you confirm your change, make sure your site still works properly.<br\/><br\/><span style='font-weight:bold'>In case of trouble, log in through FTP and restore the previous permission.<\/span><\/span>",
        "confirm_kill": "<span class='text-danger'>You are about to delete this file: <span style='font-weight:bold;'>%s<\/span>.  Are you sure?<br\/><br\/><span style='font-weight:bold'>Warning, after confirmation, the file is physically deleted.<\/span><\/span>",
        "file_removed": "<span class='text-success'>The file <span style='font-weight:bold;'>%s<\/span> has been deleted<\/span>",
        "previous": "Previous value",
        "feature_enabled": "<span style='font-size:1.5em;'>New permission(s) granted<\/span>",
        "chmodinfo_group": "<ul><li>First digit : your user account (owner)<\/li><li>Second digit : the group (group)<\/li><li>Third digit : the rest of the world (everyone)<\/li><\/ul>",
        "chmodinfo_sec": "<ul><li>0 : no rights<\/li><li>1 : Execution authorization<\/li><li>2 : authorization to write<\/li><li>4 : authorization to read<\/li><\/ul>",
        "chmodinfo": "Since numbers are added, value 5 means reading and execution (for a folder=opening rights), 6 : reading and writing, 7 : all rights, ...<br\/>recommended values are <span class='label label-success'>644<\/span> for files and <span class='label label-success'>755<\/span> for folders.  As a rule, never grant <span class='label label-danger'>777<\/span>",
        "chmodinfo_best": "<div class='chmodbest'>&nbsp;<input type='radio' disabled\/>&nbsp;<\/div> In principle, this is the best possible configuration for that file.",
        "chmodinfo_min": "<div class='chmodmin'>&nbsp;<input type='radio' disabled\/>&nbsp;<\/div>Do not select a lower permission than this, otherwise you may encounter access problems.",
        "chmodinfo_na": "<div class='label label-warning'>Warning :<\/div>&nbsp;Currently you are under Windows, therefore access rights  are ineffective and useless.  Proceed with adjustments and settings only from your site once it is in production.",
        "chmodhtaccess": "Warning, Some hosts require at least 444 permission level for  .htaccess.&#10;&#10; if you opt for a more restrictive permission level, you will probably get an error message (500) when you log in to your site subsequently.&#10;&#10; To restore the permission of  .htaccess, you will have to use your Ftp client and set 'chmod' to at least 444.",
        "chmod644": "Only your host's user account can read and write files, reading rights are granted only to the other accounts.",
        "chmod777": "Level 777 means that EVERYTHING IS ALLOWED: you grant every right to everybody. Normally, this permission should never be used because it is the best way to be hacked.",
        "can_be_deleted": "Normally this file could be deleted because it is useless on a production site.<br\/><br\/><span style='font-weight:bold;'>Delete this file<\/span>",
        "htaccess": "Set a wrong permission on this file and you will get a 500 error on your site.<br\/><br\/>The best functional permission is 444.  However you can try 440 or 400 but you run a high risk of not being able to access your site.  If so, use your FTP client to adjust the level access (chmod) of .htaccess manually  and set it to 444.<br\/><br\/><span style='font-weight:bold;'>This file is sensitive and important<\/span>",
        "backups": "If you store your backups in this folder, you should be aware that it is not a good idea to do so here because it can be accessed from the web. Ideally, you should use a folder outside your 'public_html'.<br\/><br\/><span style='font-weight:bold;'> If, in spite of that, you want to keep the \/backups  folder there, remember to secure it. Use aeSecure options 2.1 or 2.2 to restrict access to \/backups folder only to authorized users..<\/span>",
        "configuration.php": "It is recommended to set this file to 400 (max. 444) on a production site. If you need to change the general configuration of your site, set this to 644 ; then once the changes are made in your Joomla administration, restore access 400.<br\/><br\/><span style='font-weight:bold;'>This file is sensitive and important<\/span>",
        "htaccess.txt": "This file is useless.  If you already have a file named  .htaccess, you can delete this file.<br\/><br\/><span style='font-weight:bold;'>Delete this file<\/span>",
        "index.php": "This file should never be writable. you run the risk of having your site defaced.<br\/><br\/><span style='font-weight:bold;'>At the utmost, opt for 444<\/span>",
        "logs": "The logs file is important because it is used by the CMS to write your log files, so writing in it should be possible (authorization 5 or 7)<br\/><br\/><span style='font-weight:bold;'>Set a 755 access right.<\/span>",
        "php.ini": "This file must never be writable, a read only access level is sufficient (400, 440 ou 444)<br\/><br\/><span style='font-weight:bold;'>This file is sensitive and important<\/span>",
        "robots.txt": "This file must be accessible to search engine robots, a read-only access right is more than enough. Do not set an access level greater than 444.",
        "tmp": "The tmp folder is important because it is used by your CMS to write temporary files, so it must be made writable (authorization 5 or 7)<br\/><br\/><span style='font-weight:bold;'>Set a 755 access level<\/span>",
        "web.config.txt": "This file is useless on an Apache server.<br\/><br\/>On a Microsoft server, rename this file web.config to enable urls rewriting.<br\/><br\/>If you already have a file named web.config, you can delete this file<br\/><br\/><span style='font-weight:bold;'>This file is useless<\/span>"
    },
    "tools": {
        "ZipWebsite": "Download an archive file from the site.",
        "ZipWebsite_hint": "A zip archive will be created (this action will take some time!) and will be immediately made available to download &#10;&#10. Please do not close this window before getting the zip file.&#10;&#10. Note: The zipped archive will be instantly deleted from the website before it starts being downloaded. The file can't be 'downloadable' using any other method but this one.",
        "see_apache_error_log": "See the log of Apache errors.",
        "see_apache_error_log_hint": "The error log is the file in which your web server writes each problem encountered at your site level; eg so called fatal errors that cause a blank page to be displayed.\\n\\nWARNING\\nThe file can be bulky and displaying it could take a long time. For this reason, only a limited number of lines (the last  lines in the file) will be displayed.",
        "apache_error_log_skip": "The lines of the log file containing the following strings will not be displayed:",
        "apache_error_log_skip_short": "found  %s  times.",
        "lastmod-selectfolder": "Please, enter a folder name.",
        "lastmod-nonefound": "This folder does not appear in any results below",
        "lastmod-hidefolder": "Would you like to remove from this list all the files located in a specific folder (eg 'cache')? Enter the folder name below and click the 'Hide' button.",
        "lastmod-hide": "Hide",
        "lastmod-foldersample": "Enter a folder name, for example: cache",
        "fileread_notfound": "No row contains the string you are looking for.",
        "fileread_placeholder": "eg: accessdenied.php?=651",
        "fileread_ignore": "The rows containing one of the below values have been ignored: ",
        "fileread_specify_something": "Please specify a character string so that aeSecure can search for it and hide the rows containing it.",
        "see_apache_error_log_notfound": "The Apache error log is curently empty. From now on, when an Apache eror is detected, Apache will  write the error message in the log file. Currently, it is quite normal if an empty file or no file at all is found.",
        "see_htaccess_notfound": "The .htaccess file has not been found at the root of your site. Please activate aeSecure option 1.1 <br\/><br\/><span style='font-weight:bold;font-style:underline;font-size:1.5em;'>Note : In the absence of the .htaccess file, aeSecure can't run!<\/span>",
        "see_phpini_notfound": "No php.ini file has been found at the root of your site. The file is added when you activate aeSecure option 1.2. The absence of the php.ini does not impact the smooth running of aeSecure since the same information is also included in the htaccess file located at the root of your website.",
        "see_activity_notfound": "The activity file starts being created as soon as you activate either of aeSecure options.",
        "pentest-text": "Intrusion test \/ hacking",
        "pentest-hint": "This tool enables you to run a great number of 'malicious' queries to a site and to see how it will respond. When aeSecure is active, the aim is to stop all such attempts  (taking into account the configuration of your site) &#10;&#10; Note: The attacks are fictitious; none of them is real.",
        "title": "Tools",
        "coderemover-hint": "Trojan code remover is a script that scans js, php, html, shtml, htm, tpl, inc, asp, cfm, aspx and pl files of your site. It searches for a string of characters  which, when found, is deleted.&#10;&#10;  The purpose of this tool is to clean your site after it has been endangered.",
        "jamss-hint": "Joomla! Anti-Malware Scan Script is a script that detects certain keywords in the source files of your site.   Its purpose is just to display the files including these keywords that are likely to be malware.&#10;&#10; the tool tries to find out traces of a possible hacking operation.&#10;&#10;WARNING: JAMSS generates a large number of false positives, the messages must be  carefully analyzed  before intervening.",
        "false-positive": "<div style='color:red;width:80%;margin-left:100px;margin-right:100px;display:block;'><span style='font-weight:bold;'>Warning!!!<\/span> This kind of tool scans your site's files in search of patterns (a small list of potentially dangerous keywords).  For instance, the word 'iframe' is searched for because it is possible, with iframe, to display  information from a third party site.  However, buttons for social networks often use iframes.  Security programmes, such as aeSecure, also contain suh patterns as they are precisely developed to block  attacks.  So be very careful and analyse the information provided by the script correctly.<br\/><br\/>If you run a cleaning operation, remember to make a backup of your site first.  You may need it in case something goes wrong.<\/div>",
        "psi-hint": "PhpSecInfo is an audit tool of the PHP configuration of your site host",
        "phpinfo-text": "phpinfo",
        "phpinfo-hint": "phpinfo displays your site configuration and lists the modules that have been loaded.",
        "lastmod-text": "Recently modified files",
        "lastmod-hint": "Scans your web site in search of files recently modified during the last xxx days.  Thus, in case of hacking, you can spot the files that have been modified and pay attention to them.",
        "lastmod-explain": "If you want to find the list of files that have changed in the last 7 days, please indicate the number (7) below. You can mention a number between 1 and 99.",
        "lastmod-days": "Number of days (1-99)",
        "lastmod-files": "List of files modified in the last  %d days",
        "lastmod-number": "Number of files : %d",
        "allow_url_fopen": "Warning : allow_url_fopen must be active to ensure the proper functioning of Joomla!®.  So, for example, by disabling it the update feature of Joomla!® will not work anymore.",
        "HTML2PNG": "Captures the page using PNG format",
        "HTML2PNG_hint": "The capture of the page will generate a PNG image of what is displayed, so you can easily save your settings.",
        "see_htaccess": "Your .htaccess  file",
        "see_htaccess_hint": "Opens a popup that allows you to view the .htaccess file that has been implemented.",
        "see_phpini": "Your php.ini file",
        "see_phpini_hint": "Open a popup that allows you to view aeSecure php.ini file.  This file is in the root folder of your website.",
        "see_activity": "Your activity log",
        "see_activity_hint": "This file contains the list of actions you have taken (like e.g the activation of a feature). In case of problems, this file will let you know what has been done.",
        "reset_htaccess": "Uninstall aeSecure  .htaccess and  php.ini ",
        "reset_htaccess_hint": "Restores your basic .htaccess file by deleting all references to rules made by aeSecure.  If you want to completely uninstall aeSecure, please delete the aesecure folder of your website.",
        "reset_htaccess_notfound": "aeSecure  .htaccess file  was obviously not yet activated on your site.  No action was taken.",
        "reset_htaccess_done": "Your .htaccess file has been cleaned.  aeSecure code has been removed from it.  Only your personal code is there now.",
        "reset_htaccess_removed": "Prior to the installation of aeSecure, there was no  .htaccess file present.  Your current .htaccess file has been renamed 'OLD.htaccess'.",
        "aeSecure_no_more_active": "aeSecure is no longer active on your site"
    },
    "15_blockip": {
        "title": "Blocking IP addresses",
        "intro": "By blocking an IP address you'll prohibit a specific computer from accessing your website. When you suffer an attack, it is often useful to block the IPs of machines. Note: the IP address is often dynamic and therefore changes regularly.",
        "full": "The IP address is the fingerprint of all devices connected to the web. When accessing your site, the visitor obtains an IP address of his own which is unique. If you want to deny this person access to your site, block his IP address.<br\/><br\/><div class='text-primary'><strong>Note:<\/strong> the IP address is, most of the time, dynamic and assigned to the user when he starts surfing. By blocking the IP, you'll block temporarily the access to the site for him (unless the IP address is fixed and in this case, it is final).<br\/><br\/>Some spammers or 'crawlers' (ie scripts that parse all pages on your website) have a static unvarying IP address.<\/div>",
        "preface": "Please enter one IP address per line and \/ or separated by semicolons.<br\/>Example : 255.255.255.255, 128.128.128.128, 123.123.123.123 to block these three IP addresses.",
        "saved": "Your changes have been saved.<br\/><br\/><span class='lead text-danger'>In case of access problems, you will need to edit the  .htaccess file using your FTP client.<\/span>"
    },
    "21_protectFolderIp": {
        "preface": "Only IP addresses listed below will have access to the folder.  Any other conection attempt will be redirect to an \"Access denied\" page.",
        "title": "Restricting access to a folder by IP address",
        "intro": "Access rights to a folder (e.g \/administrator) will be restricted to one or several predefined IP addresses.  So only those computers will gain access to the site.",
        "full": "By restricting access rights based on one or several IP addresses you make it impossible for other computers to log in to the folder. This access security is the best one you can implement by excluding everybody  by default, except one computer or another,  following the white list principle.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Warning:<\/span>&nbsp;If your IP address is dynamic  (which is the case for most Internet Access Providers), you will need to use this function to add a new IP address whenever a change is made.",
        "restrict": "Access to the restricted folder based on the visitor's address",
        "done": "Logging in to the %s folder is limited to the %s IP address",
        "removed": "The restriction based on the IP address has been removed.",
        "addressip": "IP addresses",
        "hint": "<span class='text-danger'>Only click on the button if you wish to block access to the folder belonging to the computer having this IP address.<br\/><br\/><span style='font-weight:bold;'>You will block the other connections; if this is what you want, click on the button.<\/span><\/span>",
        "hint_ip": "It is your current IP address"
    },
    "11_protecthtaccess": {
        "preface": "If, after enabling this protection, you should get an error in the display of your website, please refer to the <span style='font-weight:bold;text-decoration:underline;'><a href='http:\/\/aesecure.com\/documentation\/faq.html' target='_blank'>FAQ<\/a><\/span> of aeSecure",
        "feature_enabled": "<span style='font-size:1.5em;'> activated aeSecure <\/span> <br\/><br\/>Please make sure that your site remains functional by testing some URLs. If you come across any problem, please consult the <span style='font-weight:bold;text-decoration:underline;'> <a href='http:\/\/aesecure.com\/documentation\/faq.html' target='_blank'>FAQ<\/a><\/span><br\/><br\/>If rewriting of your URLs is no longer active, please activate aeSecure option 7.1.",
        "title": "Implementation of aeSecure .htaccess file",
        "intro": "The .htaccess file is read by your web server whenever it is called for.   AeSecure .htaccess file contains a great number of rules that will increase the security of your web site and enhance its optimization.",
        "full": "The  .htaccess file is read by your web server whenever a url is run on your site whether to display a web page or to download a file. This file is of paramount importance for the protection of your site because it will scan the URL and decide whether it is legitimate or not.<br\/><br\/>aeSecure will replace your current file in order to add a URL control mechanism and determine if the URLs are legitimate or if they must be blocked out as potential threats to the integrity of your site. <br\/><br\/>Your current file will be included in the one generated by aeSecure<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp; Your current file, before it was implemented  by the aeSecure file, will be saved in this folder: \/aesecure\/setup\/backup.",
        "copy": "Copy of aeSecure's .htaccess main file",
        "copyfromto": "Copy %s to %s",
        "state_enabled": "Installed",
        "state_disabled": "Uninstalled",
        "recommanded": "<span style='font-weight:bold'>aeSecure's  .htaccess file is required; it must be installed.<\/span>",
        "keep_old_content": "The content of the original .htaccess file, prior to aeSecure installation, has been included in aeSecure's  .htaccess file.",
        "renamed": "Your previous %s file has been renamed %s",
        "test": "<p>Some files can be accessed via a URL wheereas they should not be. Such is the case for instance of files installed by default in Joomla. Example (<a href='%HTTP_HOST%\/LICENSE.txt' target='_blank'>LICENSE.txt<\/a>,<a href='%HTTP_HOST%\/joomla.xml' target='_blank'>joomla.xml<\/a>,<a href='%HTTP_HOST%\/README.txt' target='_blank'>README.txt<\/a>, ...)<\/p><p> Other files should be specifically protected e.g <a href='%HTTP_HOST%\/configuration.php' target='_blank'>configuration.php<\/a> or <a href='%HTTP_HOST%\/.htaccess' target='_blank'>.htaccess<\/a> : You should not be able to access those urls.<\/p><p>Some scripts attempt to target Joomla sites and by so doing they check the existence of certain files, for instance some images that Joomla installs by default. Their presence shows that the site is a Joomla site and according to the presence of such or such a file, it becomes possible to determine the number of the installed Joomla version.  Some images installed by default in Joomla: <a href='%HTTP_HOST%\/images\/joomla_black.gif' target='_blank'>images\/joomla_black.gif<\/a>, <a href='%HTTP_HOST%\/images\/banners\/white.png' target='_blank'>images\/banners\/white.png<\/a>, <a href='%HTTP_HOST%\/images\/sampledata\/apple.jpg' target='_blank'>images\/sampledata\/apple.jpg<\/a><\/p><p> Hackers also try to access the operating system files: boot.ini or win.ini and for that purpose they launch a great number of querries like: <a href='%HTTP_HOST%\/index.php?option=com_users&task=..\\..\\..\\..\\..\\..\\..\\..\\..\\boot.ini%00.htm' target='_blank'>index.php?option=com_users&task=..\\..\\..\\..\\..\\..\\..\\..\\..\\boot.ini%00.htm<\/a>.  If your web server is not properly protected, it would be possible for the content of (boot.ini in this case) to be displayed.<\/p><p>aeSecure's  .htaccess file will prevent attempts to access hidden files\/folders<ul><li> i.e files whose names start with a dot (.),  .htaccess being one of them, but you could also have folders such as '.backup', '.git', ...   As for hidden folders, aeSecure will prevent accessing them via a URL.<\/li><li>installed by default like for example. <a href='%HTTP_HOST%\/images\/sampledata\/index.html' target='_blank'>images\/sampledata<\/a><\/ul><\/p><p>Several URLs will be blocked by aeSecure, such as<ul><li>what is called template fingerprints <a href='%HTTP_HOST%\/index.php?tmpl=offline' target='_blank'>index.php?tmpl=offline<\/a>, <a href='%HTTP_HOST%\/index.php?tp=1' target='_blank'>index.php?tp=1<\/a> or again <a href='%HTTP_HOST%\/index.php?template=beez' target='_blank'>index.php?template=beez<\/a>.<\/li><li>URLs taking up some forbidden codes like carriages returns or  'escape characters'.<\/li><li> 'PHP Easter Eggs' that reveal the PHP version being used on your site: <a href='%HTTP_HOST%\/index.php?=PHPE9568F34-D428-11d2-A769-00AA001ACF42' target='_blank'>index.php?=PHPE9568F34-D428-11d2-A769-00AA001ACF42<\/a><\/li><li>celles ayant du code javascript dans l'url comme p.ex. <a href='%HTTP_HOST%\/index.php?%3Cscript%3Ealert%28%27Msg%27%29;%3C\/script%3E' target='_blank'>index.php?%3Cscript%3Ealert%28%27Msg%27%29;%3C\/script%3E<\/a><li>...<\/li><\/ul><\/p><p>Many other attacks via URLs will be blocked by the aeSecure .htaccess file...<\/p><h4>In the absence of aeSecure's  .htaccess file, each of the above queries will display at best an error message and at worst a content page.  aeSecure's protection will stop any attempt before it reaches your web site and therefore, before it is run and before the web server responds to it.<\/h4>",
        "hint": "<span class='text-success'>Copies aesecure's  .htaccess file at the root of your web site and inserts your original file at the bottom of the created file.<br\/><br\/><span class='text-success' style='font-weight:bold;'>Indispensable and required.<\/span><\/span>"
    },
    " 11_protecthtaccess": {
        "preface": "If, after enabling this protection, you should get an error in the display of your website, please refer to the <span style='font-weight:bold;text-decoration:underline;'><a href='http:\/\/aesecure.com\/documentation\/faq.html' target='_blank'>FAQ<\/a><\/span> of aeSecure"
    },
    "73_editrobots": {
        "title": "Editing robots.txt file",
        "intro": "The robots.txt file is located at the root of your site and gives search engines instructions regarding what you authorize or not. So, for example, thanks to robots.txt you can prohibit search engines from indexing the files of your administrator folder or other sensitive and private folders.",
        "full": "The robots.txt file will allow or disallow the search engine to index your entire site or part of it. Let's take the case where you have a \/administrator folder: You do not want search results to show links to your administrator folder.  If you have personal files like \/backups, \/confidential\/members_only ... you do not want links to be returned to anyone searching for  Google for example . <br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i> &nbsp;Information <\/span>&nbsp; If you are using a CMS, you already have such a file, otherwise, it may be missing <br\/><br\/><span class='label label-warning'><i &nbspclass='icon-warning-sign icon-white'><\/i>&nbsp; Warning: <\/span>&nbsp; Note that search engines are not 'forced' to respect the robots.txt file. An 'unscrupulous' search engine could even try to parse the file to see what you would try to 'hide'.",
        "explain": "If you need any information about the syntax to be used, please visit <a href='http:\/\/robots-txt.com\/' title=\\\\\"Robots.txt - Manuel d'implémentation\\\\\" target='_blank'>http:\/\/robots-txt.com<\/a>.<br\/><br\/><span class='label label-success'><i class='icon-info-sign icon-white'><\/i>&nbsp;Tip:<\/span>Remember to indicate your<a href='http:\/\/robots-txt.com\/ressources\/robots-txt-sitemap-xml' target='_blank'>Sitemap<\/a>in the robots.txt file.<br\/><span class='label label-success'><i class='icon-info-sign icon-white'><\/i>&nbsp;Tip:<\/span>You can test the quality of your robots.txt file here <a href='http:\/\/www.searchenginepromotionhelp.com\/m\/robots-text-tester\/robots-checker.php' target='_blank'><\/a>",
        "saved": "Your modifications have been saved."
    },
    "45_dbadmin": {
        "failure": "<span class='bg-danger lead'>Be careful, you have at least one account <strong>%s<\/strong> that is still active in your database.<br\/><br\/><a href='http:\/\/aesecure.com\/en\/documentation\/features.html' target='_blank'>Click here if you need more information<\/a><\/span>",
        "congrats": "Congratulations! No login <strong>%s<\/strong> is currently active on your site.",
        "nologinprovided": "Please indicate which login is to be verified, for example: \"admin\".",
        "preface": "The default administrator account under Joomla!® is \"admin\". However, if you want to test another account, please enter its name here below.",
        "full": "Imagine for a moment that you are a pirate if only a few seconds. You are facing a login screen where you will be asked to enter a login and password. What is the login that you will try to enter, knowing, moreover, that you are dealing with a Joomla!® site?  The answer is: <strong> You write \"admin\" in the login field <\/strong><br\/><br\/> Once the login \"admin\" is actually still used on the site in question, the pirate will already have done 50% of the job: becoming an existing login and having superior rights <br\/><br\/> Whatever the computer system, you should never use the default accounts as they are well known. Hackers try them first. If you still use such an account, change it straight away! <strong>Create a new  super-admin account  and disable the \"admin\" account. <\/strong>",
        "intro": "Do you still have, by any chance, an active \"admin\" account on your site?",
        "title": "Searching for \"admin\" account."
    },
    "51_backupdb": {
        "title": "Exporting the database in SQL format.",
        "intro": "After execution, you'll obtain a text file containing the SQL code to completely rebuild your database. <br\/><br\/> This is therefore a complete backup of your database.",
        "full": "Exporting the database enables you to keep a backup of it but will also prove very convenient when searching for malicious code since you get a text file where it is easy to manually search for that might be stored in articles, modules, etc. <br\/><br\/> If you have a local site you can restore your database by loging in to your local phpMyAdmin interface and executing the SQL code contained in the file.",
        "protect": "Execute"
    },
    "18_devilnumber": {
        "preface": "The area on the left allows you to search and display the list of folders and files having the desired chmod value. <u> No changes will be made to your website<\/u>. <br\/><br\/> The area on the right lets you define new values for folders and files. If you click the 'Protect!' button in the right area, the folders\/files with the chmod you want will not simply be displayed but the chmod will be adapted to reflect your choice. <br\/><br\/><span class='label label-info'> <i class='icon-info-sign icon-white'> <\/i>&nbsp. Reminder: <\/span> a folder chmod should be set to 755 and a file chmod should be set to 644.",
        "title": "Checking permissions (chmod) of folders and files",
        "intro": "When the access level of a file is set to 777, it means that the file can be accessed, modified and run by anyone.  The situation is worse when folders are concerned : anyone can create a file, insert malicious code in it and run it.<br\/><br\/>In principle, no scenario demands that you should have files or folders with such access level.",
        "full": "777 means that anyone who is able to access your web server files can read,write and run any file,  create as many executable files as they wish. Therefore any webmaster should protect himself against this scenario.<br\/><br\/>   777 is also known as  <strong>the devil's digits<\/strong>.<br\/><br\/>Click on the Check tab to allow aeSecure to scan your web site (It takes some time) in search of such files.  If some of them can be found, change the permission levels!   For a file, opt for 644, and 755 for a folder.  Note that you might come across dysfunctional parts of your site if a legitimate programme requires 777; in this case, you will have to inform the developer of the application.",
        "congrats": "No folder or file has a permission level (chmod) equal to the searched mod.   In the case of a chmod 777, this is great news!",
        "nbr_files": "Number of occurrences found : %d",
        "feature_enabled": "The search for files and folders is completed.",
        "windows": "Your site runs on a Windows server, the <strong>chmod<\/strong> of a file is not managed by Windows, so this feature is not possible on this server.  If you are currently on a server in its developement phase, please test the option on your live server."
    },
    "84_minify": {
        "title": "Minification of css, html and javascript files",
        "intro": "Thie minification feature will reduce the weight of css, html and javascript files by deleting on the fly useless spaces and carriage returns in files.\n\nSince the weight of files is reduced, uploading the page is made faster.",
        "full": "When a developer creates a stylesheet (css file) or a javascript code (js file), it ensures that the code is readable by a human by inserting indentations, adding here and there newlines to separate rules, functions, etc., otherwise, the code would be unreadable and unmanageable. <br\/><br\/> These spaces and carriage returns are characters and they increase a file size. <br\/><br\/> For a web browser, these characters are absolutely useless and can be removed. Consequently, the file size is smaller and therefore displayed more quickly by the browser. <br\/><br\/> For tools measuring performance such as YSlow or GTmetrix the minification of files matters. This option takes care of the job.",
        "test": "Before activating this option, display one of your website page, then do a \"view source\",  i.e. press CTRL-U to view the source code of the page. Locate the link to a css file having a more or less important number of lines. If the file is not \"minified\" you can read it fairly easily and the file layout will be clear <br\/><br\/>Then, enable the option and then renew the operation to display the file again. You will then have a better idea of minification at work.",
        "feature_enabled": "<span style='font-size:1.5em;'>Minification is activated.<\/span><br\/><br\/><span class='lead text-danger'> If you experience access problems, you will have to edit the .htaccess file through your FTP client.<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Minification is deactivated<\/span>",
        "recommanded": "Activated on a live production site, deactivated on a test\/developement site.",
        "minifycss": "Minifiy the style sheets (.css files)",
        "minifyjs": "Minify javascript scripts (.js files)",
        "minifyjswarning": "The minification of a js file is often poorly tolerated and leads to a javascript error. This error, visible from the debug console of your browser, will stop the execution of javascript functions, which will result in malfunction of your website. <br\/><br\/> Therefore please check your site, check it again and again if you enable this feature in order to make sure that it still works as desired.",
        "minifyhtml": "Minify HTML files (.htm and .html files)",
        "explain": "<span class='label label-danger'><i class='icon-warning-sign icon-white'><\/i>&nbsp; Warning: <\/span>&nbsp;<span style='color:red;'>minification is a very sensitive process: your Javascript files may stop working and lead to JS errors, which will disrupt the display of your site and block the execution of any JS code.<\/span><br\/><br\/><span class='label label-info'> <i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp; you do not need to enable this option if option 8.1 is already activated and if it is  alreadsy running on your site."
    },
    "dashboard": {
        "title": "Multisites",
        "noaccess": "The multi-site interface is restricted to aeSecure professional\/business users. It is a central screen that allows you to monitor the different aeSecure installations you have made on your client sites. You can see the installed versions, update them, download a zipped file of the site, export the database, monitor the attack log and plenty of other features.<br\/><br\/>The \"Pro\" offer is an option that can be purchased on our site:  aeSecure.com.",
        "clickmore": "Click on OK to learn more",
        "contact": "Contact",
        "actions": "Actions",
        "aesecureSetup": "Display of aeSecure configuration screen.",
        "aeSecureInstalledVersion": "aeSecure version currently installed on the site",
        "backend": "Display of the backend administration page of the site.",
        "addsite": "Add a site",
        "addsite_prompt": "Please indicate below the full URL of the site to add <br\/><br\/> Make sure to give the address of the site only like so: <strong> http:\/\/yoursite\/aesecure\/setup.php? VERY_VERY_LONG_KEY <\/strong>",
        "addsite_done": "The site has been added. The page will be refreshed for the new site to be displayed...",
        "configuration": "State of the current configuration of various features of aeSecure",
        "dashboardversion": "multisites v",
        "edit": "Editing the site data",
        "email": "Opens an email sending screen in your mail client with the addressee prefilled to the site manager's address. No email is sent automatically, it will just be displayed so as to allow you to send it yourself.",
        "exportdb": "Exports the site database<br\/><br\/><span style='font-weight:bolder;color:blue;'>Please wait. This  takes a long time...<\/span>",
        "footer": "aeSecure, optimizing and securing your Apache Web sites",
        "frontend": "Frontend display of the site",
        "hideerrorsiste": "Hides the error sites",
        "home": "Opening your site in a new tab",
        "log": "View log of attacks for this site",
        "onlyIfPremium": "<span class='text-danger'> Note: Only available if the remote site has the Premium version of aeSecure <\/span>",
        "masterversion": "Reference version of aeSecure",
        "mailToWebmaster": "aeSecure: the new (v%1) version has been installed on your %2 site.",
        "notresponding": "aeSecure does not respond. It has either been uninstalled or it is an old version.",
        "PHPVersion": "PHP version on the Web site",
        "reinstall": "Runs aeSecure update on this site. Re-installs the software application.",
        "releaseinfo": "Updates information.",
        "removesite_hint": "Click here if you want to remove this site from your multisite management screen.",
        "removesite_prompt": "Please confirm that you definitely intend to remove %1 site from your multisite management screen.",
        "setup": "Access aeSecure management interface",
        "sites_network_errors": "%1 site(s) could not be verified due to a network connection error. The ajax verification query failed. These sites appear on a red background.",
        "sites_with_old_version": "You have %1 install(s) with an old version of aeSecure. The sites are displayed on a red background.",
        "subtitle": "In green: updated sites. In red: non updated sites. In orange: those which do not meet the information query.",
        "subtitle_buttons": "The icons in the button bar are dependent on the version of aeSecure installed in the remote site.",
        "zip": "Download a ZIP archive of the site.<br\/><br\/><span style='font-weight:bolder;color:blue;'> Please wait. This operation takes a very long time...<\/span>",
        "click_and_modal": "Click here to view the information in a modal window",
        "11_not_installed": "aeSecure has not been completely installed.  Please enable options 1.1 and 1.2.",
        "eraser": "Clears the 'cache' and 'temp' folders of the remote site.",
        "cache_cleaned": "The various 'cache' and 'temp' folders have been cleared.",
        "lastmod": "Displays the list of files that have recently been modified on the remote site.",
        "download_as": "Download the table using format",
        "error_apache": "See the error log of the Apache web server.",
        "allow": "Enable this feature",
        "allow_hint": "By enabling this option, you will allow your site to transmit encrypted information when it is questionned by a multi-site interface trying to learn about its configuration.<br\/><br\/> This option should only be activated if, and only if, you have a PRO account and you intend to include your site in your multi-site management screen. In any other case, leave the option unchecked.",
        "notconfigured": "The %s site s is not configured to allow connections via the Multi-site interface. Please login to the interface of aeSecure  site, display the Options screen and enable the multi-site feature."
    },
    "74_editredirection": {
        "title": "Redirection management system",
        "intro": "Redirects are used to correct some urls so as to point them to other addresses such as: redirect http:\/\/yoursite\/page-deleted  to http:\/\/yoursite\/new-page. It is a particularly efficient tool when it comes to correcting the \"dead\" urls that are mentioned by such tools as Google Webmaster Tools.",
        "full": "During the lifetime of your website, some pages will be deleted and others will be displaced. Perhaps you will also program shortcuts like e.g. http:\/\/yoursite\/contact pointing to a page on your site for which the creation of a menu entry is not possible.<br\/><br\/>One of the most frequent uses of redirects is to correct broken links that are reported by, for example, Google Webmaster tools.",
        "explain": "<span class='text-info'><strong>Warning: If you make a syntax error, you will inevitably get a server 500 error message. In this case you will have to access your site via FTP to correct your \/.htaccess file. Therefore it is wise to have your FTP client to hand <\/Strong><\/span>",
        "saved": "Your changes have been saved"
    },
    "72_seo_www": {
        "preface": "If you intend to use a CDN to speed up the display of your site, you must force the www. prefix.",
        "cant_be_used": "This feature can only be used if your site: <ol> <li> is not a localhost site (127.0.0.1 or) <\/li>, <li> or a subdomain (eg http:\/\/sub-domain.yoursite.fr) and <\/li> <li> if your site is accessible via http:\/\/your-site.fr\/index.php or http:\/\/www.your-site.fr \/ index.php , ie if it is located at the root level of your domain name. <\/li> <\/ol>",
        "title": "Forcing www. prefix (or not) in URLs",
        "intro": "In order to avoid 'duplicate content', it is recommended to force the urls of your site  to mention www. or not.  You will then benefit from better referencing.",
        "full": "When a search engine hits your site it may access the site using a URL such as www.mysite.be or alternatively quite simply mysite.be.   For the search engine those are two different URLs and therefore two different sites. <br\/><br\/>In this context, the search engine will notice that both sites have the same content.  For the search engine this means 'duplicate content' and your ranking will be put at a disadvantage.<br\/><br\/>It is therefore recommended to force your site URLs to start with or without the www. prefix.   If you do not wish to use it, someone who came to your site by manually typing  www.mysite.be would see the URL automatically adapted and changed into mysite.be.",
        "with_done": "Change made. Your site will no longer be accesible using mysite.fr but only www.mysite.fr",
        "without_done": "Change made; your site will no longer be accesible using www.mysite.fr but only mysite.fr",
        "test": "<a href='%s' target='_blank'>Visit your site %s<\/a>",
        "state_enabled": "www. forced",
        "state_disabled": "www. deleted",
        "feature_enabled": "<span style='font-size:1.5em;'>Prefix www. forced<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Prefix www. deleted<\/span>",
        "hint": "<span class='text-success'>Forces or not 'www.' prefix in urls, someone who came to your site using  mysite.be would see the URL changed into www.mysite.be.<\/span>",
        "recommanded": "Depending on your personal choice"
    },
    "errors": {
        "checkconfiguration": "Please check your configuration screen (Tools - Options) and correct the following errors :",
        "err_missing_root_htaccess": "Using aeSecure presupposes the existence of a .htaccess file located at the root of your site. Please activate function 1.1 of aeSecure in order to create this file, otherwise aeSecure will remain inactive.",
        "err_htaccess_no_aesecure": "The .htaccess file located at the root of your site is not that of aeSecure which is currently inactive on your site. Please activate aeSecure feature 1.1 to include the protection code.",
        "incorrect_installation": "The installation of aeSecure is not complete. The <strong>%s <\/strong> is missing, which should not be the case. Please reinstall a new version of aeSecure.",
        "dberror": "Error in database access : %s",
        "folderlognotfound": "Your site does not have any log folder. Please correct the path to that folder by displaying aeSecure options screen and specifying an existing folder, all this about option \"%s\"",
        "dirnotwritable": "the folder is protected against writing",
        "createerror": "Error when creating\/updating the %s file.  If the file exists, make sure it is not read-only.",
        "error_copying": "An error occurred while copying the %s file<span class='label label-important'>%s<\/span>",
        "filenotfound": "File %s was not found",
        "cantkill": " %s file cannot be deleted, check the file permissions",
        "invalid_params": "Incorrect parameters",
        "noaccessfolder": "You do not seem to have permission to access  %s folder",
        "siteroot_foldernotfound": " %s folder does not exist in the root folder of your web site",
        "foldernotfound": "Nonexistent folder : %s",
        "impossible_check_jversion": "It has not been possible to check, online, if your Joomla!® version is up-to-date.",
        "old_php": "Your current PHP version is <strong>%s<\/strong>.  A newer version exists (%s).   If your site is hosted on a  shared server, check on your host's FAQ and see if it is possible to activate a more recent version.  This is usually done by adding a specific line in the main .htaccess file of your site.",
        "old_php_major": "<span style='color:red;'>A major PHP version is available. It is more recent than yours.<\/span>..  Indeed, your site is based on PHP  <strong>%s<\/strong>. You might activate version %s. <span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Warning:<\/span>&nbsp; Migrating from a major version to another one is not a small job; Please do this locally, on a test site to make sure that your site runs properly.",
        "not_supported": "<span class='label label-danger'>Error:<\/span><span style='color:red;font-style:italic;'>&nbsp;Oups, this feature is not implemented yet.  Feature number : <strong>%s<\/strong>.<\/span>"
    },
    "91_cleantmpfolder": {
        "preface": "Clears folder \"%1\".  If you want to adjust the location of this folder, please click on the Tools -> Options menu.",
        "clean": "Temp folder(s) purged: %",
        "title": "Clearing the temporary folder of your site",
        "intro": "Remember to clear the temporary folder of your site from time to time.",
        "full": "The temporary folder may contain quite a great number of files installed by applications.   Those files are not intended to stay; They are only there during the execution of a programme feature.<br\/><br\/>The files take up a lot of space and reduce your disk space quota.  Remember to delete those files now and then.",
        "feature_enabled": "<span style='font-size:1.5em;'>Temporary folder has been cleared.<\/span>",
        "hint": "<span class='text-success'>Delete the temporary files...<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommended<\/span><\/span>",
        "protect": "Clear!"
    },
    "blocked": {
        "Access denied to this folder": "Accessing this folder\/file directly via a URL is prohibited.",
        "access to robots": "Accessing the robots.txt file directly is not allowed.",
        "PHPSESSID attempt": "Session fixation (Bruteforce PHPSESSID)",
        "javascript attempt": "Attempt at running a javascript code in the URL.",
        "SQL injections": "Attempted SQL injections",
        "This query string isn't allowed": "This URL isn't allowed",
        "Probited backend file's access": "Access to a backend file denied.",
        "Probited file's access": "Attempt to access a file via a URL whose access is strictly forbidden",
        "Probited hidden file\/directory access": "Attempt to access a file\/folder whose URL access is not authorized",
        "Unknown component": "Unknown component",
        "Are you a spammer ?": "Are you a spammer ? ",
        "Invalid referrer": "Invalid and\/or unauthorized Referrer",
        "Invalid characters in the querystring": "The URL contains unauthorized characters.",
        "base64_encode within the url": "base64_encode detected in url",
        "Functions found in the querystring": "Call functions from the url",
        "No file upload allowed on this website": "Uploading files is strictly prohibited on this site",
        "Illegal words in the query string": "The url contains illegal words that are in the black list",
        "Unauthorized access to a monitored folder": "Attempt to access a folder whose access is monitored",
        "Shell attacks": "Shell attack type detected",
        "I think you don't need to access this folder...": "Stay away, this is none of your business",
        "Access to this file is prohibited by server's rules": "Attempt to access a file whose access is prohibited by server's rules",
        "Block specials methods from HTTP Request": "This type of request is prohibited",
        "Trying to modify the REQUEST \/ PHP GLOBAL variables": "Attempt to modify global variables or web request to server",
        "You're definitly a bad guy.  Why trying SQL injections?": "You're definitely a bad guy.  Why try SQL injections?",
        "PHP Easter Eggs": "PHP Easter Eggs",
        "No direct access to this file": "No direct access to this file; Please go to aeSecure management interface",
        "Session timeout": "Your session has expired, please restart aeSecure management interface ",
        "Incorrect key": "Incorrect key (or expired session)",
        "Block xss tries": "Attempting to execute a so-called xss attack",
        "Registration page disallowed": "Creating a user account cannot be done on this web site.",
        "com_media fileupload disallowed": "The media manager forbids uploading files",
        "Trying to run a javascript code from the url": "javascript code detected in url",
        "Fingerprint attacks detected": "Fingerprint type of Attack detected",
        "This script isn't allowed to be executed": "Attempt to access a php script which is not explicitly authorized by web server rules."
    },
    "quickinfo": {
        "generatedon": "Report generated on %s",
        "buttonhint": "Displays a tabular report containing the configuration of this site.&#10;%IsPremium%",
        "function": "Features",
        "quickoverview": "Quick preview",
        "fullreport": "Global report",
        "value": "Value",
        "remarkversion": "The storage functionality was introduced with aeSecure version 1.2. If you previously had an older version, you will have to reactivate the feature (eg disable and enable again option 1.3) for that option to appear above."
    },
    "tips": {
        "did_you_know": "Did you know that...",
        "close_hint": "By clicking on the \"close\" button, you ask aeSecure not to display this message",
        "joomla_quick_icons": "There is a <strong> 'Quickicons' module for Joomla! <\/strong> that adds in your Joomla! administration a direct link to aeSecure management interface. If you wish to install the module, please click on the link below corresponding to your Joomla! version, then download the file and install it in your extensions manager interface. Note that this is an administration module. You will therefore have to display the modules for the administration 'client'. Activate the module and assign it, for example, to the 'icon' or 'menu' position of Joomla!.",
        "folder_ip_restriction": "About access restriction to a file (eg \/administrator), the best protection is offered by option 2.1 of aeSecure. Indeed, you would block access to everyone except a few machines (IP addresses). However, you need to have a fixed IP address <strong> <\/strong> which is quite rare, but if this is your case, opt for this kind of protection.",
        "protect_aesecure": "... accessing  your \/aesecure folder requires such a long and complex key that it is impossible to find out what it is. However, it could be possible for some spyware on your computer to access the URL of your aeSecure interface. To ensure the security of your interface, consider using options 2.1 or 2.2 to block access to the \/aesecure folder.",
        "protect_dashboard": "... If you are a PRO user and you use the multi-site interface, remember to protect access to the \/dashboard folder thanks to options 2.1 or 2.2 <hr\/> Increased safety:  you could install the multisite interface only locally (localhost server) to avoid the centralized management of your sites being accessed online."
    },
    "27_blockrobotstxt": {
        "title": "Prevents nosey people from accessing the robots.txt file.",
        "intro": "robots.txt is the name of a file located in the root of your site that contains information for search engines; index this, don't index that.   This file is intended for search engines (the bots); not for humans who could discover the architecture of your site.",
        "full": "When you access the url <a href='%SITEURL%robots.txt' target='_blank'>%SITEURL%robots.txt<\/a>, you will open a text file containing lines like Disallow: \/administrator to tell  bots not to index the administrator folder of your site.<br\/><br\/>This is perfect except that you're divulging that you have such a folder on your site.<br\/><br\/>On some sites, there may be a Disallow: \/Secrets, for instance, that would be a folder of your site that you want to keep 'secret' and that only people who know the existence of the folder can access.  Some sites are built in that manner and they do not provide special protection.  Those sites are then very vulnerable to the disclosure of information contained in the robots.txt file.<br\/><br\/>The protection offered by option 2.7 consists in detecting who accesses the robots.txt file and in authorizing the access only to known bots (from a white list).",
        "test": "Before you enable this option, go to this url: <a href='%SITEURL%robots.txt' target='_blank'>%SITEURL%robots.txt<\/a>.  You'll see the content of the file. Then activate the option and try again.  The content of the file will be hidden.",
        "hint": "Blocks access to the robots.txt file to humans.<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommand\\u00e9<\/span>",
        "recommanded": "Enabled"
    },
    "92_cleancachefolder": {
        "title": "Purges the cache folder(s) of your site",
        "intro": "The cache folders are, if they exist, \/cache and \/administrator\/cache folders of your site.  Clearing the cache ensures that a new version of the page will be sent to the user.",
        "full": "On dynamic sites like those based on a CMS, once the page has been generated after multiple requests to the database, the HTML code of the page is saved on the server so that if an another person requests the display of the same page, the hidden page may be used and thus speed up the display of your site.<br\/><br\/>When you want to force the refresh of a page, just clear the cache to make sure that a new request to the page will cause data to be read from the database.",
        "feature_enabled": "<span style='font-size:1.5em;'>Cache folder(s) cleared<\/span>",
        "hint": "<span class='text-success'>Purges the cache<\/span>",
        "protect": "Purge!",
        "clean": "Cache folder(s) purged : %s"
    },
    "12_protectFolder": {
        "skip": "A %s file is already existing on your site. The file has not been modified by aeSecure <span class='label label-info'>Info<\/span>",
        "title": "Protection of folders",
        "intro": "<ol><li>Copy of .htaccess files in various major folders of your site in order to restrict access to them, to prevent running php code in e.g \/tmp, etc.<\/li><li>Copy of a  php.ini file in the root folder of your site.<\/li><li>Scans your web site and places an index.html file in every folder that does not contain any.<\/li><\/ol>",
        "full": "<ol><li>Some of your site folders should never be accessed via a URL. Such is the case e.g of your  \/tmp  folder: There is no reason why someone should try to access it via a URL like  http:\/\/your_site\/tmp\/.  Placing a  .htaccess file there with a 'deny all'  garantees that nobody will be able to access it, but above all it insures that a potential hacker will not be able to insert a php file which would jeopardize your site if it were run.<\/li><li> The  php.ini  file at the root of your site, if it is accepted by your host, allows for the definition of values which will close some doors like e.g  the possibility to open a remote php file (allow_url_fopen).<\/li><li> Every folder of your web site is scanned as well in order to verify the existense of an index.html file in each of them; if not, aeSecure will copy a file in folders deprived of an index.html file so as to prevent a visitor from accessing a URL pointing to that folder, which would allow him to see the content of the folder in the absence of an index.html file.  Indeed, depending on the configuration of your web server, the list of files and folders may be displayed, which could be detrimental to the security of your site.<\/li><\/ol>",
        "hint": "<span class='text-success'>Places a few .htaccess files in the major folders of your site.   Subsequently, scans the tree structure of your site and creates a index.html file in the folders where it is missing.<br\/><br\/><span class='text-success' style='font-weight:bold;'>Indispensable and required.<\/span><\/span>",
        "install": "Implementation of the %s file<span class='label label-success'>Success<\/span>",
        "copy_index": "Copy of index.html files",
        "no_index_copied": "Congratulations! All your folders already contained a index.html file."
    },
    "16_blockpartURL": {
        "title": "Blocking actions using URL items",
        "intro": "After analyzing the logfiles of your web server, you will see attempts to access specific URLs <ul> <li>, URLs that refer eg to nonexistent file names  on your site (eg food.php) <\/li> <li>, URLs whose parameters are dangerous (eg attempts to upload file) <\/li> <\/ul> This option (1.6) will allow you to specify rules that will block those URLs.",
        "preface": "<span class='label label-warning'> <i class='icon-warning-sign icon-white'> <\/i> Warning: <\/span> If the lines you add contain an error syntax, your website will immediately be inaccessible (error 500). In this case, you will have to connect to your site through your FTP client, edit the htaccess file located in the root of your site and manually delete the lines you have just added. <br\/> <br\/> <div class='text-center'> <span class='label label-primary'> <i class='icon-info-sign icon-white'> <\/i> If you want to perform multiple blocking actions, please just encode one per line. <\/span> <\/div>",
        "url": "Encode here the blocking actions to perform <u> the URL <\/u> (what precedes the potential question mark)",
        "url_sample": "Click the \"%ADD%\" button to obtain examples..",
        "querystring": "Encode here the blocking actions to perform <u> on the URL parameters <\/u> ( the part located after the question mark)",
        "querystring_sample": "Click the \"%ADD%\" button to obtain examples.",
        "full": "When you analyze your logs, you will see how hackers attempt to access your site.\r\nThey will try to exploit known security holes such as eg, end of year 2013, the exploit of a flaw in the JCE component which allowed to upload an image using a url having thiese instructions <strong> option=com_jce & task=plugin & plugin=imgmanager <\/strong>. \r\nOther exploits will try to run a php library that might be present on your site (eg openflashchart).\r\nEvery time these are lines in the access log of your site that reveal an attempt at penetrating your site.\r\nOption 1.6 enables you to block urls in two ways: either on a word  basis in the URL or thanks to the presence of a word in the URL parameters. The parameters are what follows the question mark (if present).",
        "addmsg": "Please enter below a regular expression to block URLs based on the presence of one or more words <strong><u style='color:red;'>in the URL parameters <\/u><\/strong>.<br\/><br\/>The parameters of a URL are expressed in everything that follows the question mark (?) present in the URL. If you have a URL like index.php? task = upload, you could block <strong>the upload task<\/strong> like this: <pre style='margin:0 0 2% 3%;width:90%;'>.*(task=upload).*<\/pre><h4 style='background-color:rgb(205, 241, 177);margin:10px;padding:10px;border:1px solid green'>To test your regular expressions, please use this site: <a href='http:\/\/regex101.com\/' target='_blank'>http:\/\/regex101.com\/<\/a><\/h4><hr\/>Please enter your restriction below: <br\/>",
        "addmsg2": "Please enter below a regular expression to block URLs based on the presence of one or more words <strong><u style='color:red;'>in the URL parameters <\/u><\/strong>.<br\/><br\/>The parameters of a URL are expressed in everything that follows the question mark (?) present in the URL. If you have a URL like index.php? task = upload, you could block <strong>the upload task<\/strong> like this: <pre style='margin:0 0 2% 3%;width:90%;'>.*(task=upload).*<\/pre><h4 style='background-color:rgb(205, 241, 177);margin:10px;padding:10px;border:1px solid green'>To test your regular expressions, please use this site: <a href='http:\/\/regex101.com\/' target='_blank'>http:\/\/regex101.com\/<\/a><\/h4><hr\/>Please enter your restriction below: <br\/>",
        "saved": "Your changes have been saved <br\/><br\/><span class='lead text-danger'>In case of access problems, you will have to edit the .htaccess file through your FTP client<\/span>",
        "placeholder1": "Example: .* (\\\/Secret\\\/).* to block access to the secret folder or .* (\\\/ secret\\.php).* to block the secret.php script.",
        "placeholder2": "Example: task=upload to block all URLs that would have a parameter named task and whose value would be upload."
    },
    "28_blockuseragent": {
        "title": "Blocks access based on the 'user-agent'",
        "intro": "Each access to your site is performed through a software application, most often a browser. Except exceptional cases, each program has a signature: its name. This information is provided for each connection to your site in the 'user-agent' variable . <br\/><br\/> Some of them are known to be scripting attacks as eg 'BOT\/1.0 (BOT for JCE)' that tries to hack your site using a security hole in the JCE editor (issue fixed long ago). <br\/><br\/> This option will allow you to block access to your site based on the user-agent in use.",
        "full": "<div class='label label-warning'> Warning: the user-Agent is not reliable information <\/div><p>&nbsp;<\/p><p> The user-Agent information is initialized by the script \/ program that accesses your site. Therefore any script can register 'Firefox' as user-Agent; so, it is this information that you will see. However, some scripts do not spoof and use a signature like eg 'BOT\/1.0 (BOT for JCE)' which clearly states what it is trying to do; in this case trying to hack your site through the JCE editor.<\/p><p> Option 2.8 allows you, once you have identified adverse agents on your site, to prohibit them  any further access. They will be immediately blocked. <\/p>",
        "explain": "Please enter below the names of the user-agents you want to block out (one line per name).<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;You can enter a regular expression -- to test them, do not hesitate to resort to this site: <a href='http:\/\/regex101.com\/' target='_blank'>http:\/\/regex101.com\/<\/a>).<\/div>",
        "saved": "Your changes have been saved.<br\/><br\/><span class='lead text-danger'>In case of access problems, you will have to edit the .htaccess file through your FTP client.<\/span>",
        "placeholder": "Example: .*(BOT for JCE|MJ12bot).* which is a regular expression that enables blocking  the 'BOT for JCE or MJ12bot scripts."
    },
    "pentest": {
        "title": "Intrusion test",
        "intro": "This script will run a lot of queries to your website to ensure they are stopped by aeSecure (<em>so long you have activated the appropriate blocking measures<\/em>).  The Result column will then appear in <span class='status403 success'>green<\/span> in this particular case.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;&nbsp;No attack is being carried out. This is just simulation.<br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Warning:<\/span>&nbsp; If you have enabled the sending of an email notification in the event of an attack, remember to disable this option before running the tests. Otherwise you will receive several emails.",
        "run": "Run the test",
        "finished": "All tests have been performed; if the result is highlighted in green, aeSecure has blocked the attack (HTTP status 403)"
    },
    "mimetype": {
        "title": "MIME type detection",
        "intro": "This script will scan the whole of your website, and for each file that is found in it, will determine its type (is it a picture, is it executable code?, etc.) <strong> not on the basis of the file extension but on its content <\/strong>. The purpose is to identify eg PHP executable codes hidden in files whose extension is jpg. <br\/><br\/> Only files whose content differs from what is expected will be displayed below <br\/><br\/> <span class='label label-danger'><i class='icon-warning-sign icon-white'><\/i>&nbsp; WARNING: <\/span>&nbsp; Mime-type is detected based on the fileinfo() function of PHP. This function 'tries' (best estimate) to determine the type based on its content: <strong> Therefore this function is not 100% reliable <\/strong> but still gives an excellent indication of the content type <br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp; Warning: <\/span>&nbsp; You could have 'false positives', so, to stay on the safe side, always edit the mentioned file before deciding to delete it. Do not access the file from a URL (which would execute the hidden code in an image for example) but open it with a text editor instead.",
        "hint": "Scans your website looking for files whose content differs from what was expected, based on the extension&#10;&#10;Example: a .file whose extension is png but containing PHP code.",
        "danger": "The file extension does not match its content but more importantly, the content can be executed: if the file is accessible from a URL, this is potentially hazardous.",
        "folder_hint": "If you want to check files in a specific folder, please enter the name of the folder here.",
        "detected": "Content detected",
        "seefile": "Click this icon to display the content of the TEXT MODE file: even if the file extension leads you to believe that this is an image, you will see the ASCII code of the file. If the file contains a virus, it will not be run, but its source code will be displayed."
    },
    "29_blockreferrer": {
        "title": "Blocks access based on the 'Referrer'.",
        "intro": "The referrer, if mentioned, is the site that generated a query on your own site. For example, when someone comes to your site after searching on Google, the referrer is 'www.google.com'.<br\/><br\/>When a third-party site displays a RSS feed proposed by yours the referrer is the domain name of the third party site. By blocking a particular referrer, you will prohibit traffic from those sites.",
        "full": "<div class='label label-warning'> Warning, the referrer is not some reliable information; it may be empty or manipulated.<\/div><p>&nbsp;<\/p><p>Some sites steal content. They take advantage of the existence of a RSS feed in your site to steal traffic if unfortunately they are better referenced than you<\/p><p>Other sites could display images stored on your site (and steal part of your bandwidth); see also option 8.9 Preventing Hotlinking.<\/p><p>Other sites may propose a link to a page on your site whereas you do not want anyone, from that site, to get to yours. <\/p><p> You could still tell the search engines that the link provided on a third party site shoud not lead to your page because you do not want to be related in any way with that site. <\/p><p> There are many reasons why a third-party site should be blacklisted. <\/p>",
        "explain": "Please enter below the domain name to be blocked, one line per domain name (e.g. <strong>www.thieves.uk<\/strong>",
        "saved": "Your modifications have been saved. <br\/><br\/><span class='lead text-danger'> In case of access problems, you will have to edit the .htaccess file through your FTP client.<\/span>",
        "placeholder": "Example: semalt.com to block all traffic from that site."
    },
    "93_crontab": {
        "title": "Crontab - scheduled execution on the server",
        "intro": "Depending on your hosting conditions, you might be able to access the 'crontab': it is an option, on the server side, which allows you to do a job, eg every hour, once a day, the first day of the month, etc.<br\/><br\/>aeSecure Pro offers users a script that can for instance be run every hour to detect files that might have been added or changed on your server without your consent. In that case, an email notification will be sent to you, allowing you to act immediately.",
        "full": "Depending on your configuration, <strong> aesecure.sh <\/strong> script will: <br\/><dl><dt>1. Analyze the last modified date of the files <\/dt><dd> The script will analyze the modification date (or creation date) of your server files and make a record of the files that have been changed since the last run. So if you run the script every hour, you will be notified by email of the list of added \/ modified files during the last hour. <br\/><\/Dd><dt>2. Backup your database <\/dt><dd>Once a day, your database will be saved and stored in aeSecure <strong> \/pro\/crontab\/db_backups <\/strong> folder. <Br\/><br\/><\/dd><dt>3. Make a list of the latest added users in your database <\/dt><dd>Once a day, aeSecure will check if new users were added to your database, and if it is the case, you will receive an email notification that will use data from those users and their membership to the different groups of the CMS. So concerning Joomla!, you will see if the users are registered','authors','administrators', ... <br\/><\/dd><\/dl> Please click on the 'Configure' tab to make your choices and take the path to the script; path to add to your 'crontab.",
        "option1_title": "Listing of recently modified \/ added files",
        "option2_title": "Backup of your database",
        "option3_title": "Listing of new users",
        "explain": "Please configure aesecure.sh script according to your needs using the options below. After completing setup, login to the control panel of your site (host cpanel). Follow your host's instructions to add a script in the crontab.<br\/><br\/> The access path of the script is this: <blockquote><strong>%1 <\/strong><\/blockquote> There is no parameter to be added to the script. The only thing you need to do is to choose the recurrence rate you want (eg every day, every hour and a half).",
        "actualconfig_extra": "The following information is stored in the <strong> file%s <\\\/strong>. <br\/><br\/> Most of the configuration data comes from aeSecure options available in the top menu (Tools- menu> Options) <br\/><br\/> The other data can be configured from the &quot; Configure & quot; tab here on the left.",
        "actionstofire": "Actions to take",
        "sendemail": "Send email notifications",
        "duration": "Duration between two programming sessions of your script",
        "duration_hint": "Please match the duration here with your programming: If you have programmed the execution of aesecure.sh script every eight hours in your crontab, please enter exactly the same value below.",
        "one_hour": "One hour",
        "two_hours": "Two hours",
        "four_hours": "Four hours",
        "eight_hours": "Eight hours",
        "one_day": "One day",
        "savelogs": "Keeps a copy of login files",
        "savelogs_hint": "When aesecure.sh script detects a change in files, when it detects new users registered in the database ... it generates a list in a log file which will then be sent by email. By enabling this option, the log files will be stored in the \/pro\/crontab\/logs\/.",
        "sendemail_hint": "Enables sending emails to the aesecure.sh script: eg if a file has been modified, aeSecure sends an email notification when this option is activated."
    },
    "17_blockfiles": {
        "title": "Denying access to some files via URL",
        "intro": "Your website contains some files with direct URL access  which must be made impossible; This is the case for instance for configuration.php files (Joomla!®) or wp-config.php (WordPress) or again for .htaccess files, readme.txt, etc.",
        "full": "When an ill-intentioned person wants to harm your safety measures, he\/she will try to access such files as wp-config.php or configuration.php to try and view the content of these configuration files. He\/she will also attempt to display the .htaccess file or text files such as changelog.txt, php.ini, readme.txt, etc. to view their content and understand your site (is it based on a CMS, which one, what version, ...?).<br\/><br\/> You might also have detected a suspicious file on your website such as phpinfo.php, \/media\/bad.php ... that you want to make it impossible to use through direct access to eg http: \/\/yoursite\/phpinfo.php.",
        "preface": "Please enter a file name per line and\/or separated by semicolons.<br\/> Example: .htaccess;configuration.php;wp-config.php  to block URL access to these 3 files. <br\/><br\/> <span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Warning: <\/span>&nbsp; The prohibition applies to all files on your site, regardless of the exact location of the file.",
        "saved": "Your changes have been saved.<br\/><br\/><span class='lead text-danger'> In case of access problem, you will have to edit the .htaccess file via your FTP client. <\/span>"
    },
    "94_password": {
        "title": "Password generator",
        "intro": "This tool will enable you to generate a random password with a length varying from 10 to 40 characters. The password will be generated and composed of uppercase and lowercase letters, numbers and special characters.",
        "full": "Choosing a good password is crucial in securing your website. Brute force attacks multiply and simple passwords are guessed in seconds or instantly for values such as 'admin', '123456', 'qwerty'...<br\/><br\/>  A small online tool like \\\"<a href='https:\/\/howsecureismypassword.net\/' target='_blank'> How Secure Is My password?<\/a>\\\" enables you to test the strength of your password.<br\/><br\/> The generator proposed by aeSecure will suggest a random password with a length vatying from 10 to 40 characters. The suggested word will be a mix of lowercase letters, uppercase letters, numbers and special characters. <br\/><br\/> A password such as <strong> Mw$02z3plq <\/strong> will take 96 years to be found out, which will give you plenty of time to see the attack coming. However an even longer password is preferable because the computing power of computers is constantly improving.",
        "password_length": "Desired length of the password",
        "password_generated": "Your password",
        "protect": "Generate a password"
    },
    "install": {
        "minify_disabled": "To avoid conflicts when installing the new version of aeSecure, option 8.4 that was enabled for your site has been disabled. Please reactivate it manually.",
        "install_done": "<strong>aeSecure %s has been installed successfully.<\/strong>",
        "key": "In order to ensure access to this configuration screen only to authorized persons, access to this page requires a key to be inserted in the URL. When you want to access this page, please use this URL :",
        "key_change": "If you want to modify this key, go to the Tools -> Options screen.",
        "postinstall": "<div class='text-primary'><strong>Note :<\/strong>&nbsp; For security reasons, aeSecure installation files  have been automatically deleted.<\/div>",
        "disclaimer": "<span id='disclaimer'>Please test aeSecure on a copy of your site, don't test it on a production site; <span style='text-decoration:underline;'>Never<\/span>.  Activating protection or deactivating a feature (e.g prohibiting uploads) may cause your site to become dysfunctional.  Making a site more secure is a necessary operation, but it remains difficult to achieve and you should make sure (by testing) that your site is in perfect working order.<\/span>",
        "disclaimer_checkbox": "The author of aeSecure will not be held responsible for whatever might go wrong.",
        "disclaimer_limitation": "A protection system such as aeSecure aims essentially at closing entry points used by hackers to infiltrate your system; if your site is already infected by malware, please clean it first and foremost.",
        "disclaimer_limitation_checkbox": "I do understand that aeSecure improves the protection of my site but cannot garantee total security ( just like any other security programme)",
        "pleaseaccept": "In order to complete the installation of aeSecure, please tick the boxes.",
        "finish": "Complete the installation"
    },
    "14_old_htaccess": {
        "placeholder": "For example: 'SetEnv PHP_VER 5_4' if you want to enable PHP 5.4 on your website (if supported by your host).",
        "title": "Editing your personal  .htaccess file manually",
        "intro": "You may occasionally need to edit your  .htaccess file to add a specific line like the activation of a PHP version, a redirection rule etc.",
        "full": "After repeatedly checking that your syntax is correct, insert the lines in the memo field then save your modifications which will be inserted at the beginning of the  .htaccess file at the root of your site.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Warning:<\/span>&nbsp; The .htaccess file is read whenever queries to your site are made.  If the added lines contain a  syntactic error or an invalid instruction, your web server will inevitably display  a 500 error message.   If you have access to the logfiles of your web server, you can read the reason for the error.  Whatever the scenario, you will have to log in to your site through FTP (FileZila for example), then to go to the root of your web site and edit the  .htaccess file to delete the incorrect lines.",
        "explain": "You will find below the content of your personal  .htaccess file before aeSecure was installed.   If you want, you can modify those rules or add others.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Warning:<\/span>&nbsp;If the lines you add contain a syntactic error, your web site will immediately be inaccesible (error 500).  In this case you will have to log in to your site through FTP, to edit the .htaccess file which is located at the root of your site and manually delete the lines you have just added.",
        "saved": "Your modifications have been saved.<br\/><br\/><span class='lead text-danger'>In case of difficulty, you will have to edit the .htaccess file through your FTP client.<\/span>"
    },
    "44_blockcomp": {
        "placeholder": "For example: com_prettyform;com_survey;com_whatever to block these three components.",
        "title": "Blocking access to some Joomla!® components",
        "intro": "In the logfile of your Apache server (not Joomla!® server), you can see a large number of lines concerning urls of this type: index.php?option=com_xxxxx while com_xxxxx has never been installed on your site.  This is a hacking attempt of your site:  com_xxxxx is probably a Joomla!® component known to have a security breach and hackers scan the web, searching for sites that can possibly be attacked.<br\/><br\/>Use this option to block those URLs.",
        "full": "Examine your redirect component (administration Joomla -> Components -> Redirect) or your Joomla!® log file and analyse the failed queries.  If you see a large number of URLs like ?option=com_xxxxx and if that component is not installed on your site (and will not be), you should block that component in order to  protect your site against a potential security breach.<br\/><br\/>To do so, use the form and specify the name of the component (com_xxxxx).   aeSecure will block all URLs where the name appears in the URL.",
        "test": "See what Joomla!® does when com_xxxxx is accessed: <a href='%HTTP_HOST%\/index.php?option=com_xxxxx&' target='_blank'>%HTTP_HOST%\/index.php?option=com_xxxxx&<\/a>.<br\/><br\/>If you see a 404 page, good for you, but it shows that the query got to joomla!®.  A 'prohibited access' page would have been better when the query was run dozens \/ hundreds of time on your site.",
        "explain": "Enter below the names of the components that you want to block.  Always start with 'com_' followed by the name of the component  (e.g 'com_prettyform').<br\/><br\/>To enter several of them, just seperate them with a semi-colon (com_prettyform;com_survey;com_whatever).",
        "blocked": "The %s components will be blocked."
    },
    "13_error_reporting": {
        "title": "Hiding Apache errors",
        "intro": "On a live site, make sure that your visitor cannot see PHP errors that would give a potential hacker too much information.",
        "full": "When a programming error occurs, the web server can be configured so as to display it.  This is perfect for a site in its development phase as it guides the coder in his quest for bugs, but on a live site, if the display is activated, the visitor could have access to too much information, like the name of your data base, the name of a table, the path to the faulty file, ... this information can be used by a hacker.<br\/><br\/>On a live site, it is wise to avoid displaying errors.",
        "state_enabled": "Prohibited display",
        "state_disabled": "Activated display",
        "feature_enabled": "<span style='font-size:1.5em;'>Possible errors will never be displayed.<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Errors will be displayed to visitors.<\/span>",
        "hint": "<span class='text-danger'>By clicking on the 'Activated display' button you ask the web server to display errors, which can prove dangerous on a live site.<\/span>",
        "recommanded": "Prohibited display"
    },
    "19_maintenance": {
        "title": "Activating\/Deactivating the maintenance mode",
        "intro": "This mode allows anybody (except you) getting to your site to be redirected to a page displaying a message like 'This site is being maintained ...'. ",
        "full": "When you have to maintain a site or when you want to prevent all access to your site because you have detected a potential intrusion, the maintenance mode allows you to redirect everybody -- whatever the URL being used -- (frontend, backend, file transfer, ...) to a page like  '... this site is being maintained...'. This will give you enough time to analyse  your site and bring the necessary modifications. <br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Warning:<\/span>&nbsp; Once you are done with maintenance, get back to this option to deactivate the maintenance mode and allow all your visitors access to your site again.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;This feature is different from the one you will find in your CMS (e.g Joomla!®) because activating the maintenance mode applies to your entire site (everything is blocked).",
        "pagetitle": "\"%s\" Site is currently being maintained.",
        "comeback": "Please come back later...",
        "contact": "<a href=\"mailto:%s?subject= %s Site is being maintained\">Please contact us<\/a>",
        "confirm": "Are you sure?  No further connection will be possible except yours which is based on your IP.",
        "hint": "<span class='text-danger'> Activating the maintenance mode will redirect all connections to your site to a page indicating the site is being maintained.<br\/><br\/><span style='font-weight:bold;'>Excepting you, nobody will be able to access your site.<\/span><\/span>",
        "recommanded": "Deactivated"
    },
    "22_protectPassword": {
        "title": "Password protection",
        "intro": "Places a .htpasswd file in a directory in order to restrict its access only to holders of a login and password.<br\/><br\/><span class='label label-primary'><i class='icon-primary-sign icon-white'><\/i>&nbsp;Advice:<\/span>&nbsp;Ideally you should at least protect your administrator folder.  If your backup folder is located in your tree structure (e.g \/sauvegardes), remember to secure it as well.",
        "full": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Warning:<\/span>&nbsp;The protection is achieved by implementing a  .htpasswd file which forces your user to enter a login\/password before being able to access a page in the specified folder.<br\/>Ideal to protect the administrator folder of Joomla!®, but this may bring about problems with some components.",
        "restrict": "Protection of a folder by login\/password",
        "done": "User <span class='text-success' style='font-weight:bold;'>%s<\/span> created. Please use the password <span class='text-success' style='font-weight:bold;'>%s<\/span> to log in to the folder <span class='text-success' style='font-weight:bold;'>%s<\/span>.",
        "testit": "Click here to test your protection : <a href='%s' target='_blank'>%s<\/a>",
        "keepit": "<h5><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Warning:<\/span>&nbsp;Please keep this information in a safe place.<\/h5>",
        "error": "Error when creating the .htpasswd file, unprotected folder"
    },
    "23_blockbots": {
        "title": "Restricting robots and reducing spam",
        "intro": "Prevents robots from accessing your web site, namely scripts, programmes, web site downloaders whose signatures are notoriously known to be malicious.  Also blocks some keywords that have been blacklisted.",
        "full": "When a program such as a web browser accesses your site, it is identified by its signature, it is the \"user_agent\". Just like viruses, <a href='http:\/\/perishablepress.com\/ultimate-htaccess-blacklist\/' title='Ultimate htaccess Blacklist | Perishable Press' target='_blank'>some signatures are known<\/a> to be bad visitors (the 'bad bots'); they are applications used by attackers,  spammers, etc.  While it is true that it is quite easy to falsify this information, visitors whose user_agent is a bad bot have no legitimate reason to visit your site.<br\/><br\/>By activating protection, you will block quite a large number of these bad bots.",
        "hint": "<span class='text-success'>By activating this security feature you will deny known robots access to your site.<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommended<\/span><\/span>",
        "recommanded": "Activated"
    },
    "24_blockfileupload": {
        "title": "Preventing files from being uploaded",
        "intro": "Hacking a website is often done by uploading a malicious script.  By blocking upload to your server, you protect yourself against this type of attack. <strong>Read the detailed explanations before activating the protection.<\/strong>",
        "full": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Warning:<\/span>&nbsp; By prohibiting the upload, you will block a user who wants to load an avatar, you will also block the update of a CMS (Joomla!® or any other), you will block the update of a component, etc.   Indeed, these updates require downloading the update file before proceeding with the installation.<br\/><br\/> However you can disable upload except when you do your maintenance, which is when you reactivate upload for the duration of the update.",
        "confirm": "Are you sure?  Unless you get back here to reactivte upload, you won't be able to update your CMS any more.",
        "hint": "<span class='text-danger'>By prohibiting upload, you won't be able to update your CMS any more and\/or extensions, you won't be able to allow your visitors to upload an avatar either (among other things). <br\/><br\/><span style='font-weight:bold;'>Be sure you know what you are doing...<\/span><\/span>",
        "recommanded": "Unless you know exactly what you are doing, leave on deactivated."
    },
    "25_noarchive": {
        "title": "Preventing some files from being indexed.",
        "intro": "Prohibits search engines from providing direct links to zip and MS Office files on your site.",
        "full": "By prohibiting search engines from providing direct links to files on your site, you force users to visit your site, to see pages of the site, but above all, in terms of security, you warrant that you will not have a file that should have remained discreet (e.g 'passwords.doc') which would be retrievable from search engines.   This seems obvious and yet ... Google is teeming with such links.",
        "hint": "Requires search engines not to index your zip and MS Office files (accdb, doc, docx, mdb, ppt, pptx, xls, xlsx, zip).<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommended<\/span>",
        "recommanded": "Activated"
    },
    "26_blockhiddenfolders": {
        "title": "Blocking access to hidden files and folders",
        "intro": "Files and folders whose names begin with a dot (.) are hidden files\/folders.  On some sites, folders like. Backups,. Git. Svn ... may be present and, by default, accessible via a url.",
        "full": "On your Apache site, a file or folder whose name begins with a dot (.) is a hidden file\/folder  and the system hides it on some screens.  At the web access level (by url), Apache does not block access and so it is possible to access eg http:\/\/yoursite\/.backups\/mybackup.  However, chances are that if you took care to create a hidden folder the reason is not to make the files accessible from a URL.<br\/><br\/>The purpose of this protection is to prohibit such access.  Except for the .htaccess file systematically blocked by aeSecure, you can decide to block access (recommended) or on the contrary to allow it for someone who knows the URL.",
        "hint": "Prohibits access to hidden files and folders, i.e those whose names start with a dot (.)<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommended<\/span>",
        "recommanded": "Activated"
    },
    "41_joomlaversion": {
        "title": "Checking Joomla!® version",
        "intro": "As long as you use the same major version (1.5.x, 2.5.x, 3.x), there is <span style='font-weight:bold;'>no<\/span> reason why you should not update your Joomla!® site.",
        "full": "When a new version of Joomla!® is available to the community, it is not just because new features have been developed but also because security issues have ben fixed by the Joomla!® team.  It is therefore essential and vital to have the latest version running.<br\/><br\/>However if you have a Joomla!® 1.5 site and you wish to install a 2.5 or 3.x version, we are dealing with an upgrade: The major version change means that you will have a more or less important job to do (probably an upgrade from 1.5.x).  In this case, make plans for the upgrade and do it when you have enough time. It may take several hours or days depending on the complexity of your site and the extensions used.",
        "current": "Your current version of Joomla!®: %s",
        "updated": "Latest Joomla!® version: %s",
        "youvethelast": "Congratulations! You have the latest version of Joomla!® (%s)",
        "url_package": "URL of the update package: %s",
        "unknown": "Sorry, it has not been possible to determine the latest version of Joomla!®"
    },
    "42_blockcomusers": {
        "title": "Blocking native registrations of Joomla!®",
        "intro": "Some malicious scripts target Joomla!® sites and access a public URL which allows for the creation of countless phantom\/ghost users.  If you want to prohibit the creation of user accounts on your site and\/or if you use a third party component (like Community Builder or JomSocial), deactivate the native component (com_users)",
        "full": "Even in the absence of a menu link and\/or of the Joomla!® connection module, it is easy to create an account by accessing the url <strong>index.php?option=com_users&view=registration<\/strong>, which enables scripts to create users automatically.  Such users (so called phantom\/ghost  users), will be prompt to spam your site, your commentary fields, your forum, etc.<br\/><br\/>Moreover, if you allow such users to upload an avatar, you take a risk because the image could be some malicious code or could have a displaced visual.<br\/><br\/>By blocking Joomla!® native user manager (com_users) you will block this type of script.<br\/><br\/>If you are using Community Builder, you can also block com_users and allow registration via CB.  To do this, in the general settings of the User Manager, disable the registration and then go to CB general settings and activate registrations <strong> regardless <\/strong> of those of the site.",
        "test": "Click below to display, in a new tab, the creation page of a user: <a href='%HTTP_HOST%\/index.php?option=com_users&view=registration' title='Display the creation page of a user thanks to Joomla!® native component' target='_blank'>Create a new user<\/a>.<br\/><br\/>If the protection is not active yet, you will see the account creation page being dispayed.  If your Joomla! site is configured to automatically accept registrations, a script can therefore create ghost users endlessly.<br\/><br\/>Once you have activated the protection, you will see aeSecure protection page that prevents the display and thus the creation of ghost users.",
        "hint": "<span class='text-danger'>Blocks the registrations of com_users component, which reduces spam considerably. If you want to allow visitors to register with your site, do not enable this option.<br\/><br\/><span style='font-weight:bold;'>Be sure you know what  you are doing...<\/span><\/span>",
        "recommanded": "Unless you know exactly what you are doing, deactivated"
    },
    "43_protectadmin": {
        "title": "Protecting Joomla!® administration files",
        "intro": "Blocks direct access (by url) to the files in  \/administrator  folder.  Some files (.xml files for example) may bring too much information to a potential hacker (e.g the specific version of your Joomla!®)<br\/><br\/> Access to media files (css, js, png, etc.) will remain possible.",
        "full": "Deprived of protection, the files in the \/administrator folder are accessiblevia a URL.  It is quite possible to access .ini files (language files), .xml files (manifest), .txt files, etc. which are located in your administration folder by simply typing the complete address of the files.<br\/><br\/>The trouble is that those files allow us to know a lot about your site (e.g the exact version of Joomla!®)  (e.g 2.5.16).  Those files should therefore be blocked by your web server.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Non-essential if you have protected your administration with a password or restricted it with an IP address.",
        "test": "Click below to display, in a new tab, your Joomla site manifest : <a href='%HTTP_HOST%\/administrator\/manifests\/files\/joomla.xml' title='Display your Joomla!® site manifest' target='_blank'>Display your Joomla!® site manifest<\/a>.<br\/><br\/>If the protection is not active yet, Joomla!® installation manifest will be displayed: you will see the exact version number.<br\/><br\/>The manifest files of your components are also addressable.  So a hacker\/cracker could try and find out if you have such and such a component and which version you have.",
        "recommanded": "Activated"
    },
    "49_showredirect": {
        "title": "Displaying the content of Joomla!® redirects",
        "intro": "From Joomla!® 1.7 on, Joomla! ® stores in the redirect component the urls that have failed, for example if the URL refers to a component that is not installed.  Examining this table can teach you a lot because it shows you the URLs used by hackers to try and enter your site.",
        "full": "Hackers use scripts that scan all the internet and try to access blindly urls that are fallible.  Thus, you could see a large number of access attempts to a URL such as %HTTP_HOST%\/index.php?option=com_xxxx where com_xxxx is a component that has never been installed on your site.<br\/><br\/>The aim of hackers is to try and find out sites where this component would be installed because a security breach is probably known. So they attempt to exploit it.<br\/><br\/>Try and review this redirection table regularly in order to learn how to make your site safer.",
        "column_oldurl": "URL used, unrecognized by Joomla!® (page 404).&#10;&#10;Analyse the url to see if it is malicious; if it mentions a component that has never been installed, examine the parameters.  Are they legitimate ? ... &#10;&#10; That is an excellent way of seeing how your site is being attacked by hackers.",
        "column_hits": "Number of times Joomla!® came across this url.&#10;&#10;If the number is very high, you should react by redirecting the URL, if it is valid, or by blocking it with .htaccess; e.g by blocking the component if the latter is not installed on the site.",
        "truncatetable": "Empties the whole table; deletes all the records in one batch.",
        "truncatetable_confirm": "You are about to delete all the records of the table, could you confirm that this is what you want?",
        "tablenotfound": "The redirect component does not exist in your version of Joomla!®, sorry.",
        "deleterows": "Delete the checked lines of Joomla!® database.",
        "delete_confirm": "Do you want to delete the checked records of Joomla!® redirection component?",
        "deleted": "Record ID=%s deleted",
        "error_deleted": "Error while deleting ID=%s",
        "onlyfirstrows": "Display limited to the first %s records, sorted in descending order in the 'hits' column.  These are the most common URLs that you see on screen.",
        "tryit": "Open this URL in a new tab",
        "norecords": "The redirect table is currently empty."
    },
    "71_seo_rewrite": {
        "title": "URLs rewriting",
        "intro": "Dynamic websites use urls with a very large number of parameters; such is the case of Joomla!® which uses this type of URLs : index.php?option=com_users&amp;view=registration.  Such URLs are not very intuitive for a search engine and do not tell what the page is about unlike this url : \/inscriptions.html which will be much better referenced..",
        "full": "By activating the rewriting, you use the routing functionality of your CMS and your urls will no longer be like 'index.php' followed by a large number of parameters but they will show the alias that you specified for your page.  The URL path will be composed of the alias of the different menus followed by the page alias in order to have a clean and explicit url for search engines.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Note that rewriting depends on the CMS and the component\/programme at work; it is their responsibility and job to properly manage rewriting.",
        "test": "If your site is dynamic (Joomla!®, Drupal, Wordpress, ...), have a look at the URLs when browsing your site.  Activate rewriting then browse your site again; you'll find that your urls are now 'clean' and 'explicit'",
        "feature_enabled": "<span style='font-size:1.5em;'>Rewriting enabled<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Rewriting disabled<\/span>",
        "hint": "<span class='text-success'>Enables URLs rewriting<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommended<\/span>",
        "recommanded": "Activated"
    },
    "81_pagespeed": {
        "title": "Making the most of mod_pagespeed module",
        "intro": "mod_pagespeed is an Apache module that may be activated by your site host and if so, you can optimize your site thanks to this module.",
        "full": "<a href='https:\/\/developers.google.com\/speed\/pagespeed\/module' title='PageSpeed module by Google'>mod_pagespeed<\/a> is a module developed by Google. Its purpose is to reduce the weight of your web page by removing HTML commentaries, compressing images, making HTML code lighter, etc.<br\/><br\/>The activation of mod_pagespeed depends on your host and your contract. Therefore it may not be active on your account and if so the optimization offered by aeSecure will not be taken into account.",
        "test": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Warning:<\/span>&nbsp; It is necessary for your host to activate Apache Google pagespeed module and for your subscription, if need be, to include this feature.<br\/><br\/>In order to test the difference in speed, your site must be online and its speed tested with a tool such as <a href='http:\/\/gtmetrix.com\/' target='_blank' title='GTMetrix | Website Speed and Performance Optimization'>GTMetrix<\/a>.  Subject your site to the test once without activating optimization, then again after optimizing the site; you should notice a considerable speed difference.",
        "feature_enabled": "<span style='font-size:1.5em;'>Optimization is activated<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Optimization is deactivated<\/span>",
        "hint": "<span class='text-success'>Activates  your site optimization thanks to mod_pagespeed (<span style='font-weight:bold;'>requires your host to activate this module on your account ; otherwise optimization will be ineffective<\/span>).<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommended<\/span><\/span>",
        "recommanded": "Activated"
    },
    "83_expire": {
        "title": "Specifying the lifetime of static files",
        "intro": "Static files such as javascript files, css, images, web fonts ... are  downloaded by default each time a page is viewed even if it is viewed by the same user. Specifying a lifetime gives the opportunity to tell the browser not to download the file if it is already present in its cache.",
        "full": "When a lifetime is set for static files, your user's browser will no longer download the file if it is already in its cache. Thus, when a visitor returns to the page or browses from one page to another, a large number of files will not be downloaded any more but used locally. This will have an immediate effect on the surfing speed which will be significantly increased. ",
        "test": "In order to test the speed difference, your site must be online and you should take the speed test with a tool like <a href='http:\/\/gtmetrix.com\/' target='_blank' title='GTMetrix | Website Speed and Performance Optimization'>GTMetrix<\/a>.  Take the test first without enabling optimization and then retest after optimization has been enabled ; you should notice a significant speed difference.",
        "feature_enabled": "<span style='font-size:1.5em;'>Optimization is activated<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Optimization is desactivated<\/span>",
        "hint": "<span class='text-success'>Your user's browser will be set so as to give a long lifetime to static files such as style sheets, JavaScript, images,... <br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommended<\/span><\/span>",
        "recommanded": "Activated on a production site, deactivated on a test site"
    },
    "89_hotlinking": {
        "title": "Preventing hotlinking",
        "intro": "Forbid others to use your bandwidth by referencing, on their website, pictures from yours.",
        "full": "When other websites use images that are on your own site, whenever someone displays the third party site, your bandwidth is used because your server must provide the image to the applicant even though this site has nothing to do with yours.  This is a 'parasite'.<br\/><br\/>By allowing the display of an image only  if the request is made from your own domain name and\/or certain authorized sites (such as Google, Facebook, Yahoo, Bing, ...), you reduce interference and preserve resources on your server.",
        "feature_enabled": "<span style='font-size:1.5em;'>Optimization is activated<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Optimization is deactivated<\/span>",
        "hint": "<span class='text-success'>Refuses to display an image of your site if it is called from another domain than yours<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommended<\/span><\/span>",
        "recommanded": "Activated"
    },
    "accessdenied": {
        "banned": "Your IP address has been banished from the site",
        "contactwebmaster": "If you think this is an error, please contact the site manager to allow him to adjust the security level.",
        "emailsent": "An email has been sent to the site manager",
        "pagetitle": "Access denied",
        "mailwebmaster": "If you are the webmaster of this site, click <a href='sendkey.php'>here<\/a> to receive by email the key to your site.",
        "reminderkey_title": "Reminder of the key to your site",
        "reminderkey_info": "Someone (probably yourself) has recently tried to log in to your aeSecure management interface using a wrong key  (IP address: %s).  Please find below the liink mentioning the key ; remember to place this link among your favourites.",
        "reminderkey_secret": "Reminder: keep this link hidden from view.",
        "title": "Access denied."
    },
    "documentation": {
        "title": "Documentation",
        "hint": "Access to the online documentation of aeSecure"
    },
    "forum": {
        "title": "Forum",
        "hint": "aeSecure discussion forum"
    },
    "mail": {
        "illegitimate": "Someone tried to access your '%s' site via an illegitimate url",
        "url": "URL accessed",
        "attack": "Attack type",
        "title": "Your attention is required on your site %s",
        "ipaddress": "IP Address",
        "showlog": "Display logfile",
        "banip": "Banish IP",
        "showvar": "See variables",
        "technicalinfos": "Technical Information"
    },
    "getlog": {
        "menu": "Access log denied by aeSecure",
        "menu_hint": "The log file is the one containing one line per 'attack', that is to say per URL blocked by aeSecure.",
        "empty": "Your log file is currently empty",
        "emptymore": "For the time being it appears that no illegitimate access attempt was detected and stopped by aeSecure."
    },
    "ban": {
        "title": "This address (  %s )  has been banished and will no longer be able to access your site.",
        "htaccess": " The .htaccess file of your site %s has been adjusted and a rule has been added in order to block this IP address : %s.  It is now in the black list."
    },
    "jQuery-messages": {
        "required": "This field is required.",
        "email": "Please enter a valid email address.",
        "url": "Please enter a valid URL.",
        "alphabetic": "Please enter letters exclusively.",
        "alphanumeric": "Letters, numbers, spaces and underscores only please",
        "number": "Please enter a number.(ex.: 12,-12.5,-1.3e-2)",
        "integer": "Please enter a number without any decimals.",
        "minlength": "Please enter at least {0} characters.",
        "maxlength": "Please do not enter more than {0} characters.",
        "ipv4": "Please enter a valid IP address (version 4)."
    }
}