{
    "main": {
        "about": "A propos",
        "aeSecureRelease": "Cliquez ici pour prendre connaissance des informations de versions",
        "filecreated": "Le fichier %s a été créé",
        "downloadfile": "Télécharger ce dossier\/fichier",
        "pleasewaitcanbelong": "Cette opération peut prendre un long moment.   Merci de ne pas fermer cette fenêtre et d'attendre.   Cliquez sur cette notification pour la faire disparaître.",
        "filesandfolders": "Fichiers et dossiers",
        "search": "Chercher",
        "database": "Base de données",
        "execute": "Exécuter",
        "downloadandkill": "<h3>Le fichier qui vient d'être téléchargé a été immédiatement supprimé de votre serveur web.<\/h3>Il n'est donc pas accessible depuis une URL.",
        "file": "Fichier",
        "pro": "Cette fonctionnalité est réservée aux utilisateurs Professionnels",
        "session_killed": "Votre session a été supprimée; vous pouvez fermer cette fenêtre en toute sécurité.",
        "logout": "Se déconnecter",
        "helpreadonline": "Consultez le site web d'aeSecure pour en savoir encore plus",
        "restorefromconfig": "Restaurer",
        "restorefromconfig_hint": "Si vous aviez déjà configuré cette option précédemment, récupérez vos derniers paramètres en cliquant sur ce bouton",
        "restoreconfirm": "Souhaitez-vous réellement remplacer le contenu actuel pour la précédente version ayant été sauvée ?",
        "icon_warning": "Un problème de configuration a été rencontré sur votre site, veuillez cliquer sur ce bouton afin d'afficher la liste des problèmes à résoudre rapidement.",
        "loadfromaesecure": "Charger depuis aeSecure",
        "loadfromaesecure_hint": "Cliquez sur ce bouton afin de récupérer une liste de valeurs depuis le site d'aeSecure.  Cette liste contient des valeurs déjà identifiées par le développeur d'aeSecure vous permettant de rapidement initialiser l’option ci-dessus.",
        "add": "Ajouter",
        "add_hint": "Cliquez sur ce bouton pour afficher un formulaire simplifiant l'ajout d'une nouvelle valeur",
        "confirm_save": "\":\"<strong>Au cas où vous auriez commis une erreur de syntaxe, votre site sera immédiatement inaccessible (erreur 500) après la sauvegarde.<\/strong><br\/><br\/>Avant de cliquer sur le bouton OK, soyez certain d'avoir un accès à votre FTP ou à un panneau de contrôle au cas où il faudrait intervenir manuellement dans le fichier .htaccess.",
        "invalidregex": "L'expression régulière (regex) que vous avez introduite semble incorrecte.  Merci de prendre le temps de vérifier la validité de votre encodage.",
        "edithtaccessandsearchfor": "Éditez manuellement le fichier .htaccess qui se trouve à la racine de votre site et recherchez les lignes entre les deux balises %ACTION_TAG_START% et %ACTION_TAG_END%.  Supprimez les lignes entre ces balises (non comprises).  Sauvez votre fichier et rafraichissez votre page web.  Votre site sera à nouveau accessible.",
        "select_all": "Tout seléctionner",
        "unselect_all": "Tout déselectionner",
        "toggle": "Intervertir",
        "result": "Résultat",
        "fileext": "Extension",
        "advancedoptions": "Options avancées",
        "newer_version_htaccess": "<strong>Veuillez mettre à jour votre .htaccess<\/strong><br\/>La version de votre .htaccess ne correspond pas à la dernière version proposée par aeSecure.  Pour activer la version la plus récente, veuillez désactiver l'option 1.1 pour la réactiver immédiatement après; ce faisant, aeSecure utilisera la nouvelle programmation.",
        "chapter4popuptitle": "Selon que votre site web utilise un CMS ou pas, vous aurez plus ouu moins d'options dans la liste ci-dessous.<br\/><br\/>Les options disponibles varieront selon le CMS utilisé (Joomla!®, WordPress, ...).",
        "chapter8popuptitle": "L'objectif de ces fonctionnalités est de rendre l'affichage de votre site plus rapide.<br\/><br\/>L’optimisation du site n’est disponible qu’à partir de l'offre Premium d'aeSecure.",
        "chapter5popuptitle": "Si votre site web n'utilise pas de base de données et\/ou si les données de connexion ne sont pas complétées dans l'écran Outils->Options, la liste ci-dessous sera vide.",
        "configure": "Configurer",
        "hiddenindemo": "Le mode démo étant activé, cette information n'est pas disponible pour des raisons de confidentialité",
        "actual_config": "Configuration actuelle",
        "actualconfig_intro": "Votre configuration actuelle est affichée ci-dessous, ceci à des fins de contrôle.  Ces informations sont importantes et confidentielles, ne le transmettez pas à autrui.",
        "actualconfig": "Configuration actuelle",
        "advanced_parameters": "Paramètres avancés",
        "incorrect_token": "L'exécution de cette action exige la présence de votre jeton de sécurité or, soit il a été omis, soit il est incorrect.",
        "advancedoptionsarehidden": "Les fonctionnalité avancées ne sont pas affichées ci-dessous. Pour les voir, veuillez vous rendre dans l'écran Outils->Options et modifier le paramètre 'Voir les fonctions avancées'",
        "chapter1popuptitle": "Les fonctions 1.1 et 1.2 <strong style='color:red;'>doivent être activées<\/strong>.  Sans cela, votre installation d'aeSecure est incomplète.",
        "chapter2popuptitle": "Si possible, <strong style='color:green;'>activez l'option 2.1 ou, mieux, 2.2, pour protéger l'accès à un dossier<\/strong> comme p.ex. votre dossier d'administration ou celui qui contient aeSecure.",
        "chapter3popuptitle": "Gestion des dossiers et des fichiers : évitez les 'chmods' 777\".",
        "chapter7popuptitle": "Gestion des URLs (réécriture, référencement, redirection, ...).",
        "chapter9popuptitle": "Fonctionnalités diverses.",
        "versionfreehiddenpaidoptions": "Vous utilisez la version gratuite, les fonctionalités avancées y sont absentes.",
        "versionpremiumhiddenpaidoptions": "Vous utilisez la version Premium, <strong style='text-decoration:underline;'>merci!<\/strong>  Besoin de plus ? Optez pour la Pro.",
        "reset_snippetdone": "Le code associé à cette option a été mis à jour mais <strong>non implémenté<\/strong> : si vous souhaitez l’utiliser, vous devez (ré)activer l’option.  Si elle était déjà active, veuillez cliquer sur le bouton pour la désactiver puis l'activer à nouveau.",
        "unprotect": "Supprimer la protection",
        "unprotected": "La protection vient d'être levée",
        "confirm_replacevalueaesecure": "<strong>Vous avez déjà introduit des valeurs pour cette option.<\/strong> En cliquant sur le bouton OK ci-dessous, aeSecure va remplacer votre configuration (<span class='text-danger'><strong>vous perdrez vos valeurs<\/strong><\/span>) par celle enregistrée sur le site d’aeSecure pour cette option.<br\/><br\/>Souhaitez-vous procéder à cette mise-à-jour ?",
        "savefromaesecure_hint": "Lorsque vous modifiez la programmation d'une option (p.ex. la liste des valeurs bloquées par l'option 2.3 – Limite les robots et le spam), le fichier natif d’aeSecure contenant ces valeurs n’est pas modifié mais <strong>un fichier 'de surcharge' est créé<\/strong>.   Et c’est ce fichier qui sera utilisé lorsque vous activerez à nouveau l’option.     La surcharge créée a <strong>pour but de ne pas perdre vos modifications lorsque vous mettez aeSecure à jour<\/strong>.",
        "onlypro": "Désolé, cette fonctionnalité est réservée aux utilisateurs <strong>Professionnels<\/strong> d'aeSecure.",
        "choice_version": "Choississez la version à installer",
        "choice_version_subtitle": "Selon votre abonnement, <strong>actif<\/strong>, sur le site <a href='%s' target='_blank'>%s<\/a> vous avez le choix d'installer une des versions ci-dessous:",
        "confirm": "Confirmer",
        "site_broken": "<h3>ATTENTION - ERREUR SERVEUR<\/h3><br>Suite à votre dernière modification, votre fichier .htaccess contient une erreur conduisant à une erreur serveur : <strong>votre site ne fonctionne plus!<\/strong><br\/><br\/>Veuillez vous connecter par FTP sur votre site.",
        "app_title": "aeSecure - Protection de sites web",
        "aeSecureGetIt": "<a href='%s' title='%s'>Acquérir aeSecure<\/a>",
        "aeSecurePageTitle": "aeSecure - Protection de votre site web par .htaccess",
        "actions_base": "Sécurité de base \/ obligatoire",
        "actions_other": "Sécurité additionnelle",
        "actions_optimisation": "Optimisation de votre site",
        "actions_seo": "SEO (référencement)",
        "actions_misc": "Divers",
        "attention": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;",
        "config": "Configuration de aeSecure pour le site <span style='font-weight:bold;'>%s<\/span> (%s)",
        "contact": "Contact",
        "continue": "Continuer...",
        "success": "Succès",
        "failure": "Échec",
        "cancel": "Annulation",
        "demo": "Mode démo",
        "days": "jours",
        "modal_close": "Fermer cette fenêtre",
        "nochange": "Aucun changement n'a été effectué",
        "close": "Fermer",
        "security": "Sécurité",
        "login": "Login",
        "password": "Mot de passe",
        "recommanded_state": "État recommandé",
        "folder": "Dossier",
        "save": "Sauver",
        "filecreatedorupdated": "Le fichier %s a été créé ou mis à jour",
        "clickonprotect": "N'oubliez pas de cliquer sur le bouton 'Protéger!' pour que les changements soient sauvés",
        "intro": "Introduction",
        "important_info": "Informations importantes",
        "information": "Information",
        "warning": "Attention",
        "links": "Liens",
        "scan": "Scanner",
        "more_info": "Explications détaillées",
        "authorize_popups": "Votre navigateur bloque les fenêtres popup; merci de les activer pour votre site",
        "new_version": "<h4>Mise à jour disponible<\/h4>Votre version actuelle d'aeSecure est la version <span style='font-weight:bold;color:red;'>%1<\/span>.<br\/>La version la plus récente est la version <span style='font-weight:bold;color:green;'>%2<\/span>.<br\/><br\/>Souhaitez-vous l'installer ?",
        "ajax_new_version": "<strong>La version %s de aeSecure est disponible.<\/strong><br\/>Cliquez sur le bouton %s en haut à droite si vous souhaitez l'installer.",
        "version_control": "Vérifie sur le serveur de aeSecure si vous possédez ou non la dernière version du logiciel.",
        "latest_version": "Félicitations, vous avez la dernière version d'aeSecure.",
        "optimize": "Optimiser!",
        "protect": "Protéger!",
        "edit": "Éditer",
        "permissions": "Permissions",
        "premium": "Cette fonctionnalité est réservée aux utilisateurs Premium",
        "onlypremium": "Désolé, cette fonctionnalité est réservée aux utilisateurs Premium de aeSecure.",
        "filereadonly": "Le fichier %s n'est pas modifiable",
        "fanfacebook": "Suivre aeSecure sur Facebook",
        "action_enabled": "Activer",
        "action_disabled": "Désactiver",
        "state_enabled": "Activé",
        "state_disabled": "Désactivé",
        "feature_enabled": "<span style='font-size:1.5em;'>La sécurité est activée<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>La sécurité a été désactivée<\/span>",
        "optimization_enabled": "L'optimisation a été <span class='label label-success'>activée<\/span>.",
        "optimization_disabled": "L'optimisation a été <span class='label label-warning'>désactivée<\/span>; les lignes dans le fichier .htaccess qui la rendait possible ont été supprimées.",
        "are_you_sure": "En êtes-vous sûr?",
        "readmore": "En lire plus",
        "not_joomla": "Votre site n'est pas un site Joomla!®, cette fonctionnalité n'est dès lors pas disponible.",
        "sorry_notfree": "Désolé, cette fonctionnalité n'est pas disponible dans la version gratuite de aeSecure.&nbsp;",
        "sure_yes": "Oui, je confirme",
        "sure_no": "Non",
        "test": "Tester",
        "verify": "Vérifier",
        "pleasewait": "L'affichage de l'onglet ou du résultat peut prendre quelques secondes; merci de bien vouloir patienter.",
        "pleaseselectatleastone": "Veuillez sélectionner au moins une option",
        "filecontent": "Contenu du fichier %s",
        "hint_folder": "Nom du dossier à protéger",
        "uptodate_php": "Félicitations, vous utilisez la dernière mise à jour de votre version de PHP (%s)",
        "test_tip": "Si vous souhaitez 'voir' ce que fait cette protection, cliquez ici.  Vous pourrez alors tester la protection avant qu'elle ne soit activée et après."
    },
    "options": {
        "phpautocheck": "Vérifie automatique la version de PHP",
        "phpautocheck_hint": "A l'affichage de la page de configuration d'aeSecure, effectue un contrôle de la version de php installée sur votre serveur web.  Le contrôle se fait directement depuis le site http:\/\/www.php.net\/releases.",
        "seeadvancedoptions": "Voir les fonctions avancées",
        "seeadvancedoptions_hint": "En désactivant cette option, les fonctions Premium et ainsi que les Pro ne seront plus visibles si vous avez la version gratuite d'aeSecure.<br\/><br\/><strong>Merci de prendre quelques instants pour envisager l'achat d'une version Premium qui va accroître la sécurité de votre site.<\/strong>",
        "title": "Options",
        "form_title": "Paramétrage de aeSecure",
        "hint": "Paramétrage de aeSecure, configuration de la langue, de l'envoi des mails, ...",
        "save_hint": "Sauvegarde vos nouveaux paramètres qui seront immédiatement pris en compte",
        "saved": "Votre configuration a été sauvée",
        "site": "Site web",
        "sitename": "Nom du site",
        "sitename_hint": "Indiquez ici le nom du site; ce nom sera p.ex. utilisé dans les emails qui seront envoyés par aeSecure.  Cela vous permettra de différencier vos sites, si vous en avez plusieurs.",
        "logging": "Logging",
        "folderlog": "Localisation du dossier log",
        "folderlog_hint": "Nom complet du dossier qui contient les fichiers log de votre CMS (si vous en utilisez un)",
        "foldertmp": "Localisation du dossier temporaire",
        "logwrite": "Sauvegarde des fichiers de logs",
        "logwrite_hint": "Lorsque aeSecure bloque un accès, souhaitez-vous qu'un fichier soit généré dans le dossier de log; ce qui vous permettra de suivre le fonctionnement d'aeSecure, savoir qui tente des accès illégitimes, ...",
        "logtype": "Type de log",
        "logtype_hint": "Quand vous visualiserez l'ensemble des fichiers de log, souhaitez-vous le voir au format texte ou xml?",
        "foldertmp_hint": "Nom complet du dossier qui contient les fichiers temporaires de votre site",
        "key": "Clef secrète",
        "key_hint": "La clef secrète est celle utilisée pour accéder à la page \/aesecure\/setup.php.  Il s'agit de la variable qui permet de vérifier que vous êtes légitime ou pas.  Si vous changez de clef secrète, choississez-en une forte (minimum 10 caractères idéalement).",
        "timeout": "Durée de vie de la session (sec)",
        "timeout_hint": "La durée de vie de la session définit le temps, en secondes, entre l'obligation d'introduire la clef d'utilisation d'aeSecure et la prochaine action que vous ferez.  Veillez à ne pas choisir une durée trop longue, c'est inutile et est, potentiellement, une source d'usurpation d'identité.",
        "emailfromname": "Nom de l'expéditeur",
        "emailfromname_hint": "Nom qui sera celui de l'expéditeur des mails",
        "emailfrom": "eMail de l'expéditeur (From)",
        "emailfrom_hint": "eMail de l'expéditeur (Adresse email de l'expéditeur, il s'agit du champ From du mail)",
        "email": "Adresse email (To)",
        "email_hint": "Indiquez ici l'adresse email vers laquelle il faut envoyer certaines alertes d'intrusion ou la clef de votre site lorsque vous demanderez à la recevoir par email.",
        "sendemail": "Envoi d'emails",
        "sendemail_hint": "Certaines tentatives d'intrusion déclencheront l'envoi d'un email, souhaitez-vous activer cet envoi ou, au contraire, ne rien recevoir.<br\/>Ce paramètre n'est pas pris en compte pour l'envoi de la clef, en cas d'oubli.",
        "autocheck": "Vérification automatique de la version de votre CMS",
        "autocheck_hint": "<strong>Uniquement pour Joomla!®<\/strong><br\/>Si vous avez un CMS installé, vérifie automatiquement si vous disposez de la dernière version à l'affichage de la page de configuration de aeSecure",
        "emailsubject": "Sujet du mail",
        "emailsubject_hint": "Mentionnez ici le sujet du mail qui est envoyé par aeSecure.  Vous pouvez utiliser les variables '%SITENAME%' ou '%SITEURL%', la première reprend le nom du site tandis que la seconde son URL.",
        "language": "Langue de l'interface",
        "language_hint": "Sélectionnez la langue dans laquelle vous souhaitez afficher les différents textes de aeSecure.",
        "misc": "Divers",
        "geocoding": "Géolocalisation",
        "geocoding_hint": "Indiquez ici une URL qui pointe vers un service de géolocalisation sur base d'une adresse IP et qui retourne un résultat au format JSON. Ce service sera alors appelé lors de l'envoi d'un email vers le webmaster du site lorsqu'il s'agira de localiser sur une carte Google Map le lieu de provenance de l'attaque",
        "timezone": "Fuseau horaire par défaut",
        "timezone_hint": "Fuseau horaire par défaut à utiliser par votre serveur Apache pour toutes les fonctions relatives aux dates\/heures",
        "db": "Base de données",
        "dbname": "Nom",
        "dbname_hint": "Si votre site web est dynamique comme c'est le cas pour un site basé sur un CMS, indiquez ici le nom de votre base de données",
        "dbtype": "Type",
        "dbtype_hint": "Type de la base de données, cela peut être mysqli, mysql, mssql ou autre",
        "dbhost": "Nom du serveur",
        "dbhost_hint": "Le nom du serveur où se trouve votre base de données; généralement <strong>localhost<\/strong>",
        "dbuser": "Nom du compte (login)",
        "dbuser_hint": "Login à utiliser pour se connecter sur la base de données (sur un site local, généralement <strong>root<\/strong>)",
        "dbpassword": "Mot de passe",
        "dbpassword_hint": "Mot de passe à utiliser (sur un site local, généralement le champ du mot de passe est laissé vide)",
        "dbprefix": "Préfixe",
        "dbprefix_hint": "Préfixe des tables dans votre base de données",
        "debug": "Debug",
        "debug_hint": "Active le mode debug",
        "debuglanguage": "Debug des langues",
        "debuglanguage_hint": "Afin de faciliter la traduction des chaînes de langue de aeSecure, toutes les chaînes provenant du fichier de langue sont préfixées par '#' et du code à traduire (exemple : #title#Ceci est le titre traduit)",
        "demo": "Mode demo",
        "demo_hint": "Active le mode demo : aucune action ne sera réellement effectuée dans ce mode."
    },
    "82_compress": {
        "notsupported": "Désolé mais votre hébergeur n'a pas activé les modules mog_gzip ou mod_deflate qui permettent de compresser vos données avant l'envoi à l'utilisateur.   La compression; côté serveur, ne peut donc pas se faire pour votre site.",
        "title": "Active la compression côté serveur",
        "intro": "La compression côté serveur (mod_gzip ou mod_deflate) est une fonctionnalité offerte par quasi tous les hébergeurs et qui permet de compresser en temps réel le code HTML de votre page web.   Cette compression permet de fortement réduire le poids de la page et donc d'en permettre un affichage plus rapide.",
        "full": "La compression <a href='https:\/\/developers.google.com\/speed\/articles\/gzip' title='How gzip compression works'>gzip<\/a> va réduire la taille de votre page web.  La décompression étant assurée par le navigateur web et cela sans que l'utilisateur ne le sache.  Cette compression va permettre un transfert de la page bien plus rapide et donc une meilleure expérience utilisateur sur votre site.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;La rapidité d'un site web est prise en compte par les moteurs de recherche qui les privilégient dans leur classement (ranking).  Plus votre site sera rapide; meilleur sera son classement.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Depuis Apache 2.0, mod_deflate est privilégié au vieillissant mod_gzip.",
        "test": "Afin de tester la différence de vitesse, il faut que votre site soit en ligne et que vous fassiez le test de vitesse avec des outils ci-dessous.  Faites le test la première fois sans avoir activé l'optimisation puis refaites le test une fois que l'optimisation est en place; vous devriez voir une différence significative.<br\/><br\/><ul><li><a href='http:\/\/checkgzipcompression.com\/?url=%s' target='_blank' title='Check GZIP compression'>http:\/\/checkgzipcompression.com<\/a><\/li><li><a href='http:\/\/www.whatsmyip.org\/http-compression-test\/?url=%s' target='_blank' title='HTTP Compression Test'>http:\/\/www.whatsmyip.org\/<\/a><\/li><li><a href='http:\/\/gtmetrix.com\/' target='_blank' title='GTMetrix | Website Speed and Performance Optimization'>GTMetrix<\/a><\/li><\/ul>",
        "feature_enabled": "<span style='font-size:1.5em;'>Optimisation activée<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Optimisation désactivée<\/span>",
        "hint": "<span class='text-success'>Compresse le code HTML de votre page avant l'envoi au navigateur de votre visiteur (<span style='font-weight:bold;'>requiert que votre hébergeur vous autorise à utiliser la compression côté serveur, l'optimisation sera sans effet autrement<\/span>).<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommandé<\/span><\/span>",
        "recommanded": "Activé"
    },
    "31_permissions": {
        "seefile": "Cliquez sur cette icône pour afficher le contenu du fichier (fichiers textes) ou voir l'image (fichiers images)",
        "makezip": "Zipper le dossier",
        "makezip_hint": "Génère une archive zip du dossier en cours et propose l'archive pour téléchargement.",
        "makezipconfirm": "Souhaitez-vous compresser ce dossier ? Cette opération peut prendre un certain temps...",
        "killfile": "Cliquez ici si vous souhaitez supprimer le fichier de votre site web",
        "title": "Fichiers et dossiers",
        "intro": "Spécifie des droits d'accès (chmod) restreints aux dossiers et fichiers de votre site.  Ainsi vous pouvez définir quels sont les fichiers qui ne peuvent jamais être modifiés ou les dossiers où l'on ne peut pas écrire de nouveaux fichiers.",
        "full": "Les scripts malveillants ont pour point commun de modifier certains fichiers de votre site afin d'y écrire un bout de code qui p.ex. provoquera l'apparation d'un popup ou la redirection vers un site peu amical; voire de créer de nouveaux fichiers (php, .htaccess, ...) dans vos dossiers.<br\/><br\/>D'autres scripts auront à coeur de tenter de dérober des informations de configuration de votre site (le fichier configuration.php sous Joomla!® ou wp_config.php pour WordPress), ...<br\/><br\/>En précisant des droits d'accès restreints aux fichiers, vous ajoutez un niveau de protection supplémentaire à votre site.",
        "confirm": "<span class='text-danger'>Changer la sécurité de ce fichier\/dossier peut engendrer des problèmes comme p.ex. ne plus avoir accès à votre site web.<br\/><br\/>Si vous confirmez votre changement, tester que votre site fonctionne encore correctement.<br\/><br\/><span style='font-weight:bold'>En cas de souci, connectez-vous avec votre client FTP et restaurer la permission précédente.<\/span><\/span>",
        "confirm_kill": "<span class='text-danger'>Vous êtes sur le point de supprimer le fichier <span style='font-weight:bold;'>%s<\/span>.  En êtes-vous sûr ?<br\/><br\/><span style='font-weight:bold'>Attention, une fois confirmé, le fichier est physiquement supprimé.<\/span><\/span>",
        "file_removed": "<span class='text-success'>Le fichier <span style='font-weight:bold;'>%s<\/span> a été supprimé<\/span>",
        "previous": "Précédente valeur",
        "feature_enabled": "<span style='font-size:1.5em;'>Nouvelle(s) permission(s) attribuée(s)<\/span>",
        "chmodinfo_group": "<ul><li>Premier chiffre : votre compte utilisateur (propriétaire)<\/li><li>Second chiffre : le groupe (group)<\/li><li>Troisième chiffre : le reste du monde (everyone)<\/li><\/ul>",
        "chmodinfo_sec": "<ul><li>0 : aucun droit<\/li><li>1 : autorisation d'exécution<\/li><li>2 : autorisation en écriture<\/li><li>4 : autorisation de lecture<\/li><\/ul>",
        "chmodinfo": "Les chiffres s'additionnant, la valeur 5 signifie lecture et exécution (pour un dossier=droit d'ouverture), 6 : lecture et écriture, 7 : tous les droits, ...<br\/>Les valeurs conseillées sont <span class='label label-success'>644<\/span> pour les fichiers et <span class='label label-success'>755<\/span> pour les dossiers.  En principe, n'octroyez jamais <span class='label label-danger'>777<\/span>",
        "chmodinfo_best": "<div class='chmodbest'>&nbsp;<input type='radio' disabled\/>&nbsp;<\/div>A priori, il s'agit de la meilleure configuration possible pour ce fichier.",
        "chmodinfo_min": "<div class='chmodmin'>&nbsp;<input type='radio' disabled\/>&nbsp;<\/div>Veillez à ne pas sélectionner une permission plus basse que celle-ci; vous pourriez rencontrer des problèmes d'accès autrement.",
        "chmodinfo_na": "<div class='label label-warning'>Attention :<\/div>&nbsp;Vous êtes pour l'instant sous Windows, les droits d'accès sont donc inopérants et ne servent donc à rien.  Procédez aux réglages uniquement depuis votre site, une fois en production.",
        "chmodhtaccess": "Attention, certains hébergeurs exigent une permission d'au moins 444 pour le fichier .htaccess.&#10;&#10;Si vous optez pour une permission plus restrictive, vous aurez probablement une page 'Erreur 500' lors de votre prochaine connexion sur votre site.&#10;&#10;Pour rétablir la permission du fichier .htaccess, il faudra utiliser votre client FTP et adapter le 'chmod' à, au moins, 444.",
        "chmod644": "Uniquement votre compte utilisateur chez votre hébergeur peut lire et écrire dans les fichiers, seul le droit de lecture est accordé aux autres comptes.",
        "chmod777": "Le niveau 777 signifie que TOUT EST PERMIS : vous donnez tout pouvoir à tout le monde.  Normallement, cette permission ne doit jamais être utilisée car c'est le meilleur moyen d'être hacké.",
        "can_be_deleted": "Normalement ce fichier pourrait être supprimé car il n'est d'aucune utilité sur un site en production.<br\/><br\/><span style='font-weight:bold;'>Supprimez ce fichier<\/span>",
        "htaccess": "Une mauvaise permission sur ce fichier et vous aurez droit à une erreur 'Erreur 500' sur votre site.<br\/><br\/>La meilleure permission, fonctionnelle, est 444.  Toutefois vous pouvez tenter une permission 440,  voire 400,  mais sachez que les risques sont grands de ne plus avoir accès à votre site.  Si c'est le cas, ouvrez votre client FTP et adaptez manuellement le niveau d'accès (chmod) du fichier .htaccess en 444.<br\/><br\/><span style='font-weight:bold;'>Ce fichier est sensible et important<\/span>",
        "backups": "Si vous stockez vos sauvegardes dans ce dossier, sachez que ce n'est pas une bonne idée de le faire ici car ce dossier est accessible depuis le web.  Idéalement, il faudrait utiliser un dossier en dehors de votre dossier 'public_html'.<br\/><br\/><span style='font-weight:bold;'>Si malgré tout, vous souhaitez garder le dossier \/backups à cet emplacement, songer à la sécuriser.  Utilisez les options 2.1 ou 2.2 d'aeSecure afin de ne permettre l'accès au dossier \/backups qu'aux seules personnes autorisées.<\/span>",
        "configuration.php": "Il est recommandé de mettre ce fichier à 400 (max. 444) sur un site de production. Si vous devez modifier la configuration générale de votre site, basculez ce fichier en 644 puis, une fois la modification effectuée depuis votre administration Joomla!, restaurez l'accès 400.<br\/><br\/><span style='font-weight:bold;'>Ce fichier est sensible et important<\/span>",
        "htaccess.txt": "Ce fichier ne sert à rien.  Si vous avez déjà un fichier nommé .htaccess, vous pouvez supprimer ce fichier.<br\/><br\/><span style='font-weight:bold;'>Supprimez ce fichier<\/span>",
        "index.php": "Ce fichier ne doit jamais être accessible en écriture sous peine de prendre le risque de voir son site 'défacé'.<br\/><br\/><span style='font-weight:bold;'>Au maximum, optez pour 444<\/span>",
        "logs": "Le dossier logs est important car il est utilisé par votre CMS pour écrire des fichiers de logs, il faut donc qu'il soit possible d'écrire dedans (autorisation 5 ou 7)<br\/><br\/><span style='font-weight:bold;'>Spécifiez un accès 755<\/span>",
        "php.ini": "Ce fichier ne doit en aucun cas être en écriture; un niveau d'accès en lecture seule est suffisant (400, 440 ou 444)<br\/><br\/><span style='font-weight:bold;'>Ce fichier est sensible et important<\/span>",
        "robots.txt": "Il s'agit d'un fichier qui doit être accessible aux robots des moteurs de recherche, un accès en lecture seule est amplement suffisant.  Ne donnez pas un niveau d'accès supérieur à 444.",
        "tmp": "Le dossier tmp est important car il est utilisé par votre CMS pour écrire des fichiers temporaires, il faut donc qu'il soit possible d'écrire dedans (autorisation 5 ou 7)<br\/><br\/><span style='font-weight:bold;'>Spécifiez un accès 755<\/span>",
        "web.config.txt": "Sur un serveur Apache, ce fichier ne sert à rien.<br\/><br\/>Sur un serveur Microsoft, renommez ce fichier en web.config pour activer la réécriture des URLs.<br\/><br\/>Si vous avez déjà un fichier nommé web.config, vous pouvez supprimer ce fichier<br\/><br\/><span style='font-weight:bold;'>Ce fichier ne sert à rien<\/span>"
    },
    "tools": {
        "ZipWebsite": "Télécharger une archive du site",
        "ZipWebsite_hint": "Une archive au format zip va être générée (cette opération va prendre du temps!) et l'archive sera immédiatement proposée au téléchargement.&#10;&#10;Veuillez ne pas fermer la fenêtre jusqu'à obtention du fichier zip.&#10;&#10;NB : l'archive zip sera immédiatement supprimée du site web avant même que le téléchargement ne débute.  Le fichier ne sera donc pas 'téléchargeable' autrement que par cette fonction-ci.",
        "see_apache_error_log": "Voir le log des erreurs Apache",
        "see_apache_error_log_hint": "Le log des erreurs est le fichier dans lequel votre serveur web écrit chaque problème rencontré au niveau de votre site; par exemple les erreurs dites fatales qui provoquent l'affichage d'une page blanche.\\r\\nATTENTION\\r\\nCe fichier peut être volumineux et son affichage pourrait prendre beaucoup de temps.  Pour cette raison, seul un nombre limité de lignes (les dernières du fichier) sera affiché.",
        "apache_error_log_skip": "Ne seront pas affichées, les lignes du fichier de log qui contiennent ces chaînes de caractères :",
        "apache_error_log_skip_short": "rencontré %s fois",
        "lastmod-selectfolder": "Veuillez renseigner le nom d'un dossier",
        "lastmod-nonefound": "Ce dossier n'apparaît dans aucun résultat ci-dessous",
        "lastmod-hidefolder": "Souhaitez-vous supprimer de cette liste tous les fichiers se trouvant dans un dossier précis (p.ex. 'cache')?  Introduisez le nom du dossier ci-dessous et cliquez sur le bouton 'Masquer'.",
        "lastmod-hide": "Masquer",
        "lastmod-foldersample": "Entrez un nom de dossier comme p.e. cache",
        "fileread_notfound": "Aucune ligne ne contient la chaîne de caractères recherchée",
        "fileread_placeholder": "ex. accessdenied.php?s=651",
        "fileread_ignore": "Les lignes contenant une des valeurs ci-dessous ont été ignorées : ",
        "fileread_specify_something": "Veuillez s'il vous plaît spécifier une chaîne de caractères afin qu'aeSecure puisse la chercher et masquer les lignes qui la contiennent.",
        "see_apache_error_log_notfound": "Le log des erreurs Apache est actuellement vide.  Dès à présent, lorsqu’une erreur Apache sera rencontrée, ce dernier y écrira le message de l’erreur dans le fichier log.  Il est donc parfaitement normal si ce fichier est actuellement vide\/non trouvé.",
        "see_htaccess_notfound": "Le fichier .htaccess n’a pas été trouvé à la racine de votre site.  Veuillez activer l'option 1.1 d'aeSecure.   <br\/><br\/><span style='font-weight:bold;font-style:underline;font-size:1.5em;'>Note : en l'absence du fichier .htaccess, aeSecure est inopérant !<\/span>",
        "see_phpini_notfound": "Aucun fichier php.ini n'a été trouvé à la racine de votre site.  Ce fichier est ajouté lorsque vous activez l'option 1.2 d'aeSecure.  L’absence du fichier php.ini n’impacte aucunement le fonctionnement d’aeSecure puisque les mêmes informations sont également reprises dans le fichier .htaccess se trouvant à la racine de votre site web.",
        "see_activity_notfound": "Le fichier des activités commence à être créé dès que vous activez l'une ou l'autre option d'aeSecure.",
        "pentest-text": "Tests d'intrusion \/ hacking",
        "pentest-hint": "Cet outil permet d'exécuter un grand nombre de requêtes 'malsaines' vers un site et voir la manière dont il va réagir.   Lorsqu'aeSecure est actif, l'objectif est que toutes ces tentatives soient stoppées (tenant compte du paramétrage de votre site).&#10;&#10;NB : Les attaques sont factices; aucune n'étant réelle.",
        "see_current_htaccess": "Voir le fichier .htaccess actuel",
        "title": "Outils",
        "coderemover-hint": "Trojan code remover est un script qui permet de scanner les fichiers js, php, html, shtml, htm, tpl, inc, asp, cfm, aspx et pl de votre site à la recherche d'une chaîne de caractères et, si elle est trouvée, la chaîne est supprimée.&#10;&#10;Il s'agit donc d'un outil pour nettoyer votre site après que ce dernier a été compromis.",
        "jamss-hint": "Joomla! Anti-Malware Scan Script est un script de détection de certains mots clefs dans les fichiers sources de votre site.   Il s'agit uniquement d'afficher les fichiers reprennant ces mots-clefs qui sont susceptibles d'être des malwares.&#10;&#10;Il s'agit donc d'un outil pour tenter de trouver les traces d'un éventuel piratage.&#10;&#10;ATTENTION: JAMSS génère un très grand nombre de faux positifs, il faut donc bien analyser les messages avant d'intervenir.",
        "false-positive": "<div style='color:red;width:80%;margin-left:100px;margin-right:100px;display:block;'><span style='font-weight:bold;'>Attention!!!<\/span> Ce type d'outil scanne les fichiers présents sur votre site à la recherche de patterns càd d'une liste de mots clefs qui, potentiellement, peuvent être dangereux.  Par exemple, le mot 'iframe' est recherché car il est possible, par iframe, d'afficher des informations en provenance d'un site tiers.  Toutefois, les boutons pour les réseaux sociaux utilisent fréquemment des iframes.  Les programmes de sécurité, comme aeSecure, contiennent aussi de tels patterns vu qu'ils sont développés justement afin de bloquer des attaques.  Soyez donc extrêmement vigilant et analysez correctement les informations retournées par le script.<br\/><br\/>Si vous lancez une opération de nettoyage; pensez à faire une sauvegarde de votre site juste avant, vous pourriez en avoir besoin en cas de pépin.<\/div>",
        "psi-hint": "PhpSecInfo est un outil d'audit de la configuration PHP de votre hébergement",
        "phpinfo-text": "phpinfo",
        "phpinfo-hint": "phpinfo va afficher la configuration php de votre site en, par exemple, listant des modules qui sont chargés.",
        "lastmod-text": "Fichiers ayant été modifiés récemment",
        "lastmod-hint": "Scanne votre site web à la recherche des fichiers ayant été modifiés durant les xxx derniers jours.  De cette manière, en cas de hacking, vous pouvez mettre en évidence les fichiers ayant été modifiés et vous pourrez porter votre attention sur ces fichiers-là.",
        "lastmod-explain": "Si vous souhaitez retrouver la liste des fichiers ayant été modifiés les 7 derniers jours, veuillez indiquer ce nombre (7) ci-dessous.   Vous pouvez mentionner un chiffre entre 1 et 99.",
        "lastmod-days": "Nombre de jours (1-99)",
        "lastmod-files": "Liste des fichiers ayant été modifiés les %d derniers jours",
        "lastmod-number": "Nombre de fichiers : %d",
        "allow_url_fopen": "Attention : allow_url_fopen doit être actif afin de garantir le bon fonctionnement de Joomla!®.  Ainsi, par exemple, en le désactivant, les fonctions de mises-à-jour de Joomla!® ne fonctionneront plus.",
        "HTML2PNG": "Capture la page au format PNG",
        "HTML2PNG_hint": "La capture de la page va générer une image PNG de ce qui est affiché, ainsi vous pourrez aisément sauvegarder vos paramètres par exemple",
        "see_htaccess": "Votre fichier .htaccess",
        "see_htaccess_hint": "Ouvre un popup qui vous permet de visualiser le fichier .htaccess qui a été mis en place",
        "see_phpini": "Votre fichier php.ini",
        "see_phpini_hint": "Ouvre un popup qui vous permet de visualiser le fichier php.ini de aeSecure.  Ce fichier se trouve dans le dossier racine de votre site web",
        "see_activity": "Votre journal des activités",
        "see_activity_hint": "Ce fichier reprend la liste des actions que vous avez entreprises comme l'activation d'une fonctionnalité.  En cas de problème, ce fichier vous permettra de savoir ce qui a été fait.",
        "reset_htaccess": "Désinstaller le .htaccess et php.ini de aeSecure",
        "reset_htaccess_hint": "Restaure votre .htaccess de base en supprimant toutes les références aux règles installées par aeSecure.  Si vous souhaitez désinstaller totalement aeSecure, veuillez supprimer le dossier \/aesecure de votre site web.",
        "reset_htaccess_notfound": "Le fichier .htaccess de aeSecure n'était visiblement pas encore activé sur votre site.  Aucune action n'a été faite.",
        "reset_htaccess_done": "Votre fichier .htaccess a été nettoyé du code de aeSecure.   Seul votre code personnel s'y trouve désormais.",
        "reset_htaccess_removed": "Avant installation de aeSecure, il n'y avait pas de fichier .htaccess en place.  Votre fichier .htaccess actuel a été renommé en OLD.htaccess.",
        "aeSecure_no_more_active": "aeSecure n'est plus actif sur votre site"
    },
    "15_blockip": {
        "title": "Blocage d'adresses IP",
        "intro": "Bloquer une adresse IP correspond à interdire à un ordinateur précis d'accéder à votre site web.  Lorsque vous subissez une attaque, il est souvent utile de bloquer les IP des machines.  Remarque: l'adresse IP est souvent dynamique et change donc régulièrement.",
        "full": "L'adresse IP est l'empreinte digitale de tous appareils connectés sur le web.  Au moment d'accéder à votre site, le visiteur dispose donc d'une adresse IP qui lui est propre et unique au monde.   Si vous souhaitez interdire l'accès à votre site à cette personne, il faut bloquer son adresse IP.<br\/><br\/><div class='text-primary'><strong>Remarque :<\/strong>&nbsp;L'adresse IP est la plupart du temps dynamique et attribuée à l'utilisateur au démarrage de son appareil.  En bloquant l'IP, vous bloquez donc 'temporairement' l'accès au site (à moins que l'adresse IP soit fixe et dans ce cas, c'est définitif).<br\/><br\/>Certains spammeurs ou 'crawler' (càd des scripts qui analysent toutes les pages de votre site) ont une adresse IP statique; invariable.<\/div>",
        "preface": "Veuillez introduire une adresse IP par ligne et\/ou séparée par des points virgules.<br\/>Exemple : 255.255.255.255;128.128.128.128;123.123.123.123 pour bloquer ces trois adresses IP.",
        "saved": "Vos modifications ont \\u00e9t\\u00e9 sauv\\u00e9es.<br\/><br\/><span class='lead text-danger'>En cas de probl\\u00e8me d'acc\\u00e8s, il vous faudra \\u00e9diter le fichier .htaccess depuis votre client FTP.<\/span>"
    },
    "21_protectFolderIp": {
        "preface": "Seules les adresses IP mentionnées ci-dessous auront accès au dossier; toute autre tentative de connexion sera redirigée vers une page \"Accès interdit\".",
        "title": "Restreindre l'accès à un dossier selon l'adresse IP",
        "intro": "L'accès à un dossier (p.ex. \/administrator) sera restreint à une ou plusieurs adresses IP prédéfinies.  Ainsi, seuls ces ordinateurs-là auront accès au site.",
        "full": "En limitant l'accès sur base d'une ou de plusieurs adresses IPs vous rendez impossible à d'autres ordinateurs de se connecter au dossier. Cette sécurité d'accès est la meilleure que vous puissiez mettre en oeuvre en interdisant par défaut tout le monde excepté l'un ou l'autre ordinateur selon un principe de liste blanche.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Si votre adresse IP est dynamique (c'est le cas pour la majorité des fournisseurs d'accès internet), il faudra que vous utilisiez cette fonction-ci pour ajouter votre nouvelle adresse IP à chaque changement.",
        "restrict": "Accès au dossier restreint sur base de l'adresse du visiteur",
        "done": "La connection au dossier %s est limitée à l'adresse IP %s",
        "removed": "La restriction sur base de l'adresse IP a été retirée",
        "addressip": "Adresses IP",
        "hint": "<span class='text-danger'>Cliquez sur le bouton seulement si vous souhaitez bloquer l'accès au dossier mentionné à l'ordinateur ayant cette adresse IP.<br\/><br\/><span style='font-weight:bold;'>Vous bloquerez les autres connexions; si tel est votre souhait, cliquez sur le bouton.<\/span><\/span>",
        "hint_ip": "Il s'agit de votre adresse IP actuelle"
    },
    "11_protecthtaccess": {
        "preface": "Si, après avoir activé cette protection vous deviez rencontrer une erreur à l'affichage de votre site, veuillez vous référer à la <span style='font-weight:bold;text-decoration:underline;'><a href='http:\/\/aesecure.com\/documentation\/faq.html' target='_blank'>FAQ<\/a><\/span> d'aeSecure.",
        "feature_enabled": "<span style='font-size:1.5em;'>aeSecure activé<\/span><br\/><br\/>Veuillez contrôler que votre site reste fonctionnel en testant quelques URLs.  Si vous deviez rencontrer un souci, merci de vous référer à la <span style='font-weight:bold;text-decoration:underline;'><a href='http:\/\/aesecure.com\/documentation\/faq.html' target='_blank'>FAQ<\/a><\/span><br\/><br\/>Si la réécriture de vos URLs n’est plus activée, merci d’activer l’option 7.1 d’aeSecure.",
        "title": "Mise en place du fichier .htaccess de aeSecure",
        "intro": "Le fichier .htaccess est lu par votre serveur web à chaque fois qu'il est sollicité.  Le fichier .htaccess de aeSecure contient un très grand nombre de règles qui vont accroître la sécurité et l'optimisation de votre site web.",
        "full": "Le fichier .htaccess est lu par votre serveur web à chaque fois qu'une URL est exécutée sur votre site; qu'il s'agisse d'afficher une page web ou de télécharger un fichier.  Ce fichier est essentiel dans la protection de votre site car il va être celui qui permettra de scanner l'URL et de décider si celle-ci est légitime.<br\/><br\/>aeSecure va remplacer votre fichier actuel afin d'y ajouter un mécanisme de contrôle des URLs qui permettra de déterminer si elles sont légitimes ou s'il faut les bloquer car représentant une menace pour l'intégrité de votre site.<br\/><br\/>Votre fichier actuel sera inclus dans celui généré par aeSecure.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Votre fichier actuel, avant mise en place de celui de aeSecure, sera sauvegardé dans le dossier \/aesecure\/setup\/backup.",
        "copy": "Copie du fichier .htaccess principal de aeSecure",
        "copyfromto": "Copie %s vers %s",
        "state_enabled": "Installé",
        "state_disabled": "Désinstallé",
        "recommanded": "<span style='font-weight:bold'>le fichier .htaccess de aeSecure est obligatoire; il doit être installé.<\/span>",
        "keep_old_content": "Le contenu de votre fichier .htaccess d'origine, avant installation de aeSecure, a été inclus dans celui de aeSecure.",
        "renamed": "Votre fichier précédent %s a été renommé en %s",
        "test": "<p>Certains fichiers sont accessibles via une URL alors qu'ils ne devraient pas l'être, c'est le cas p.ex. de fichiers installés par défaut avec Joomla, exemple (<a href='%HTTP_HOST%\/LICENSE.txt' target='_blank'>LICENSE.txt<\/a>,<a href='%HTTP_HOST%\/joomla.xml' target='_blank'>joomla.xml<\/a>,<a href='%HTTP_HOST%\/README.txt' target='_blank'>README.txt<\/a>, ...)<\/p><p>D'autres fichiers devraient être spécifiquement protégés comme <a href='%HTTP_HOST%\/configuration.php' target='_blank'>configuration.php<\/a> ou <a href='%HTTP_HOST%\/.htaccess' target='_blank'>.htaccess<\/a> : vous ne devriez pas pouvoir accéder à ces URLs.<\/p><p>Certains scripts tentent de cibler les sites Joomla et, pour ce faire, vérifient si certains fichiers existent.  C'est le cas de certaines images installées par défaut avec Joomla : leur présence indique qu'il s'agit d'un site Joomla et selon la présence de tel ou tel fichier, il est possible de déterminer le numéro de famille de la version de Joomla installée.  Quelques images installées par défaut avec Joomla : <a href='%HTTP_HOST%\/images\/joomla_black.gif' target='_blank'>images\/joomla_black.gif<\/a>, <a href='%HTTP_HOST%\/images\/banners\/white.png' target='_blank'>images\/banners\/white.png<\/a>, <a href='%HTTP_HOST%\/images\/sampledata\/apple.jpg' target='_blank'>images\/sampledata\/apple.jpg<\/a><\/p><p>Les hackers tentent également d'accéder à des fichiers du système d'exploitation comme boot.ini ou win.ini et pour cela, ils lancent un grand nombre de requêtes de ce type : <a href='%HTTP_HOST%\/index.php?option=com_users&task=..\\..\\..\\..\\..\\..\\..\\..\\..\\boot.ini%00.htm' target='_blank'>index.php?option=com_users&task=..\\..\\..\\..\\..\\..\\..\\..\\..\\boot.ini%00.htm<\/a>.  Si votre serveur web n'est pas suffisament protégé, il serait possible que le fichier (boot.ini ici) soit affiché.<\/p><p>Le fichier .htaccess d'aeSecure va empêcher l'accès à des fichiers\/dossiers<ul><li>cachés càd à ceux dont le nom commence par un point (.), c'est le cas du fichier .htaccess mais vous pourriez aussi avoir créé des dossiers tels que '.backup', '.git', ...   S'agissant de dossiers cachés, aeSecure va interdire leur accès depuis une URL.<\/li><li>installée par défaut comme p.ex. <a href='%HTTP_HOST%\/images\/sampledata\/index.html' target='_blank'>images\/sampledata<\/a><\/ul><\/p><p>Plusieurs URLs paramétrées seront bloquées par aeSecure, telles que<ul><li>ce qu'on nomme les templates fingerprints <a href='%HTTP_HOST%\/index.php?tmpl=offline' target='_blank'>index.php?tmpl=offline<\/a>, <a href='%HTTP_HOST%\/index.php?tp=1' target='_blank'>index.php?tp=1<\/a> ou encore <a href='%HTTP_HOST%\/index.php?template=beez' target='_blank'>index.php?template=beez<\/a>.<\/li><li>Les URLs reprennant certains codes interdits comme des carriages returns ou des 'escape characters'.<\/li><li>les 'PHP Easter Eggs' qui dévoilent le numéro de version PHP en oeuvre sur votre site : <a href='%HTTP_HOST%\/index.php?=PHPE9568F34-D428-11d2-A769-00AA001ACF42' target='_blank'>index.php?=PHPE9568F34-D428-11d2-A769-00AA001ACF42<\/a><\/li><li>celles ayant du code javascript dans l'URL comme p.ex. <a href='%HTTP_HOST%\/index.php?%3Cscript%3Ealert%28%27Msg%27%29;%3C\/script%3E' target='_blank'>index.php?%3Cscript%3Ealert%28%27Msg%27%29;%3C\/script%3E<\/a><li>...<\/li><\/ul><\/p><p>Beaucoup d'autres attaques par URLs seront bloquées grâce au fichier .htaccess d'aeSecure...<\/p><h4>En l'absence du fichier .htaccess d'aeSecure, chacune des requêtes ci-dessus affichera au mieux un message d'erreur au pire une page du contenu.   La protection aeSecure va bloquer toutes les tentatives avant même qu'elles n'atteignent votre site web et, donc, avant qu'elles ne soient exécutées et que le serveur web tente d'y répondre.<\/h4>",
        "hint": "<span class='text-success'>Copie le fichier .htaccess de aeSecure à la racine de votre site web et incorpore votre fichier d'origine au bas du fichier créé.<br\/><br\/><span class='text-success' style='font-weight:bold;'>Indispensable et obligatoire.<\/span><\/span>"
    },
    " 11_protecthtaccess": {
        "preface": "Si, après avoir activé cette protection, vous deviez rencontrer une erreur à l'affichage de votre site; veuillez vous référer à la <span style='font-weight:bold;text-decoration:underline;'><a href='http:\/\/aesecure.com\/documentation\/faq.html' target='_blank'>FAQ<\/a><\/span> d'aeSecure."
    },
    "73_editrobots": {
        "title": "Édition du fichier robots.txt",
        "intro": "Le fichier robots.txt est placé à la racine de votre site et donne des consignes aux moteurs de recherche quant à ce que vous autorisez ou pas.  Ainsi, par exemple, c'est grâce à robots.txt qui vous interdisez au moteur de recherche d'indexer les fichiers de votre dossier d'administration ou autres dossiers sensibles et privés.",
        "full": "Le fichier robots.txt va autoriser (allow) ou interdire (disallow) au moteur de recherche d'indexer tout ou partie de votre site.  Prenez le cas où vous avez un dossier \/administrator : vous ne souhaiterez pas voir apparaître dans les résultats d'une recherche des liens vers votre administration.  Si vous avez des dossiers personnels comme \/backups, \/confidentiel, \/members_only, ..., vous n'aimeriez pas plus que des liens soient retournés à quiconque ferait une recherche sur p.ex. Google.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Si vous utilisez un CMS, vous avez déjà un tel fichier; sinon, peut-être est-il manquant.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Notez que les moteurs de recherche ne sont pas 'obligés' de respecter le fichier robots.txt.  Un moteur de recherche 'peu scrupuleux' pourrait même tenter d'analyser le fichier pour voir ce que voudriez 'cacher'.",
        "explain": "Si vous souhaitez des explications sur la syntaxe à utiliser, visitez le site <a href='http:\/\/robots-txt.com\/' title=\\\\\"Robots.txt - Manuel d'implémentation\\\\\" target='_blank'>http:\/\/robots-txt.com<\/a>.<br\/><br\/><span class='label label-success'><i class='icon-info-sign icon-white'><\/i>&nbsp;Truc:<\/span>&nbsp;N'oubliez pas d'indiquer votre <a href='http:\/\/robots-txt.com\/ressources\/robots-txt-sitemap-xml' target='_blank'>Sitemap<\/a> dans le fichier robots.txt.<br\/><span class='label label-success'><i class='icon-info-sign icon-white'><\/i>&nbsp;Truc:<\/span>&nbsp;Vous pouvez tester la qualité de votre fichier robots.txt <a href='http:\/\/www.searchenginepromotionhelp.com\/m\/robots-text-tester\/robots-checker.php' target='_blank'>ici<\/a>",
        "saved": "Vos modifications ont été sauvées"
    },
    "45_dbadmin": {
        "failure": "<span class='bg-danger lead'>Attention, vous avez au moins un compte <strong>%s<\/strong> qui est actif dans votre base de données.<br\/><br\/><a href='http:\/\/aesecure.com\/fr\/documentation\/fonctionnalites.html' target='_blank'>Cliquez ici si vous avez besoin d'informations<\/a><\/span>",
        "congrats": "Félicitations, vous n'avez aucun login <strong>%s<\/strong> qui est actuellement actif sur votre site.",
        "nologinprovided": "Merci de bien vouloir indiquer le nom d'un login à vérifier; par exemple \"admin\".",
        "preface": "Le compte d'administration par défaut sous Joomla!® est \"admin\". Toutefois, si vous souhaitez tester un autre compte; veuillez introduire le nom ci-dessous.",
        "full": "Imaginez un instant que vous êtes un pirate ne serait-ce que quelques secondes : vous êtes face à un écran de connexion où l'on vous demande d'introduire un login et un mot de passe. Quel est le login que vous allez tenter sachant, en outre, qu'il s'agit d'un site Joomla!® ? Réponse : <strong>vous allez écrire \"admin\" dans le champ login.<\/strong><br\/><br\/>Dès lors que le login \"admin\" est effectivement encore utilisé sur le site en question; le pirate aura déjà fait 50% du travail : deviner un login existant et ayant des droits supérieurs.<br\/><br\/>Quel que soit le système informatique, il ne faut jamais utiliser les comptes par défaut car ils sont connus; les pirates les essayent en priorité. Si vous utilisez (encore) un tel compte, changez-en immédiatement! <strong>Créez un nouveau compte de type super-admin et désactivez le compte \"admin\".<\/strong>",
        "intro": "Auriez-vous encore un compte \"admin\" actif sur votre site ?",
        "title": "Recherche du compte \"admin\""
    },
    "51_backupdb": {
        "title": "Exportation de la base de données au format SQL",
        "intro": "Après exécution, vous obtiendez un fichier au format texte et qui reprendra le code SQL pour regénérer totalement votre base de données.<br\/><br\/>Il s'agit donc d'un backup complet de votre base de données.",
        "full": "L'exportation de la base de données vous permet de conserver un backup de celle-ci mais se révèlera également fort pratique pour rechercher du code malveillant puisque vous obtenez un fichier texte dans lequel il est aisé de faire des recherches manuellement, à la recherche de code qui pourrait être stocké dans des articles, modules, ...<br\/><br\/>Si vous avez un site en local, vous pouvez restaurer votre base de données en vous connectant dans votre interface phpMyAdmin locale et en exécutant le code SQL contenu dans le fichier.",
        "protect": "Exécuter"
    },
    "18_devilnumber": {
        "preface": "La zone de gauche vous permet de lancer une recherche et d'afficher la liste des dossiers et des fichiers ayant leur chmod à la valeur recherchée. <u>Aucune modification ne sera apportée à votre site<\/u>.<br\/><br\/>La zone de droite permet de définir les nouvelles valeurs pour les dossiers et les fichiers.  Si vous cliquez sur le bouton Protéger! de la zone de droite, les dossiers \/ fichiers ayant le chmod cherché ne seront plus seulement affichés mais le chmod sera adapté pour refléter votre choix.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Rappel:<\/span>&nbsp;Le chmod d'un dossier devrait être 755 et celui d'un fichier 644.",
        "title": "Vérifie les permissions (chmod) des dossiers ou fichiers",
        "intro": "Lorsque le niveau d'accès à un fichier est 777, cela veut dire que le fichier est accessible, modifiable et exécutable par n'importe qui.  La situation est pire avec un dossier : n'importe qui peut créer un fichier, y mettre du code malveillant et l'exécuter.<br\/><br\/>A priori, il n'y a aucun cas de figure qui nécessite que vous deviez avoir des fichiers ou des dossiers avec ce niveau d'accès.",
        "full": "777 signifie que n'importe qui peut, s'il parvient à accéder aux fichiers de votre serveur web, lire, écrire et exécuter n'importe quel fichier et créer autant de fichiers, exécutables, qu'il souhaite.  C'est donc un scénario contre lequel tout webmaster doit absolument se protéger.<br\/><br\/>Il n'y a, à priori, aucune situation où le niveau de sécurité doit être aussi haut.   Le chiffre 777 est aussi connu comme étant <strong>le chiffre du démon<\/strong>.<br\/><br\/>Cliquez sur l'onglet Vérifier afin que aeSecure scanne votre site web (cela va prendre du temps) à la recherche de tels fichiers.  S'il en trouve, changer les permissions !   Pour un fichier, optez pour 644 et 755 pour un dossier.  Noter que vous pourriez, peut-être, rencontrer un dysfonctionnement d'une partie du site si tant est qu'un programme légitime requiert un 777; auquel cas, il vous faudra aviser p.ex. le développeur de ce logiciel.",
        "congrats": "Aucun dossier ni fichier ne possède un niveau d'accès égal au chmod recherché.  Dans le cas d'un chmod 777, c'est une excellente nouvelle !",
        "nbr_files": "Nombre d'occurences trouvées : %d",
        "feature_enabled": "Recherche des dossiers\/fichiers terminée",
        "windows": "Votre site tourne sur un serveur de type Windows, le <strong>chmod<\/strong> d'un fichier n'est pas géré par Windows aussi cette fonctionnalité n'est pas possible sur ce serveur.  Si vous êtes actuellement sur votre serveur de développement, testez l'option sur votre serveur de production."
    },
    "84_minify": {
        "title": "\"Minification\" des fichiers css, html et javascript",
        "intro": "Derrière ce terme barbare (minify en anglais) se cache une fonctionnalité qui va réduire le poids des feuilles de styles, fichiers html et javascript en supprimant à la volée les espaces et retour à la ligne inutile dans les fichiers.\n\nLe poids des fichiers étant allégé, le chargement de la page sera plus rapide.",
        "full": "Lorsqu'un développeur programme une feuille de styles (fichier css) ou un code javascript (fichier js), il fait en sorte que son code soit lisible par un humain en l'indentant, en ajoutant ici et là des retours à la ligne pour séparer les règles, les fonctions, ...   Sans cela, le code serait illisible et ingérable.<br\/><br\/>Ces espaces et retours à la ligne sont des caractères et donc \"alourdissent\" le poids du fichier.<br\/><br\/>Pour le navigateur web, ces caractères sont absolument inutiles et peuvent être ôtés.  Ce faisant, le poids du fichier est plus réduit et est donc plus rapidement transmis au navigateur.<br\/><br\/>Les outils de mesure de performance tels que GTmetrix ou YSlow accordent de l'importance à ce que les fichiers soient \"minifiés\".  Cette option va s'en charger.",
        "test": "Avant d'activer cette option, affichez une page de votre site puis faites un \"view-source\" càd appuyez sur CTRL-U pour visionner le code source de la page.  Repérez le lien vers un fichier css plus ou moins important en nombre de lignes.   Si le fichier n'est pas \"minifié\"; vous pourrez le lire assez aisément, la présentation du fichier sera claire.<br\/><br\/>Activez ensuite l'option et procédez à nouveau pour afficher à nouveau le fichier.   Vous verrez alors ce qu'est la minification à l'oeuvre.",
        "feature_enabled": "<span style='font-size:1.5em;'>Minification activée.<\/span><br\/><br\/><span class='lead text-danger'>En cas de problème d'accés, il vous faudra éditer le fichier .htaccess depuis votre client FTP.<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Minification désactivée<\/span>",
        "recommanded": "Activé sur un site de production, désactivé sur un site de test\/développement",
        "minifycss": "Minifier les feuilles de styles (fichiers .css)",
        "minifyjs": "Minifier les scripts javascript (fichiers .js)",
        "minifyjswarning": "La minification d'un fichier .js est souvent mal supportée et conduit à une erreur javascript.  Cette erreur, visible depuis la console de débogage du navigateur, va stopper l'exécution des fonctions javascript ce qui résultera en un dysfonctionnement du site web.<br\/><br\/>Veuillez par conséquent tester, tester et tester encore votre site si vous activez cette fonction afin de garantir qu'il fonctionne encore comme souhaité.",
        "minifyhtml": "Minifier les fichiers HTML (fichiers .htm et .html)",
        "explain": "<span class='label label-danger'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;<span style='color:red;'>La minification est un processus très sensible : il y a un grande probabilité que vos fichiers javascrit puissent ne plus fonctionner et conduire à des erreurs JS, ce qui va perturber l'affichage de votre site et bloquer l'exécution de tout code JS.<\/span><br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Il n'est pas utile d'activer cette option si l'option 8.1 l'est déjà et si elle est opérationnelle sur votre site."
    },
    "dashboard": {
        "title": "Multi-sites",
        "noaccess": "L'interface multi-sites est réservée aux utilisateurs professionnels de aeSecure.  Il s'agit d'un écran central qui vous permettra de suivre les différentes installations de aeSecure que vous avez sur vos sites clients.   Vous pourrez voir les versions installées, les mettre à jour, télécharger un zip du site, exporter la base de données, suivre le log des attaques et encore plein d'autres fonctionnalités.<br\/><br\/>L'offre \"pro\" est une option à acquérir sur le site de aeSecure.com.",
        "clickmore": "Cliquez sur Ok pour en savoir plus",
        "contact": "Contact",
        "actions": "Actions",
        "aesecureSetup": "Affichage de l'écran de configuration d'aeSecure",
        "aeSecureInstalledVersion": "Version d'aeSecure actuellement installée sur le site",
        "backend": "Affichage de la page d'administration du site (backend)",
        "addsite": "Ajouter un site",
        "addsite_prompt": "Veuillez indiquer ci-dessous l'URL complète vers le site à ajouter.<br\/><br\/>Veillez à donner l'adresse du site selon cette forme exclusivement : <strong>http:\/\/votresite\/aesecure\/setup.php?TRES_TRES_LONGUE_CLEF<\/strong>",
        "addsite_done": "Site ajouté, la page va être rafraichie pour que le nouveau site soit affiché...",
        "configuration": "État de la configuration actuelle des différentes fonctionnalités d'aeSecure",
        "dashboardversion": "multisites v",
        "edit": "Édition de données du site",
        "email": "Ouvre un écran d'envoi de mail dans votre client messagerie avec le destinaire précomplété à l'adresse du gestionnaire du site.  Aucun mail n'est envoyé automatiquement, il sera juste affiché afin de vous permettre de l'envoyer vous-même.",
        "exportdb": "Exporte la base de données du site.<br\/><br\/><span style='font-weight:bolder;color:blue;'>Merci de patienter car cette opération est longue...<\/span>",
        "footer": "aeSecure, optimisation et sécurisation de vos sites web Apache",
        "frontend": "Affichage du site (frontal)",
        "hideerrorsiste": "Masque les sites en erreur",
        "home": "Ouverture de votre site dans un nouvel onglet",
        "log": "Voir le log des attaques pour ce site",
        "onlyIfPremium": "<span class='text-danger'>NB : Uniquement disponible si le site distant dispose de la version Premium d'aeSecure<\/span>",
        "masterversion": "Version de référence d'aeSecure",
        "mailToWebmaster": "aeSecure : la nouvelle version (v%1) a été installée sur votre site %2",
        "notresponding": "aeSecure ne répond pas. Soit il a été désinstallé soit il s'agit d'une ancienne version",
        "PHPVersion": "Version de PHP sur le site web",
        "reinstall": "Exécute la mise à jour d'aeSecure sur ce site; réinstalle le logiciel",
        "releaseinfo": "Informations sur les mises à jour",
        "removesite_hint": "Cliquez ici si vous désirez retirer ce site de votre écran de gestion multisites",
        "removesite_prompt": "Merci de confirmer que vous souhaitez effectivement supprimer le site %1 de votre écran de gestion multisites?",
        "setup": "Accédez à l'interface de gestion d'aeSecure",
        "sites_network_errors": "%1 site(s) n'ont pas pu être vérifiés suite à une erreur de connexion réseau, la requête ajax de vérification ayant échoué.  Ces sites apparaissent sur un fond rouge.",
        "sites_with_old_version": "Vous avez %1 installation(s) avec une ancienne version d'aeSecure.  Ces sites apparaissent sur un fond rouge.",
        "subtitle": "En vert les sites à jour, en rouge ceux ne l'étant pas et en orange ceux qui ne répondent pas à la requête d'information.",
        "subtitle_buttons": "Les icônes dans la barre de boutons dépendent de la version d'aeSecure installée sur le site distant.",
        "zip": "Téléchargez une archive ZIP du site.<br\/><br\/><span style='font-weight:bolder;color:blue;'>Merci de patienter car cette opération est très longue...<\/span>",
        "click_and_modal": "Cliquez ici pour afficher l'information dans une fenêtre modale",
        "11_not_installed": "aeSecure n'a pas été complètement installé.  Veuillez activer les options 1.1 et 1.2.",
        "eraser": "Nettoie les dossiers 'cache' et temporaire du site distant",
        "cache_cleaned": "Les différents dossiers cache et temporaire ont été nettoyés",
        "lastmod": "Affiche la liste des fichiers ayant été modifiés récemment sur le site distant",
        "download_as": "Télécharger le tableau au format",
        "error_apache": "Voir le log des erreurs du serveur web Apache",
        "allow": "Activer la fonctionnalité",
        "allow_hint": "En activant cette option, vous allez autoriser votre site à transmettre des informations, cryptées, lorsqu'une interface multi-site le questionnera pour prendre connaissance de sa configuration.<br\/><br\/>Cette option ne devrait être activée que si et seulement si vous disposez d'un compte PRO et que vous souhaitez inclure le site dans votre écran de gestion multi-site.  Laissez l'option désactivée dans le cas contraire.",
        "notconfigured": "Le site %s n'est pas configuré pour autoriser les connexions depuis l'interface Multi-sites.  Veuillez-vous connecter sur l'interface aeSecure du site, afficher l'écran des Options et activer la fonctionnalité Multi-sites."
    },
    "74_editredirection": {
        "title": "Gestion des redirections",
        "intro": "Les redirections permettent de corriger certaines URLs pour les faire pointer vers d'autres adresses comme par exemple rediriger http:\/\/votresite\/page-supprimee vers http:\/\/votresite\/nouvelle-page.   Il s'agit d'un outil particulièrement efficace pour corriger les URLs \"mortes\" qui sont mentionnées par des outils type Google Webmaster Tools.",
        "full": "Durant la vie de votre site web, des pages vont être supprimées et d'autres seront déplacées.   Peut-être allez-vous programmer vos propres redirections pour simplifier une URL : p.ex. http:\/\/votresite\/contact.html et non plus une URL complexe, non SEF.<br\/><br\/>Un des usages les plus fréquents des redirections est de corriger les liens morts qui vous sont rapportés par, par exemple, Google Webmaster tools.",
        "explain": "<span class='text-info'><strong>Attention : Si vous faites une erreur de syntaxe, vous aurez immanquablement une erreur serveur de type 500.  Dans ce cas il faudra accéder à votre site par FTP pour corriger votre fichier \/.htaccess.  Ayez donc l'accès à votre client FTP \"sous la main\".<\/strong><\/span>",
        "saved": "Vos modifications ont été sauvées."
    },
    "72_seo_www": {
        "preface": "Si vous comptez utiliser un CDN pour optimiser la vitesse d'affichage de votre site, vous devez imposer le préfixe www.",
        "cant_be_used": "Cette fonctionnalité ne peut être utilisée que si votre site : <ol><li>n'est pas en localhost (ou 127.0.0.1),<\/li><li>n'est pas un sous-domaine (p.ex.http:\/\/sous-domaine.votresite.fr) et<\/li><li>si votre site est accessible en http:\/\/votre-site.fr\/index.php ou http:\/\/www.votre-site.fr\/index.php càd qu'il est au niveau racine de votre nom de domaine.<\/li><\/ol>",
        "title": "Force le www (ou non) dans les URLs",
        "intro": "Afin d'éviter le 'duplicate content', il est recommandé de forcer les URLs de son site afin que les URLs mentionnent ou pas le www.  Vous aurez alors un meilleur référencement.",
        "full": "Lorsqu'un moteur de recherche arrive sur votre site, il est possible qu'il accède au site avec une URL du type www.votresite.fr.   Il est aussi possible qu'il arrive avec, simplement, votresite.fr.   Pour le moteur de recherche, il s'agit de deux URLs différentes et donc de deux sites différents.<br\/><br\/>Dans ce contexte-là, le moteur de recherche va constater qu'il a le même contenu une fois sur le site avec www et une fois sur le site non www.  Pour lui, c'est donc du 'duplicate content' et votre classement va en être pénalisé.<br\/><br\/>Il est donc recommandé de forcer les URLs de son site avec ou pas le préfixe www.   Si vous souhaitez ne pas l'utiliser, quelqu'un qui viendrait sur votre site en tapant manuellement www.votresite.fr verra l'URL automatiquement adaptée vers votresite.fr.",
        "with_done": "Changement apporté, votre site ne sera plus accessible sous le format votresite.fr mais uniquement www.votresite.fr",
        "without_done": "Changement apporté, votre site ne sera plus accessible sous le format www.votresite.fr mais uniquement votresite.fr",
        "test": "<a href='%s' target='_blank'>Consultez votre site %s<\/a>",
        "state_enabled": "www. imposé",
        "state_disabled": "www. supprimé",
        "feature_enabled": "<span style='font-size:1.5em;'>Préfixe www. imposé<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Préfixe www. supprimé<\/span>",
        "hint": "<span class='text-success'>Force ou non le préfixe 'www.' des URLs, quelqu'un qui viendrait sur votre site avec monsite.fr verrait l'URL changée en www.monsite.fr.<\/span>",
        "recommanded": "Selon votre choix personnel"
    },
    "errors": {
        "checkconfiguration": "Merci de bien vouloir vérifier votre écran de configuration (menu Outils - Options) afin de corriger les erreurs ci-dessous :",
        "err_missing_root_htaccess": "L'utilisation d'aeSecure implique l'existence d'un fichier nommé .htaccess à la racine de votre site.  Veuillez activer la fonction 1.1 d'aeSecure afin de créer ce fichier; sans cela aeSecure est inactif",
        "err_htaccess_no_aesecure": "Le fichier .htaccess présent à la racine de votre site n'est pas celui d'aeSecure qui est donc actuellement inactif sur votre site.  Veuillez activer la fonction 1.1 d'aeSecure afin d'inclure le code de protection.",
        "incorrect_installation": "L'installation d'aeSecure est partielle.  Le fichier <strong>%s<\/strong> est manquant, ce qui ne devrait pas être le cas.   Merci de bien vouloir réinstaller une nouvelle version d'aeSecure.",
        "dberror": "Erreur au niveau de l'accès base de données : %s",
        "folderlognotfound": "Le dossier des logs n'existe pas sur votre site.  Merci de bien vouloir corriger le chemin d'accès vers ce dossier en affichant l'écran des options d'aeSecure et en spécifiant un dossier existant, ceci pour l'option \"%s\"",
        "dirnotwritable": "le dossier est protégé contre l'écriture",
        "createerror": "Erreur lors de la création\/mise à jour du fichier %s.  Si le fichier existe, vérifiez qu'il n'est pas en lecture-seule.",
        "error_copying": "Une erreur est survenue lors de la copie du fichier %s <span class='label label-important'>%s<\/span>",
        "filenotfound": "Fichier %s non trouvé",
        "cantkill": "Le fichier %s ne peut pas être supprimé, vérifiez les permissions du fichier",
        "invalid_params": "Paramètres incorrects",
        "noaccessfolder": "Il semble que vous n'ayez pas l'autorisation d'accéder au dossier %s",
        "siteroot_foldernotfound": "Le dossier %s n'existe pas dans le dossier racine de votre site web",
        "foldernotfound": "Dossier inexistant : %s",
        "impossible_check_jversion": "Il n'a pas été possible de vérifier, en ligne, si votre version de Joomla!® est à jour",
        "old_php": "Votre version actuelle de PHP est la version <strong>%s<\/strong>.  Il existe une version plus récente (%s).   Si vous êtes hébergé sur un serveur mutualisé, voyez dans la FAQ de votre hébergeur s'il est possible d'activer une version plus récente.  Généralement, cela se fait en ajoutant une ligne précise dans le fichier .htaccess principal de votre site.",
        "old_php_major": "<span style='color:red;'>Sachez qu'il existe une version majeure de PHP plus récente que la vôtre<\/span>..  En effet, votre site tourne sur du PHP <strong>%s<\/strong>; peut-être pourriez-vous activer la version %s. <span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Le passage d'une version majeure à une autre n'est pas sans conséquence; pensez à le faire localement, sur un site de test, afin de vous assurer que votre site fonctionne correctement.",
        "not_supported": "<span class='label label-danger'>Erreur:<\/span><span style='color:red;font-style:italic;'>&nbsp;Oups, cette fonctionnalité n'est pas encore implémentée.  Numéro de la fonctionnalité : <strong>%s<\/strong>.<\/span>"
    },
    "91_cleantmpfolder": {
        "preface": "Nettoie le dossier \"%1\".  Si vous souhaitez adapter la localisation de ce dossier, veuillez cliquer sur le menu Outils -> Options.",
        "clean": "Dossier(s) temporaire purgé(s) : %",
        "title": "Vider le dossier temporaire de votre site",
        "intro": "Occasionnellement, songez à vider le dossier temporaire de votre site",
        "full": "Le dossier temporaire peut contenir un très grand nombre de fichiers ayant été générés par l'une ou l'autre application installée sur votre site web comme un CMS. Ces fichiers n'ont pas pour vocation de rester; ils sont là juste durant l'exécution d'une fonctionnalité d'un programme.<br\/><br\/>Ces fichiers occupent de l'espace disque et grignotent donc sur votre quota 'espace disque'. Songez à supprimer ces fichiers de temps à autre.",
        "feature_enabled": "<span style='font-size:1.5em;'>Dossier temporaire nettoyé<\/span>",
        "hint": "<span class='text-success'>Supprimez les fichiers temporaires...<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommandé<\/span><\/span>",
        "protect": "Nettoyer!"
    },
    "blocked": {
        "Access denied to this folder": "L'accès direct à ce dossier \/ fichier depuis une URL est interdit.",
        "access to robots": "L'accès direct au fichier robots.txt n'est pas autorisé",
        "PHPSESSID attempt": "Tentative de fixation de l'ID de la session PHP",
        "javascript attempt": "Tentative d'exécution d'un code javascript dans l'URL",
        "SQL injections": "Tentative d'injections SQL",
        "This query string isn't allowed": "Cette URL n'est pas autorisée",
        "Probited backend file's access": "Accès interdit à un fichier de l'administration du site",
        "Probited file's access": "Tentative d'accès à un fichier dont l'accès est strictement interdit depuis une URL",
        "Probited hidden file\/directory access": "Tentative d'accès à un fichier\/dossier dont l'accès depuis une URL n'est pas autorisé",
        "Unknown component": "Composant inconnu",
        "Are you a spammer ?": "Êtes-vous un spammer ? ",
        "Invalid referrer": "Referrer non valide et\/ou non autorisé",
        "Invalid characters in the querystring": "L'URL contient des caractères non autorisés",
        "base64_encode within the url": "base64_encode détecté dans l'URL",
        "Functions found in the querystring": "Appel à des fonctions depuis l'URL",
        "No file upload allowed on this website": "L'upload de fichiers est strictement interdit sur ce site",
        "Illegal words in the query string": "L'URL contient des mots se trouvant dans la liste noire",
        "Unauthorized access to a monitored folder": "Tentative d'accès à un dossier dont l'accès est sous surveillance",
        "Shell attacks": "Attaque de type shell détectée",
        "I think you don't need to access this folder...": "Passez votre chemin, vous n'avez rien à faire ici",
        "Access to this file is prohibited by server's rules": "Tentative d'accès à un fichier dont l'accès est interdit par les règles du serveur",
        "Block specials methods from HTTP Request": "Ce type de requêtes est interdit",
        "Trying to modify the REQUEST \/ PHP GLOBAL variables": "Tentative de modifier les variables globales ou de la requête web passée au serveur",
        "You're definitly a bad guy.  Why trying SQL injections?": "Vous êtes un sale type.  Pourquoi voulez-vous attaquer la base de données de ce site?",
        "PHP Easter Eggs": "PHP Easter Eggs",
        "No direct access to this file": "L'accès direct au fichier n'est pas autorisé; veuillez passer par l'interface de gestion de aeSecure",
        "Session timeout": "Votre session a expiré, veuillez relancer l'interface de gestion d'aeSecure",
        "Incorrect key": "Clef incorrecte (ou session expirée)",
        "Block xss tries": "Tentative d'exécution d'une attaque dite xss",
        "Registration page disallowed": "Aucune création d'utilisateur ne peut se faire sur ce site web",
        "com_media fileupload disallowed": "Le gestionnaire des médias ne permet pas d'uploader des fichiers",
        "Trying to run a javascript code from the url": "Code javascript détécté dans l'URL",
        "Fingerprint attacks detected": "Attaque de type fingerprint (empreinte digitale) détectée",
        "This script isn't allowed to be executed": "Tentative d'accès à un script php non autorisé explicitement par les règles du serveur web."
    },
    "quickinfo": {
        "generatedon": "Rapport généré le %s",
        "buttonhint": "Affiche un rapport tabulaire reprenant la configuration du site.&#10;%IsPremium%",
        "function": "Fonctionnalités",
        "quickoverview": "Aperçu rapide",
        "fullreport": "Rapport global",
        "value": "Valeur",
        "remarkversion": "La mémorisation des fonctionnalités a été introduite avec la version 1.2 d'aeSecure; si vous disposiez d'une version plus ancienne préalablement, il vous faudra réactiver la fonctionnalité (p.ex. désactiver puis réactiver l'option 1.3) pour que l'option apparaisse ci-dessus."
    },
    "tips": {
        "did_you_know": "Saviez-vous que ...",
        "close_hint": "En cliquant sur le bouton de fermeture, vous demandez à aeSecure de ne plus afficher ce message-ci",
        "joomla_quick_icons": "il existe un <strong>module 'QuickIcons' pour Joomla!<\/strong> permettant d'ajouter dans votre administration Joomla! un lien direct vers l'interface de gestion d'aeSecure.  Si vous souhaitez installer le module, veuillez cliquer sur le lien ci-dessous correspondant à votre version de Joomla!, téléchargez le fichier et installez-le dans votre interface de gestion des extensions.   Notez qu'il s'agit d'un module pour l'administration; il faudra donc afficher les modules pour le \"client\" administration.  Activez le module et placez-le, par exemple, dans la position 'Icône' ou 'menu' de Joomla!.",
        "folder_ip_restriction": "En matière de restriction d'accès à un dossier (p.ex. \/administrator), la meilleure protection est celle offerte par l'option 2.1 d'aeSecure.  En effet, vous bloqueriez l'accès à tout le monde sauf à quelques machines (adresses IP). Il faut cependant que vous disposiez d'une <strong>adresse IP fixe<\/strong> ce qui est assez rare mais, si c'est votre cas, optez pour cette protection-là.",
        "protect_aesecure": "... l'accès à votre dossier \/aesecure requiert une clef tellement longue et complexe qu'elle est impossible à deviner.  Toutefois, il se pourrait qu'un logiciel espion sur votre ordinateur puisse accéder à l'URL de votre interface aeSecure. Pour garantir la sécurité de votre interface, songez à utiliser les options 2.1 ou 2.2 pour bloquer l'accès au dossier \/aesecure.",
        "protect_dashboard": "... si vous êtes un utilisateur PRO et que vous utilisez l'interface Multi-sites; songez à protéger l'accès au dossier \/dashboard grâce aux options 2.1 ou 2.2.<hr\/>Sécurité accrue : vous pourriez installer l'interface multi-sites uniquement en local (serveur localhost) afin que la gestion centralisée de vos sites ne soit pas accessible en ligne."
    },
    "27_blockrobotstxt": {
        "title": "Bloque l'accès au fichier robots.txt aux curieux",
        "intro": "robots.txt est le nom d'un fichier à la racine de votre site qui reprend des informations pour les moteurs de recherche : indexer ceci, ne pas indexer cela.   Ce fichier est à destination des moteurs de recherche (les bots); pas pour les humains qui pourraient y découvrir l'architecture de votre site.",
        "full": "Lorsque vous accédez à l'URL <a href='%SITEURL%robots.txt' target='_blank'>%SITEURL%robots.txt<\/a>, vous ouvrez un fichier texte dans lequel se trouve des lignes comme Disallow: \/administrator pour indiquer aux bots de ne pas indexer le dossier administrator de votre site.<br\/><br\/>Ceci est parfait sauf que vous indiquez que vous avez un tel dossier sur votre site.<br\/><br\/>Sur certains sites, il pourrait y avoir un Disallow: \/Secrets p.ex. qui serait un dossier de votre site que vous souhaitez garder 'secret' et auquel seuls les initiés peuvent accéder.   Certains sites sont ainsi construits : ils ne prévoient pas de protection particulière et quiconque connaît l'existence du dossier \/Secrets peut y accéder.   Ces sites-là sont donc très vulnérables à la divulgation des informations du fichier robots.txt<br\/><br\/>La protection offerte par l'option 2.7 vise à détecter qui accède au fichier robots.txt et de n'autoriser l'accès qu'aux seuls robots connus et repris dans une liste blanche.",
        "test": "Avant d'activer cette option, accédez à cette URL : <a href='%SITEURL%robots.txt' target='_blank'>%SITEURL%robots.txt<\/a>.  Vous verrez le contenu du fichier.   Activez ensuite l'option et tenter à nouveau l'accès, le contenu du fichier vous sera masqué.",
        "hint": "Bloque l'acc\\u00e8s au fichier robots.txt aux humains.<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommand\\u00e9<\/span>",
        "recommanded": "Activé"
    },
    "92_cleancachefolder": {
        "title": "Purge les dossiers cache de votre site",
        "intro": "Les dossiers cache (\/cache et \/administrator\/cache), s'ils existent, servent à conserver des informations temporaires de votre site visant à en accélérer l'affichage; ils doivent être purgés régulièrement.",
        "full": "Sur des sites dynamiques comme le sont les sites sur base d'un CMS, une fois que la page a été générée après de multiples requêtes vers la base de données, le code HTML de la page est sauvegardé sur le serveur afin que, si une autre personne demande l'affichage de la même page, la version cachée puisse être utilisée et donc accélérer la vitesse d'affichage du site.<br\/><br\/>Lorsque vous souhaitez forcer le rafraichissement d'une page de votre site, il convient de vider le cache pour que l'accès à l'URL provoque la lecture des données depuis la base de données.",
        "feature_enabled": "<span style='font-size:1.5em;'>Dossier(s) cache nettoyé(s)<\/span>",
        "hint": "<span class='text-success'>Purge le cache<\/span>",
        "protect": "Purger!",
        "clean": "Dossier(s) cache purgé(s) : %s"
    },
    "12_protectFolder": {
        "skip": "Un fichier %s est déjà présent sur votre site, il n'a pas été modifié par aeSecure <span class='label label-info'>Info<\/span>",
        "title": "Protection des dossiers",
        "intro": "<ol><li>Copie de fichiers .htaccess dans différents dossiers clefs de votre site afin d'en restreindre l'accès, d'empêcher l'exécution de code php dans p.ex. \/tmp, etc.<\/li><li>Copie d'un fichier php.ini dans le dossier racine de votre site.<\/li><li>Scanne votre site web et place un fichier index.html dans chaque dossier qui en est dépourvu.<\/li><\/ol>",
        "full": "<ol><li>Certains dossiers de votre site ne doivent jamais être accédés depuis une URL.  C'est le cas p.ex. de votre dossier \/tmp : il n'y aucune raison que quelqu'un tente d'y accéder depuis une URL telle que http:\/\/votre_site\/tmp\/.  Le fait d'y placer un fichier .htaccess avec un deny all vous garantit que personne ne puisse jamais y accéder.<\/li><li>Le fichier php.ini qui est placé dans la racine de votre site, s'il est pris en compte par votre hébergeur, permet de définir des valeurs qui vont fermer certaines portes comme p.ex. la possibilité d'ouvrir un fichier php distant (allow_url_fopen).<\/li><li>Chaque dossier de votre site web est également scanné afin de déterminer si un fichier index.html s'y trouve et si ce n'est pas le cas, aeSecure y placera un tel fichier.  Le fichier index.html a pour but d'empêcher votre serveur web d'afficher le contenu du dossier, ce qui est préjudiciable sur le plan de la sécurité.<\/li><\/ol>",
        "hint": "<span class='text-success'>Positionne quelques fichiers .htaccess dans des dossiers clefs de votre site.   En second lieu, scanne l'arborescence de votre site web et crée un fichier index.html dans les dossiers où ce fichier est manquant.<br\/><br\/><span class='text-success' style='font-weight:bold;'>Indispensable et obligatoire.<\/span><\/span>",
        "install": "Mise en place du fichier %s <span class='label label-success'>Succès<\/span>",
        "copy_index": "Copie de fichiers index.html",
        "no_index_copied": "Félicitations, tous vos dossiers contenaient déjà un fichier index.html"
    },
    "16_blockpartURL": {
        "title": "Blocage sur base d'éléments dans l'URL",
        "intro": "Après analyse des fichiers journaux (log) de votre serveur web, vous constatez des tentatives d'accès à des URLs bien précises : <ul><li>des URLs qui mentionnent p.ex. des noms de fichiers inexistants sur votre site (p.ex. food.php)<\/li><li>des URLs dont les paramètres fournis sont dangereux (p.ex. des tentatives d'upload de fichiers)<\/li><\/ul>Cette option 1.6 va vous permettre de spécifier des règles de blocages pour ces URLs.",
        "preface": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Si les lignes que vous ajoutez contiennent une erreur de syntaxe, votre site web sera imm\\u00e9diatement inaccessible (erreur 500).  Il vous faudra dans ce cas vous connecter sur votre site gr\\u00e2ce \\u00e0 votre client FTP, \\u00e9diter le fichier .htaccess qui se trouve \\u00e0 la racine de votre site et supprimer manuellement les lignes que vous venez d'ajouter.<br\/><br\/><div class='text-center'><span class='label label-primary'><i class='icon-info-sign icon-white'><\/i>&nbsp;Si vous souhaitez faire plusieurs blocages, veuillez n'en encoder qu'un par ligne.<\/span>&nbsp;<\/div>",
        "url": "Encodez ici les blocages à effectuer <u>sur l'URL<\/u> (ce qui précède l'éventuel point d'interrogation)",
        "url_sample": "Cliquez sur le bouton \"%ADD%\" afin d'obtenir des exemples.",
        "querystring": "Encodez ici les blocages à effectuer <u>sur les paramètres<\/u> de l'URL (partie située après le point d'interrogation)",
        "querystring_sample": "Cliquez sur le bouton \"%ADD%\" afin d'obtenir des exemples.",
        "full": "Lorsque vous analysez vos logs, vous allez voir comment des pirates tentent d’accéder à votre site.\nIls vont essayer d’exploiter des trous de sécurité connus comme p.ex., fin 2013, l’exploitation d’une faille dans le composant JCE et qui permettait d’uploader une image depuis une URL contenant les instructions <strong>option=com_jce&task=plugin&plugin=imgmanager<\/strong>.   \nD’autres exploits vont essayer d’exécuter une librairie php qui pourrait être présente sur votre site (p.ex. openflashchart).\nIl s’agit à chaque fois de lignes dans le log des accès de votre site qui démontre une tentative de pénétration du site.\nCette option 1.6 vous donne la possibilité de bloquer les URLs de deux façons : soit sur la base d’un mot dans l’URL soit sur la présence d’un mot dans les paramètres de l’URL.  Les paramètres sont ce qui suit le point d’interrogation (s’il est présent).",
        "addmsg": "Veuillez introduire ci-dessous une expression régulière afin de bloquer des URLs sur base de la présence d'un ou de plusieurs mots <strong><u style='color:red;'>dans l'URL<\/u><\/strong>.<br\/><br\/>Si vous désirez bloquer un mot, veuillez utiliser une expression telle que celle ci-dessous si, p.ex., vous souhaitez bloquer le mot <strong>steaming<\/strong> et ce, peu importe sa position dans l'URL : <pre style='margin:0 0 2% 3%;width:90%;'>.*(streaming).*<\/pre><p>Vous pouvez également indiquer ici des expressions régulières plus complexes comme ci-dessous pour bloquer toutes les URLs se terminant par <strong>\/admin.php<\/strong><\/p><pre style='margin:0 0 2% 3%;width:90%;'>.(\\\/admin.php)$<\/pre><h4 style='background-color:rgb(205, 241, 177);margin:10px;padding:10px;border:1px solid green'>Pour tester vos expressions régulières, n'hésitez pas à utiliser ce site : <a href='http:\/\/regex101.com\/' target='_blank'>http:\/\/regex101.com\/<\/a><\/h4><hr\/>Veuillez introduire votre restriction ci-dessous :<br\/>",
        "addmsg2": "Veuillez introduire ci-dessous une expression régulière afin de bloquer des URLs sur base de la présence d'un ou de plusieurs mots <strong><u style='color:red;'>dans les paramètres de l'URL<\/u><\/strong>.<br\/><br\/>Les paramètres d'une URL représentent tout ce qui suit le ? présent dans l'URL.   Si vous avez une URL du type index.php?task=upload, vous pourriez bloquer <strong>la tâche d'upload<\/strong> comme ceci : <pre style='margin:0 0 2% 3%;width:90%;'>.*(task=upload).*<\/pre><h4 style='background-color:rgb(205, 241, 177);margin:10px;padding:10px;border:1px solid green'>Pour tester vos expressions régulières, n'hésitez pas à utiliser ce site : <a href='http:\/\/regex101.com\/' target='_blank'>http:\/\/regex101.com\/<\/a><\/h4><hr\/>Veuillez introduire votre restriction ci-dessous :<br\/>",
        "saved": "Vos modifications ont été sauvées.<br\/><br\/><span class='lead text-danger'>En cas de problème d'accès, il vous faudra éditer le fichier .htaccess depuis votre client FTP.<\/span>",
        "placeholder1": "Exemple : .*(\\\/secret\\\/).* pour bloquer les accès au dossier secret ou .*(\\\/secret\\.php).* afin de bloquer le script secret.php",
        "placeholder2": "Exemple : task=upload pour bloquer toutes les URLs qui auraient un paramètre nommé task et dont la valeur serait upload"
    },
    "28_blockuseragent": {
        "title": "Bloque l'accès sur base du 'user-Agent'",
        "intro": "Chaque accès à votre site se fait au travers d'un logiciel; le plus souvent un navigateur.  Sauf exception, chaque logiciel dispose d'une signature : son nom.   Cette information est transmise à chaque connexion sur votre site; dans la variable 'user-Agent'.<br\/><br\/>Certains d'entres eux sont réputés pour être des scripts d'attaques comme p.ex. 'BOT\/1.0 (BOT for JCE)' qui essaye de pirater votre site en utilisant une faille de sécurité de l'éditeur JCE (colmatée depuis longtemps).<br\/><br\/>Cette option va vous permettre d'opérer un blocage des accès à votre site sur base du user-Agent utilisé.",
        "full": "<div class='label label-warning'>Attention, le user-Agent n'est pas une information fiable.<\/div><p>&nbsp;<\/p><p>Le user-Agent est une information initialisée par le script \/ le programme qui accède à votre site.  N'importe quel script peut donc inscrire 'Firefox' comme user-Agent; c'est cette information-là que vous verrez alors.   Toutefois, certains scripts ne font pas d'usurpation et utilisent une signature comme p.ex. 'BOT\/1.0 (BOT for JCE)' qui dit clairement ce qu'il essaie de faire; en l'occurence essayer de pirater votre site au travers de l'éditeur JCE.<\/p><p>L'option 2.8 vous permet, une fois que vous aurez identifié des agents néfastes sur votre site, de leurs interdire tout accès ultérieurs.  Ils seront immédiatement bloqués.<\/p>",
        "explain": "Veuillez introduire le nom des user-Agents que vous souhaitez bloquer ci-dessous, une ligne par nom.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Vous pouvez introduire une expression régulière (pour les tester, n'hésitez pas à utiliser ce site : <a href='http:\/\/regex101.com\/' target='_blank'>http:\/\/regex101.com\/<\/a>).<\/div>",
        "saved": "Vos modifications ont été sauvées.<br\/><br\/><span class='lead text-danger'>En cas de problème d'accès, il vous faudra éditer le fichier .htaccess depuis votre client FTP.<\/span>",
        "placeholder": "Exemple : .*(BOT for JCE|MJ12bot).* qui est une expression régulière permettant de bloquer les scripts 'BOT for JCE ou MJ12bot."
    },
    "pentest": {
        "title": "Tests d'intrusion",
        "intro": "Ce script va exécuter un grand nombre de requêtes vers votre site web afin de vérifier qu'elles sont bien stoppées par aeSecure (<em>dès lors que vous avez activé le blocage adhoc<\/em>). La colonne Résultat apparaîtra alors en <span class='status403 success'>vert<\/span> dans ce cas précis.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;&nbsp;Aucune attaque n'est menée, il s'agit juste de simulation.<br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Si vous avez activé l'envoi d'une notification par email en cas d'attaque; songez à désactiver cette option avant de lancer les tests sous peine de recevoir plusieurs emails.",
        "run": "Exécuter le test",
        "finished": "Tous les tests ont été exécutés; si le résultat est sur fond vert; aeSecure a donc bloqué l'attaque (HTTP status 403)"
    },
    "mimetype": {
        "title": "Détection du type MIME",
        "intro": "Ce script va parcourir la globalité de votre site web et, pour chaque fichier qui s'y trouve, va déterminer son type (est-ce une image, est-ce du code exécutable, etc.) <strong>non pas sur base de l'extension du fichier mais bien de son contenu<\/strong>.  L'objectif étant de repérer p.ex. les codes PHP exécutables qui se cache dans des fichiers dont l'extension serait .jpg.<br\/><br\/>Seuls les fichiers dont le contenu diffère de celui attendu seront affichés ci-dessous.<br\/><br\/><span class='label label-danger'><i class='icon-warning-sign icon-white'><\/i>&nbsp;ATTENTION:<\/span>&nbsp;Le type Mime détecté est basé sur la fonction fileinfo() de PHP.   Cette fonction 'essaie' (meilleure estimation) de déterminer le type sur base de son contenu : <strong>cette fonction n'est pas donc totalement fiable<\/strong> mais donne toutefois une excellente indication sur le type de contenu.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Vous pourriez avoir des 'faux-positifs' aussi, par précaution, éditez toujours le fichier mentionné avant de décider d'une action comme sa suppression.  N'accédez pas au fichier depuis une URL (ce qui exécuterait le code caché dans une image p.ex.) mais ouvrez-le avec un éditeur de texte.",
        "hint": "Scanne votre site web à la recherche de fichiers dont le contenu diffère de ce qui était attendu sur base de l'extension.&#10;&#10;Exemple : un fichier dont l'extension est .png mais qui contient du code PHP.",
        "danger": "L'extension du fichier n'est pas conforme à son contenu mais, surtout, ce contenu est exécutable : si ce fichier est accessible depuis une URL, il est potentiellement dangeureux.",
        "folder_hint": "Si vous souhaitez vérifier les fichiers d'un dossier précis, veuillez indiquer le nom du dossier ici.",
        "detected": "Contenu détecté",
        "seefile": "Cliquez sur cette icône pour afficher le contenu du fichier EN MODE TEXT : même si l'extension du fichier laisse à croire que c'est une image, vous verrez apparaître le code ASCII du fichier.  Si le fichier contient un virus, il ne sera pas exécuté mais son code source sera affiché."
    },
    "29_blockreferrer": {
        "title": "Bloque l'accès sur base du 'Referrer'",
        "intro": "Le referrer (référant en Français), s'il est mentionné, est le site qui a généré une requête sur le vôtre.  Par exemple, lorsque quelqu'un arrive sur votre site après avoir cherché sur Google, le referrer est 'www.google.com'.<br\/><br\/>Lorsqu'un site tiers affiche un flux RSS proposé par le vôtre, le referrer est le nom de domaine du site tiers.  En bloquant tel ou tel referrer, vous allez interdire le trafic venant de ces sites-là.",
        "full": "<div class='label label-warning'>Attention, le Referrer n'est pas une information fiable; elle peut être vide ou être manipulée.<\/div><p>&nbsp;<\/p><p>Certains sites sont des voleurs de contenu qui profitent de l'existence d'un flux RSS de votre site pour vous 'voler' du trafic si malheureusement ils sont mieux référencés que vous.<\/p><p>D'autres sites pourraient afficher des images stockées sur votre site (et vous voler de la bande passante); voir aussi l'option 8.9 Empêcher le Hotlinking.<\/p><p>D'autres sites pourraient proposer un hyperlien vers une page de votre site alors que vous ne souhaitez pas que quelqu'un puisse, au départ de ce site-là, arriver chez vous.<\/p><p>Vous pourriez encore indiquer aux moteurs de recherches que le lien proposé sur un site tiers ne doit pas arriver sur votre page car vous ne souhaitez pas être lié d'aucune sorte avec ce site-là.<\/p><p>Les exemples ne manquent pas pour souhaiter 'blacklister' un site tiers.<\/p>",
        "explain": "Veuillez introduire ci-dessous le nom de domaine à bloquer, une ligne par nom de domaine (ex <strong>www.voleurs.fr<\/strong>).",
        "saved": "Vos modifications ont été sauvées.<br\/><br\/><span class='lead text-danger'>En cas de problème d'accès, il vous faudra éditer le fichier .htaccess depuis votre client FTP.<\/span>",
        "placeholder": "Exemple : semalt.com pour bloquer tout le traffic venant de ce site-là."
    },
    "93_crontab": {
        "title": "Crontab - Exécution planifiée sur le serveur",
        "intro": "Selon votre formule d'hébergement, vous pourriez avoir la possibilité d'accéder au 'crontab' : il s'agit d'une option, côté serveur, qui vous permet d'exécuter un job p.ex. toutes les heures, une fois par jour, le 1er jour du mois, etc.<br\/><br\/>aeSecure propose aux utilisateurs Pro un script qui, p.ex., peut être exécuté toutes les heures pour détecter les fichiers qui auraient été ajoutés ou modifiés sur votre serveur. Une notification par email sera alors envoyée; ce qui vous permettra d'immédiatement agir en cas de modification n'étant pas de votre chef.",
        "full": "Le script <strong>aesecure.sh<\/strong> va, selon votre configuration:<br\/><br\/><dl><dt>1. Analyser la date de dernière modification des fichiers<\/dt><dd>Le script va analyser la date de modification (ou date de création) des fichiers sur votre serveur et faire un relevé des fichiers ayant été modifiés depuis la dernière exécution.  Ainsi, si vous exécutez le script toutes les heures, vous recevrez une notification par email avec la liste des fichiers ajoutés\/modifiés durant la dernière heure.<br\/><br\/><\/dd><dt>2. Prendre une sauvegarde de votre base de données<\/dt><dd>Une fois par jour, votre base de données sera sauvegardée et stockée dans le dossier <strong>\/pro\/crontab\/db_backups<\/strong> d'aeSecure.<br\/><br\/><\/dd><dt>3. Faire un relevé des derniers utilisateurs ajoutés dans votre base de données<\/dt><dd>Une fois par jour, aeSecure va vérifier si de nouveaux utilisateurs ont été ajoutés dans votre base de données et, si c'est le cas, vous recevrez un mail de notification qui reprendra les données de cet utilisateur avec son appartenance aux différents groupes du CMS.  Ainsi, pour Joomla!, vous verrez apparaître s'il s'agit d'un utilisateur 'enregistré', 'auteur', 'administrateur', ...<br\/><br\/><\/dd><\/dl>Veuillez cliquer sur l'onget 'Configurer' pour appliquer vos choix et prendre du chemin d'accès du script; chemin à ajouter dans votre 'crontab'.",
        "option1_title": "Relevé des fichiers modifiés \/ ajoutés récemment",
        "option2_title": "Sauvegarde de votre base de données",
        "option3_title": "Relevé des nouveaux utilisateurs",
        "explain": "Veuillez configurer le script aesecure.sh selon vos besoins en utilisant les options ci-dessous.  Une fois la configuration réalisée, connectez-vous sur le panneau de configuration de votre site (cpanel de l'hébergeur).  Suivez les consignes de l'hébergeur pour ajouter un script dans le crontab.<br\/><br\/>Le chemin d'accès du script est celui-ci : <blockquote><strong>%1<\/strong><\/blockquote>Il n'y a aucun paramètre à ajouter au script; la seule chose que vous devrez faire est de choisir la récurrence que vous désirez (p.ex. tous les jours, toutes les heures 30)",
        "actualconfig_extra": "L'information ci-dessous est stock\\u00e9e dans le fichier <strong>%s<\/strong>.<br\/><br\/>L'essentiel des données de configuration provient des options d'aeSecure, disponible dans le menu supérieur (menu Outils->Options).<br\/><br\/>Les autres données sont paramétrables depuis l'onglet &quot;Configurer&quot; ci à gauche",
        "actionstofire": "Actions à exécuter",
        "sendemail": "Envoyer des notifications par email",
        "duration": "Durée entre deux planifications de votre script",
        "duration_hint": "Veuillez faire correspondre la durée ici avec votre planification : si vous avez programmé l'exécution du script aesecure.sh toutes les huit heures dans votre crontab, veuillez sélectionner exactement la même valeur ci-dessous.",
        "one_hour": "Une heure",
        "two_hours": "Deux heures",
        "four_hours": "Quatre heures",
        "eight_hours": "Huit heures",
        "one_day": "Une journée",
        "savelogs": "Conserve une copie des fichiers de logging",
        "savelogs_hint": "Lorsque le script aesecure.sh détecte un changement apporté à des fichiers, lorsqu'il détecte des nouveaux utilisateurs inscrits dans la base de données, ..., il génère une liste dans un fichier de log qui sera ensuite envoyé par email.   En activant cette option, les fichiers de log seront conservés dans le dossier \/pro\/crontab\/logs\/.",
        "sendemail_hint": "Active l'envoi des emails pour le script aesecure.sh : si p.ex. un fichier a été modifié, aeSecure enverra une notification par email lorsque cette option est activée."
    },
    "17_blockfiles": {
        "title": "Interdiction d'accès à certains fichiers par URL",
        "intro": "Votre site web contient certains fichiers dont l'accès direct par URL doit être rendu impossible; c'est le cas p.ex. des fichiers configuration.php (Joomla!®) ou wp-config.php (WordPress).  C'est aussi le cas pour les fichiers .htaccess, readme.txt, etc.",
        "full": "Lorsqu'une personne mal intentionnée désire mettre à mal votre sécurité, il va essayer d'accéder à des fichiers tels que configuration.php ou wp-config.php pour essayer d'afficher le contenu de ces fichiers de configuration.   Il va aussi tenter d'afficher le fichier .htaccess ou encore des fichiers texte tels que changelog.txt, php.ini, readme.txt, etc. pour afficher leur contenu et comprendre votre site (est-il basé sur un CMS, lequel, quelle version, ... ).<br\/><br\/>Vous pourriez aussi avoir détecté un fichier suspect sur votre site tel que phpinfo.php, \/media\/bad.php, ... pour lequel vous souhaitez rendre impossible leur utilisation par accès direct à p.ex. http:\/\/votresite\/phpinfo.php.",
        "preface": "Veuillez introduire un nom de fichier par ligne et\/ou séparé par des points virgules.<br\/>Exemple : .htaccess;configuration.php;wp-config.php pour bloquer l'accès URL à ces trois fichiers.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;L'interdiction est valable pour tous les dossiers de votre site, peu importe la localisation exacte du fichier.",
        "saved": "Vos modifications ont été sauvées.<br\/><br\/><span class='lead text-danger'>En cas de problème d'accès, il vous faudra éditer le fichier .htaccess depuis votre client FTP.<\/span>"
    },
    "94_password": {
        "title": "Générateur de mot de passe",
        "intro": "Cet outil va vous permettre de générer un mot de passe aléatoire d'une longueur variant entre 10 et 40 caractères.  Le mot de passe généré sera composé de majuscules, de minuscules, de chiffres et de caractères spéciaux.",
        "full": "Le choix d'un bon mot de passe est crucial dans la sécurisation de votre site web.   Les attaques de type brute-force se multiplient et les mots de passe simples sont devinés en quelques secondes voire instantanément pour des valeurs telles que 'admin', '123456', 'azerty'.. <br\/><br\/>Un petit outil en ligne comme \\\"<a href='https:\/\/howsecureismypassword.net\/' target='_blank'>How Secure Is My Password?<\/a>\\\" permet de tester la solidité de son mot de passe.<br\/><br\/>Le générateur proposé par aeSecure va suggérer un mot de passe aléatoire d'une longueur variant entre 10 et 40 caractères, le mot proposé mélangera les minuscules, les majuscules, les chiffres et les caractères spéciaux.<br\/><br\/>Un mot de passe tel que <strong>Mw$02z3plq<\/strong> mettra 96 ans à être cassé ce qui vous laissera le temps de constater l'attaque.  Préférez toutefois une longueur encore supérieure car la puissance de calcul des ordinateurs évolue sans cesse.",
        "password_length": "Longueur souhaitée du mot de passe",
        "password_generated": "Votre mot de passe",
        "protect": "Générer un mot de passe"
    },
    "install": {
        "minify_disabled": "Afin d'éviter un conflit lors de l'installation de la nouvelle version d'aeSecure, l'option 8.4 qui était activée pour votre site a été désactivée.  Veuillez s'il vous plaît la réactiver manuellement.",
        "finish_install": "Finalisation de l'installation",
        "freeonpaid": "<strong style='font-size:2em;color:red'>Installation interrompue<\/strong><br\/><br\/>Votre version actuelle est une licence commerciale (Premium ou Pro) et <span class='text-danger'><strong>votre abonnement sur le site aesecure.com est échu<\/strong><\/span>. Il n'est donc plus possible de télécharger une mise à jour pour cette version-là mais seulement une version gratuite. <br\/><br\/>L’installation a donc été interrompue afin que votre version actuelle reste fonctionnelle. Si l’installation avait eue lieue, vous auriez perdu vos fonctionnalités avancées et aeSecure aurait été instable.<br\/><br\/><strong><span class='text-success'>Si vous souhaitez pouvoir installer une mise à jour de votre version commerciale, veuillez vous rendre sur le site www.aesecure.com, vous connecter avec votre compte utilisateur et renouveller votre abonnement.<\/strong><\/span>",
        "premiumonpro": "<strong style='font-size:2em;color:red'>Installation interrompue<\/strong><br\/><br\/>Votre version actuelle est une licence Pro et <span class='text-danger'><strong>votre abonnement sur le site aesecure.com est de type Premium<\/strong><\/span>. La version Pro ne vous est donc plus accessible.<br\/><br\/>L’installation a donc été interrompue afin que votre version actuelle reste fonctionnelle. Si l’installation avait eue lieue, vous auriez perdu vos fonctionnalités Pro et aeSecure aurait été instable.<br\/><br\/><strong><span class='text-success'>Si vous souhaitez pouvoir installer une mise à jour de votre version commerciale, veuillez vous rendre sur le site www.aesecure.com, vous connecter avec votre compte utilisateur et renouveller votre abonnement.<\/strong><\/span>",
        "usernamenotfound": "<strong style='font-size:2em;color:red'>Installation interrompue<\/strong><br\/><br\/>aeSecure n'a pas pû vous authentifier.<br\/><br\/>Merci de bien vouloir vous connecter au site www.aesecure.com avec votre compte utilisateur et de télécharger à nouveau l'installateur aesecure.php.",
        "install_done": "<strong>Installation de aeSecure %s réussie.<\/strong>",
        "key": "Afin de garantir l'accès à cet écran de configuration uniquement aux personnes habilitées, l'accès à cette page  requiert une clef à spécifier dans l'URL. Lorsque vous voudrez accéder à cette page, veuillez utiliser cette URL :",
        "key_change": "Si vous souhaitez modifier cette clef, rendez-vous dans l'écran Outils -> Options.",
        "postinstall": "<div class='text-primary'><strong>Remarque :<\/strong>&nbsp;Pour votre sécurité, les fichiers d'installation de aeSecure ont été automatiquement supprimés.<\/div>",
        "disclaimer": "<span id='disclaimer'>Veuillez d'abord tester l'utilisation de aeSecure sur une copie de votre site, ne le faites pas sur votre site de production; <span style='text-decoration:underline;'>jamais<\/span>.  L'activation d'une protection ou la désactivation d'une fonctionnalité (p.ex. interdire les uploads) peuvent entrainer un dysfonctionnement de votre site.  Sécuriser un site web est un exercice nécessaire mais difficile et il convient de tester que son site reste totalement fonctionnel.<\/span>",
        "disclaimer_checkbox": "L'éditeur de aeSecure ne pourra pas être tenu responsable d'un quelconque dysfonctionnement.",
        "disclaimer_limitation": "Une protection telle que aeSecure vise essentiellement à fermer un grand nombre de portes par où pourrait passer un hackeur; si votre site est déjà infecté par un malware, veuillez préalablement le nettoyer.",
        "disclaimer_limitation_checkbox": "J'ai bien compris que aeSecure accroît la protection de mon site mais ne peut garantir une totale sécurisation (comme n'importe quel autre programme de sécurité)",
        "pleaseaccept": "Afin d'achever l'installation de aeSecure, veuillez s'il vous plaît cochez les cases.",
        "finish": "Terminer l'installation"
    },
    "14_old_htaccess": {
        "placeholder": "Par exemple : 'SetEnv PHP_VER 5_4' si vous souhaitez activer PHP 5.4 sur votre site (si supporté par l'hébergeur)",
        "title": "Édition manuelle de votre .htaccess personnel",
        "intro": "Il arrive parfois que vous deviez éditer votre fichier .htaccess pour ajouter l'une ou l'autre ligne spécifique comme l'activation d'une version de PHP, une règle de redirection, ...",
        "full": "Après avoir contrôlé à plusieurs reprises que votre syntaxe est correcte, introduisez les quelques lignes dans le champ mémo puis sauver vos changements qui seront alors ajoutés en début du fichier .htaccess qui se trouve à la racine de votre site.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Le fichier .htaccess est lu à chaque requête vers votre site web.  Pour peu que les lignes ajoutées contiennent une erreur syntaxique ou une instruction non valide, votre serveur web retournera immanquablement une erreur 500.   Si vous avez accès aux fichiers journaux de votre serveur web, vous pourrez y lire le motif de l'erreur.   Dans tous les cas de figure, il vous faudra vous connecter sur votre site grâce à votre programme FTP (FileZila p.ex.), vous rendre à la racine de votre site web et éditer le fichier .htaccess pour supprimer les lignes incorrectes.",
        "explain": "Vous trouverez ci-dessous le contenu de votre .htaccess personnel, avant que aeSecure ne soit installé.   Si vous le souhaitez, vous pouvez modifier ces règles ou en ajouter d'autres.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Si les lignes que vous ajoutez contiennent une erreur de syntaxe, votre site web sera immédiatement inaccessible (erreur 500).  Il vous faudra dans ce cas vous connecter sur votre site grâce à votre client FTP, éditer le fichier .htaccess qui se trouve à la racine de votre site et supprimer manuellement les lignes que vous venez d'ajouter.",
        "saved": "Vos modifications ont été sauvées.<br\/><br\/><span class='lead text-danger'>En cas de problème d'accès, il vous faudra éditer le fichier .htaccess depuis votre client FTP.<\/span>"
    },
    "44_blockcomp": {
        "placeholder": "Par exemple : com_prettyform;com_survey;com_whatever pour bloquer ces trois composants",
        "title": "Bloquer l'accès à certains composants de Joomla!®",
        "intro": "Dans le logfile de votre serveur Apache (pas celui de Joomla!®), vous constatez qu'il y a un grand nombre de lignes pour des URL du type index.php?option=com_xxxxx alors même que com_xxxxx n'a jamais été installé sur votre site.  Il s'agit ici d'une tentative de hacking de votre site : probablement com_xxxxx est un composant Joomla!® pour lequel une faille de sécurité est connue et des hackeurs 'scannent' le web à la recherche de sites potentiellement attaquables.<br\/><br\/>Utilisez cette option pour bloquer ces URLs-là.",
        "full": "Regardez votre composant de redirection (administration Joomla -> Composants -> Redirection) ou dans le fichier log de votre site Joomla!® et analysez les requêtes qui ont échoué.  Si vous voyez un très grand nombre d'URLs du type ?option=com_xxxxx et que ce composant n'est pas installé sur votre site (et ne le sera pas), il est bon de bloquer ce composant afin de prémunir votre site d'une potentielle faille de sécurité.<br\/><br\/>Pour cela, utilisez le formulaire et spécifiez le nom du composant (com_xxxxx).   aeSecure va bloquer toutes les urls où ce nom apparaîtra dans l'URL.",
        "test": "Voyez ce que fait Joomla!® lorsqu'on accède à com_xxxxx : <a href='%HTTP_HOST%\/index.php?option=com_xxxxx&' target='_blank'>%HTTP_HOST%\/index.php?option=com_xxxxx&<\/a>.<br\/><br\/>Si vous voyez une page 404, c'est bon signe mais cela montre que la requête est parvenue jusqu'à Joomla!®.  Il eût été préférable qu'une page d'accès interdit soit affichée dès lors que cette requête est exécutée des dizaines \/ centaines de fois sur votre site.",
        "explain": "Indiquez ci-dessous les noms des composants que vous souhaitez bloquer.  Commencez toujours par 'com_' suivi du nom du composant (p.ex. 'com_prettyform').<br\/><br\/>Pour en spécifier plusieurs, il suffit de les séparer par des points-virgules (com_prettyform;com_survey;com_whatever).",
        "blocked": "Les composants %s seront bloqués."
    },
    "13_error_reporting": {
        "indicator": "Votre site est configuré pour afficher toutes les erreurs Apache, y compris les simples Warning ou Notice ce qui, sur un site de production, n'est pas souhaité.  Cliquez ici pour afficher l'option 1.3 d'aeSecure afin de vous permettre d'interdire cet affichage.",
        "title": "Masquer les erreurs Apache",
        "intro": "Sur un site de production, garantissez que votre visiteur ne puisse pas voir des erreurs PHP qui donneraient trop d'informations à un éventuel attaquant",
        "full": "Lorsqu'une erreur de programmation est rencontrée, le serveur Web peut être configuré pour l'afficher.   C'est idéal pour un site en développement pour guider le développeur dans la recherche des bugs mais, sur un site de production, si l'affichage est activé, le visiteur pourrait avoir accès à trop d'informations comme le nom de votre base de données, le nom d'une table, le chemin d'accès du fichier fautif, ... autant d'informations qui peuvent être exploitées par un attaquant.<br\/><br\/>Sur un site de production, il est recommandé de désactiver l'affichage des erreurs.",
        "state_enabled": "Affichage interdit",
        "state_disabled": "Affichage activé",
        "feature_enabled": "<span style='font-size:1.5em;'>Les erreurs éventuelles ne seront jamais affichées<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Les erreurs seront affichées au visiteur<\/span>",
        "hint": "<span class='text-danger'>En cliquant sur le bouton 'Affichage activé' vous demandez au serveur web d'afficher les erreurs ce qui peut être dangeureux sur un site de production<\/span>",
        "recommanded": "Affichage interdit"
    },
    "19_maintenance": {
        "indicator": "Le mode maintenance est actif. L'accès au site est interdit à toute autre personne que vous (basé sur votre adresse IP). Cliquez ici pour afficher l'option 1.9 d'aeSecure afin de vous permettre de désactiver ce mode.",
        "title": "Activer\/Désactiver le mode maintenance",
        "intro": "Ce mode permet de rediriger toutes les personnes arrivant sur votre site sur une page 'Ce site est en maintenance...'; sauf vous.",
        "full": "Lorsque vous devez assurer une opération de maintenance sur le site ou, lorsque vous souhaitez couper tous les accès, car vous avez détecté un potentiel intrus, le mode maintenance permet de rediriger tout le monde, quelle que soit l'URL utilisée (frontal, backend, téléchargement d'un fichier, ...) vers une page '... en cours de maintenance...' le temps pour vous d'analyser votre site et d'apporter les modifications requises.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Une fois que vous aurez terminé vos actions de maintenance, revenez dans cette option pour désactiver le mode maintenance et rétablir l'accès à tous vos utilisateurs.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Cette fonctionnalité est différente de celle que vous trouverez dans votre CMS (Joomla!® p.ex.) car l'activation du mode maintenance se fait au niveau de tout votre site web (=> tout est bloqué) et pas seulement les pages du site desservies par le CMS.",
        "pagetitle": "Le site \"%s\" est actuellement en maintenance",
        "comeback": "Merci de revenir nous voir dans quelques heures...",
        "contact": "<a href=\"mailto:%s?subject=Site %s en maintenance\">Contactez-nous<\/a>",
        "confirm": "Êtes-vous certain?  Plus aucune connexion ne sera possible excepté la vôtre (basée sur votre IP).",
        "hint": "<span class='text-danger'>En activant le mode maintenance; toutes les connexions vers votre site seront redirigées vers une page indiquant que le site est en maintenance.<br\/><br\/><span style='font-weight:bold;'>Excepté vous, plus personne n'aura accès à votre site.<\/span><\/span>",
        "recommanded": "Désactivé"
    },
    "22_protectPassword": {
        "title": "Protection par mot de passe",
        "intro": "Place un fichier .htpasswd dans un répertoire afin d'en limiter l'accès aux seuls détenteurs du couple login \/ mot de passe.<br\/><br\/><span class='label label-primary'><i class='icon-primary-sign icon-white'><\/i>&nbsp;Conseil:<\/span>&nbsp;Idéalement vous devriez au minimum protéger votre dossier d'administration.  Si votre dossier de sauvegarde (backups) est localisé dans votre arborescence (p.ex. \/sauvegardes), pensez à le sécuriser également.",
        "full": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;La protection se fait par la mise en place d'un fichier .htpasswd qui exige de votre utilisateur d'introduire un login \/ mot de passe avant de pouvoir accéder à une page dans le dossier spécifié.<br\/>Idéal pour protéger le dossier d'administration de Joomla!® mais cela peut engendrer des soucis avec certains composants.",
        "restrict": "Protection d'un dossier par un couple login\/password",
        "done": "Utilisateur <span class='text-success' style='font-weight:bold;'>%s<\/span> créé. Veuillez utiliser le mot de passe <span class='text-success' style='font-weight:bold;'>%s<\/span> pour vous connecter au dossier <span class='text-success' style='font-weight:bold;'>%s<\/span>.",
        "testit": "Cliquez ici pour tester votre protection : <a href='%s' target='_blank'>%s<\/a>",
        "keepit": "<h5><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;veuillez conserver ces informations de manière sécurisée.<\/h5>",
        "error": "Erreur lors de la création du fichier .htpasswd, dossier non protégé"
    },
    "23_blockbots": {
        "title": "Limite les robots et le spam",
        "intro": "Bloque l'accès à votre site web aux robots c'est-à-dire aux scripts, programmes, aspirateurs de sites webs dont la signature est connue et réputée comme malsaine.  Bloque également certains mots clefs selon le principe de la liste noire.",
        "full": "Lorsqu'un programme tel un navigateur web accède à votre site, il s'identifie par sa signature, c'est le \"user_agent\".  De la même manière que pour les virus, <a href='http:\/\/perishablepress.com\/ultimate-htaccess-blacklist\/' title='Ultimate htaccess Blacklist | Perishable Press' target='_blank'>certaines signatures sont connues<\/a> comme étant des mauvais visiteurs (les 'bad bots'); ce sont des logiciels utilisés par des attaquants, des spammeurs, ...  Même s'il est vrai qu'il est assez simple de falsifier cette information, les visiteurs dont le user_agent est un bad bot n'ont aucune raison légitime de visiter votre site.<br\/><br\/>En activant la protection, vous allez bloquer un très grand nombre de ces bad bots. ",
        "hint": "<span class='text-success'>En activant cette sécurité, vous allez refuser l'accès à votre site aux robots connus.<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommandé<\/span><\/span>",
        "recommanded": "Activé"
    },
    "24_blockfileupload": {
        "title": "Bloque l'upload de fichiers",
        "intro": "Le piratage d'un site se fait souvent en uploadant un script malveillant.  En bloquant l'upload sur votre serveur, vous vous prémunissez contre ce type d'attaque.  <strong>Lisez les explications détaillées avant d'activer la protection.<\/strong>",
        "full": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;En interdisant l'upload, vous bloquerez un utilisateur qui souhaite charger un avatar, vous bloquerez aussi les mises à jour d'un CMS (Joomla!® ou autre), vous bloquerez la mise à jour d'un composant, etc.   En effet, ces mises à jour nécessitent de télécharger sur votre site le fichier de mise à jour avant que l'installation puisse se faire.<br\/><br\/>Vous pouvez toutefois désactiver l'upload sauf lorsque vous faites vos opérations de maintenance où, à ce moment-là précis, vous réactivez l'upload le temps de faire les mises à jour.",
        "confirm": "Êtes-vous certain?  A moins de revenir ici pour réactiver l'upload, vous ne pourrez plus mettre à jour votre CMS.",
        "hint": "<span class='text-danger'>En interdisant l'upload, vous ne pourrez plus mettre à jour votre CMS et\/ou extensions, vous ne pourrez plus non plus permettre à vos utilisateurs d'uploader un avatar; entre autres choses.<br\/><br\/><span style='font-weight:bold;'>Soyez sûr de ce que vous faites...<\/span><\/span>",
        "recommanded": "À moins de savoir exactement ce que vous faites, laissez sur désactivé"
    },
    "25_noarchive": {
        "title": "Bloque l'indexation de certains fichiers",
        "intro": "Interdit aux moteurs de recherche de proposer des liens vers des fichiers zip et MS Office se trouvant sur votre site.",
        "full": "En interdisant aux moteurs de recherche de proposer des liens directs vers des fichiers de votre site, vous forcez les utilisateurs à visiter votre site, à consulter les pages du site, mais surtout, sur le plan de la sécurité, vous garantissez que vous n'aurez pas un fichier qui aurait dû rester discret (p.ex. 'passwords.doc') qui serait retrouvable depuis des moteurs de recherche.   Cela semble évident et pourtant...  Google regorge de tels liens.",
        "hint": "Exige des moteurs de recherche de ne pas indexer vos fichiers zip et MS Office (accdb, doc, docx, mdb, ppt, pptx, xls, xlsx, zip).<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommandé<\/span>",
        "recommanded": "Activé"
    },
    "26_blockhiddenfolders": {
        "title": "Bloque l'accès aux fichiers et dossiers cachés",
        "intro": "Les fichiers et dossiers dont le nom commence par un point (.) sont des fichiers \/ dossiers cachés.  Sur certains sites, des dossiers comme .backups, .git, .svn, ... peuvent être présents et, par défaut, accessibles depuis une URL.",
        "full": "Sur votre site Apache, un fichier ou un dossier dont le nom commence par un point est un fichier \/ dossier caché et le système le masque dans certains écrans.  Au niveau d'un accès web (par URL), Apache ne bloque pas l'accès et il est donc possible d'accéder à p.ex. http:\/\/votresite\/.backups\/monbackup.   Toutefois, il y a fort à parier que si vous avez pris le soin de créer un dossier caché que votre souhait n'est pas de rendre les fichiers accessibles depuis une URL.<br\/><br\/>L'objectif de cette protection est d'interdire ces accès.  Excepté le fichier .htaccess que aeSecure bloque systématiquement, vous pouvez décider de bloquer les accès (recommandé) ou au contraire de les autoriser pour qui connaît l'URL.",
        "hint": "Interdit l'accès aux fichiers et dossiers cachés c'est-à-dire ceux dont le nom commence par un point (.)<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommandé<\/span>",
        "recommanded": "Activé"
    },
    "41_joomlaversion": {
        "title": "Contrôle de version de Joomla!®",
        "intro": "Tant que vous restez dans la même version majeure (1.5.x, 2.5.x, 3.x), il n'y a <span style='font-weight:bold;'>aucune<\/span> raison de ne pas mettre à jour votre site Joomla!®",
        "full": "Lorsqu'une nouvelle version de Joomla!® est mise à la disposition de la communauté; ce n'est pas uniquement parce qu'il y a des nouvelles fonctionnalités qui ont été développées mais aussi parce que des trous de sécurité ont été découverts et comblés par l'équipe de développeurs de Joomla!®.  Il est donc indispensable pour la bonne santé de votre site de toujours avoir la dernière version du CMS.<br\/><br\/>Toutefois, si vous avez un site en p.ex. Joomla!® 1.5 et que vous souhaitez installer une version telle que 2.5 ou 3.x, là, on ne parle pas de mise à jour mais de mise à niveau : le changement de version, majeure, signifie que vous aurez un travail plus ou moins important à réaliser (certainement une mise à niveau au départ de 1.5.x).  Dans ce cas, planifiez la mise à niveau et faites-le lorsque vous en aurez le temps.   Cela peut prendre plusieurs heures à plusieurs jours en fonction de la complexité du site et des extensions utilisées.",
        "current": "Votre version actuelle de Joomla!® : %s",
        "updated": "Dernière version de Joomla!® : %s",
        "youvethelast": "Félicitations, vous avez la dernière version de Joomla!® (%s)",
        "url_package": "URL du paquet de mise à jour : %s",
        "unknown": "Désolé, il n'a pas été possible de déterminer la dernière version de Joomla!®"
    },
    "42_blockcomusers": {
        "title": "Bloquer les inscriptions natives de Joomla!®",
        "intro": "Certains scripts malveillants ciblent les sites Joomla!® et accèdent à une URL publique qui permet de créer des utilisateurs fantômes à la pelle.  Si vous souhaitez interdire la création de comptes utilisateurs sur votre site et\/ou si vous utilisez un composant tiers (comme Community Builder ou JomSocial), désactivez le composant natif com_users",
        "full": "Même en l'absence d'un lien de menu et\/ou du module de connexion de Joomla!®, il est simple de créer un compte en accédant à l'URL <strong>index.php?option=com_users&view=registration<\/strong>, ce qui permet à des scripts de créer des utilisateurs de manière automatisée. De tels utilisateurs; dit utilisateurs fantômes, auront vite fait de spammer votre site, vos zones de commentaires, votre forum, ...<br\/><br\/>En plus, si vous permettez à de tels utilisateurs d'uploader un avatar, vous prenez un risque car l'image pourrait être un code malveillant ou ayant un visuel déplacé.<br\/><br\/>En bloquant le gestionnaire des utilisateurs natif de Joomla!® (com_users), vous bloquez ce type de script.<br\/><br\/>Si vous utilisez Community Builder, vous pouvez également bloquer com_users et permettre les inscriptions via CB. Pour cela, dans les paramètres généraux du gestionnaire des utilisateurs, désactivez l'inscription puis allez dans les paramètres généraux de CB et activez les inscriptions <strong>indépendamment<\/strong> de celles du site.",
        "test": "Cliquez ci-après pour afficher, dans un nouvel onglet, la page de création d'un utilisateur : <a href='%HTTP_HOST%\/index.php?option=com_users&view=registration' title='Afficher la page de création d'un utilisateur grâce au composant natif de Joomla!®' target='_blank'>Créer un nouvel utilisateur<\/a>.<br\/><br\/>Si la protection n'est pas encore active, vous verrez apparaître la page de création d'un compte.  Si votre site Joomla! est configuré pour accepter automatiquement les inscriptions; un script pourra donc créer des utilisateurs fantômes sans fin.<br\/><br\/>Une fois que vous aurez activé la protection, vous verrez la page de protection de aeSecure qui empêche l'affichage et donc la création des utilisateurs fantômes.",
        "hint": "<span class='text-danger'>Bloque les inscriptions du composant com_users ce qui permet de réduire fortement les spams. Si vous souhaitez permettre à des visiteurs de s'inscrire à votre site, n'activez pas cette option.<br\/><br\/><span style='font-weight:bold;'>Soyez sûr de ce que vous faites...<\/span><\/span>",
        "recommanded": "A moins de savoir exactement ce que vous faites, désactivé"
    },
    "43_protectadmin": {
        "title": "Protéger les fichiers de l'administration de Joomla!®",
        "intro": "Bloque l'accès direct (par URL) aux fichiers de votre dossier \/administrator.  Certains fichiers, comme les fichiers .XML, peuvent apporter trop d'informations à un éventuel hackeur (ex: la version précise de votre Joomla!®)<br\/><br\/>L'accès aux fichiers médias (css, js, png, ...) restera possible.",
        "full": "Sans protection, les fichiers de votre dossier \/administrator sont accessibles depuis l'URL.  Il est parfaitement possible d'accéder aux fichiers .ini (langue), .xml (manifest), .txt, ... qui sont situés dans votre administration juste en tapant l'adresse complète du fichier.<br\/><br\/>Le problème est que ces fichiers permettent d'en apprendre beaucoup sur votre site comme p.ex. la version exacte de votre Joomla!® (p.ex. 2.5.16).  Ces fichiers devraient donc être bloqués par votre serveur web.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Superflu si vous avez protégé l'admin avec un mot de passe ou restreint à une adresse IP.",
        "test": "Cliquez ci-après pour afficher, dans un nouvel onglet, le manifeste de votre site Joomla : <a href='%HTTP_HOST%\/administrator\/manifests\/files\/joomla.xml' title='Afficher le manifeste de votre site Joomla!®' target='_blank'>Afficher le manifeste de votre site Joomla!®<\/a>.<br\/><br\/>Si la protection n'est pas encore active, vous verrez apparaître le manifeste d'installation de Joomla!® : vous verrez le numéro de version exact.<br\/><br\/>Les fichiers manifestes de vos composants sont pareillement adressables.  Un pirate pourrait donc tester si vous avez tel composant et telle version.",
        "recommanded": "Activé"
    },
    "49_showredirect": {
        "title": "Afficher le contenu des redirections Joomla!®",
        "intro": "À partir de Joomla!® 1.7, Joomla!® enregistre dans le composant de redirection les URLs qui n'ont pas abouti, par exemple lorsque l'URL fait mention d'un composant non installé.  Jeter un oeil sur cette table est instructif car elle permet de voir les URLs utilisées, éventuellement, par des hackeurs pour tenter de pénétrer votre site.",
        "full": "Les hackeurs utilisent des scripts qui scannent à tout va Internet et tentent d'accéder, aveuglement, à des URLs réputées faillibles.  Ainsi, vous pourriez voir un très grand nombre d'accès à une URL telle que %HTTP_HOST%\/index.php?option=com_xxxx où com_xxxx est un composant qui n'a jamais été installé sur votre site.<br\/><br\/>Le but, pour les pirates, est de tenter de trouver des sites où ce composant serait installé car, probablement, une faille de sécurité est connue et ils tentent donc de l'exploiter.<br\/><br\/>Tentez de prendre régulièrement connaissance de ce tableau des redirections afin d'apprendre comment mieux sécuriser votre site.",
        "column_oldurl": "URL utilisée, non reconnue par Joomla!® (page 404).&#10;&#10;Analysez l'URL pour p.ex. voir si elle est de type malveillante; si elle mentionne un composant n'ayant jamais été installé, regardez les paramètres; sont-ils légitimes, ... &#10;&#10;Il s'agit d'un excellent moyen de voir comment se comporte votre site lorsqu'il est soumis aux attaques de hackeurs.",
        "column_hits": "Nombre de fois où Joomla!® a rencontré cette URL.&#10;&#10;Si le nombre est très élevé, il conviendrait de réagir en redirigeant l'URL si elle est valide ou en la bloquant depuis .htaccess; p.ex. en bloquant le composant si celui-ci n'est pas installé sur le site.",
        "truncatetable": "Vide toute la table; supprime tous les enregistrements en une fois",
        "truncatetable_confirm": "Vous êtes sur le point de supprimer tous les enregistrements de la table, pourriez-vous confirmer que c'est bien votre souhait?",
        "tablenotfound": "Le composant de redirection n'existe pas dans votre version de Joomla!®, désolé.",
        "deleterows": "Supprimer les lignes cochées de la base de données de Joomla!®.",
        "delete_confirm": "Souhaitez-vous supprimer les enregistrements ayant été cochés du composant de redirection de Joomla!®?",
        "deleted": "Enregistrement ID=%s supprimé",
        "error_deleted": "Erreur lors de la suppression de ID=%s",
        "onlyfirstrows": "Affichage limité aux %s premiers enregistrements, triés par ordre décroissant sur la colonne 'hits'.  Ce sont donc les URLs les plus fréquement rencontrées que vous voyez à l'écran.",
        "tryit": "Ouvrir cette URL dans un nouvel onglet",
        "norecords": "La table de redirection est actuellement vide."
    },
    "71_seo_rewrite": {
        "title": "Réécriture des URLs",
        "intro": "Les sites Web dynamiques utilisent des URLs avec un très grand nombre de paramètres; c'est le cas de Joomla!® qui utilise une URL de type index.php?option=com_users&amp;view=registration.  Ces URLs ne sont pas très intuitives pour un moteur de recherche et ne permettent pas de définir ce que fait la page; contrairement à p.ex. \/inscriptions.html qui sera alors bien mieux référencé.",
        "full": "En activant la réécriture, vous faites appel aux fonctions de routage de votre CMS et vos URLs ne feront plus apparaître 'index.php' suivi d'un grand nombre de paramètres mais l'alias que vous aurez spécifié pour votre page.  Le chemin de l'URL sera composé de l'alias des différents menus puis de l'alias de la page; ceci afin d'avoir une URL propre et explicite pour les moteurs de recherche.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Notez que la réécriture est fonction du CMS et du composant\/programme à l'oeuvre; c'est à eux qu'il incombe de gérer correctement la réécriture.",
        "test": "Si votre site est dynamique (Joomla!®, Drupal, Wordpress, ...), regardez les URLs lorsque vous surfez sur votre site.  Activez la réécriture puis surfez à nouveau sur votre site; vous constaterez que vos URLs sont maintenant 'propres' et 'explicites'",
        "feature_enabled": "<span style='font-size:1.5em;'>Réécriture activée<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Réécriture désactivée<\/span>",
        "hint": "<span class='text-success'>Active la réécriture des URLs<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommandé<\/span>",
        "recommanded": "Activé"
    },
    "81_pagespeed": {
        "title": "Tirer profit du module mod_pagespeed",
        "intro": "Le mod_pagespeed est un module Apache qui est peut-être activé chez votre hébergeur et si c'est le cas, vous pouvez optimiser votre site grâce à ce module.",
        "full": "<a href='https:\/\/developers.google.com\/speed\/pagespeed\/module' title='PageSpeed module by Google'>mod_pagespeed<\/a> est un module développé par Google et dont l'objectif est de réduire le poids de votre page web : en retirant les commentaires HTML, en compressant les images, en minifiant le code HTML, ...<br\/><br\/>L'activation du module mod_pagespeed dépend de votre hébergeur et de votre contrat. Il est donc possible qu'il ne soit pas actif sur votre compte et dans ce cas, l'optimisation proposée par aeSecure ne sera pas prise en compte.",
        "test": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Il faut que votre hébergeur ait activé le module Apache Google pagespeed et que votre abonnement, le cas échéant, inclue cette fonctionnalité.<br\/><br\/>Afin de tester la différence de vitesse, il faut que votre site soit en ligne et que vous fassiez le test de vitesse avec un outil tel que <a href='http:\/\/gtmetrix.com\/' target='_blank' title='GTMetrix | Website Speed and Performance Optimization'>GTMetrix<\/a>.  Faites le test la première fois sans avoir activé l'optimisation puis refaites le test une fois que l'optimisation est en place; vous devriez voir une différence significative.",
        "feature_enabled": "<span style='font-size:1.5em;'>Optimisation activée<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Optimisation désactivée<\/span>",
        "hint": "<span class='text-success'>Active l'optimisation de votre site grâce à mod_pagespeed (<span style='font-weight:bold;'>requiert que votre hébergeur ait activé ce module sur votre compte, l'optimisation sera sans effet autrement<\/span>).<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommandé<\/span><\/span>",
        "recommanded": "Activé"
    },
    "83_expire": {
        "title": "Spécifie la durée de vie des fichiers statiques",
        "intro": "Les fichiers statiques tels que les fichiers JavaScript, css, images, fontes web, ... sont par défaut téléchargés à chaque fois qu'une page est vue même si c'est le même utilisateur. Spécifier une durée de vie permet d'indiquer au navigateur web de ne pas télécharger le fichier s'il est déjà présent dans son cache.",
        "full": "Lorsqu'une durée de vie est définie pour des fichiers statiques, le navigateur de votre visiteur ne va plus télécharger le fichier dès lors qu'il est déjà dans son cache.  Ainsi, dès lors qu'un visiteur revient sur la page ou navigue d'une page à une autre, un grand nombre de fichiers ne seront plus téléchargés mais utilisés localement.  Cela aura un effet immédiat sur la vitesse de surf qui sera nettement accrue. ",
        "test": "Afin de tester la différence de vitesse, il faut que votre site soit en ligne et que vous fassiez le test de vitesse avec un outil tel que <a href='http:\/\/gtmetrix.com\/' target='_blank' title='GTMetrix | Website Speed and Performance Optimization'>GTMetrix<\/a>.  Faites le test la première fois sans avoir activé l'optimisation puis refaites le test une fois que l'optimisation est en place; vous devriez voir une différence significative.",
        "feature_enabled": "<span style='font-size:1.5em;'>Optimisation activée<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Optimisation désactivée<\/span>",
        "hint": "<span class='text-success'>Indique au navigateur de votre utilisateur une durée de vie longue pour les fichiers statiques tels que feuilles de styles, javascript, images, ...<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommandé<\/span><\/span>",
        "recommanded": "Activé sur un site de production, désactivé sur un site de test\/développement"
    },
    "89_hotlinking": {
        "title": "Empêcher le hotlinking",
        "intro": "Interdisez à d'autres d'utiliser votre bande passante en référençant, sur leur site, des images du vôtre",
        "full": "Lorsque d'autres sites web utilisent des images qui sont sur le vôtre, à chaque fois que quelqu'un affiche ce site tiers, votre bande passante est utilisée car votre serveur doit fournir l'image au demandeur alors même que ce site n'a rien à voir avec vous.   Il s'agit d'un site 'parasite'.<br\/><br\/>En ne permettant l'affichage d'une image que si la requête est faite depuis votre propre nom de domaine et\/ou certains sites autorisés (comme Google, Facebook, Yahoo, Bing, ...), vous réduisez donc le parasitage et vous préservez les ressources de votre serveur.",
        "feature_enabled": "<span style='font-size:1.5em;'>Optimisation activée<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Optimisation désactivée<\/span>",
        "hint": "<span class='text-success'>Refuse l'affichage d'une image de votre site si elle est appelée depuis un autre domaine que le vôtre<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommandé<\/span><\/span>",
        "recommanded": "Activé"
    },
    "accessdenied": {
        "banned": "Votre adresse IP a été bannie du site",
        "contactwebmaster": "Si vous pensez que c'est une erreur, merci de contacter le gestionnaire du site pour qu'il adapte le niveau de sécurité",
        "emailsent": "Un email a été envoyé au gestionnaire du site (%s).<br\/>Si vous ne deviez pas le recevoir, veuillez consulter la <a href='%s' target='_blank'>FAQ d'aeSecure<\/a> pour y lire une seconde manière de retrouver la clef.",
        "pagetitle": "Accès refusé",
        "mailwebmaster": "Si vous êtes le webmaster de ce site, cliquez <a href='sendkey.php'>ici<\/a> pour recevoir par email la clef de votre site",
        "reminderkey_title": "Rappel de la clef de votre site",
        "reminderkey_info": "Quelqu'un a tenté récemment de se connecter sur votre interface de gestion de aeSecure avec une mauvaise clef, probablement est-ce vous (adresse IP : %s).  Veuillez trouver ci-après le lien mentionnant la clef, n'oubliez-pas de mettre ce lien en favoris. ",
        "reminderkey_secret": "Pour rappel, conservez ce lien à l'abri des regards indiscrets.",
        "title": "Accès refusé."
    },
    "documentation": {
        "title": "Documentation",
        "hint": "Accédez à la documentation en ligne de aeSecure"
    },
    "forum": {
        "title": "Forum",
        "hint": "Forum de discussion de aeSecure"
    },
    "mail": {
        "illegitimate": "Quelqu'un a tenté d'accéder à votre site '%s' depuis une URL non légitime",
        "url": "URL accédée",
        "attack": "Type de l'attaque",
        "title": "Votre attention est requise sur votre site %s",
        "ipaddress": "Adresse IP",
        "showlog": "Afficher le logfile",
        "banip": "Bannir l'IP",
        "showvar": "Voir les variables",
        "technicalinfos": "Informations techniques"
    },
    "getlog": {
        "menu": "Log des accès refusés par aeSecure",
        "menu_hint": "Le fichier de log est celui qui contient une ligne par 'attaque' càd par URL ayant été bloquée par aeSecure.",
        "empty": "Votre fichier de log est actuellement vide",
        "emptymore": "Il semble que pour l'instant aucune tentative d'accès illégitime n'ait été rencontrée et capturée par aeSecure."
    },
    "ban": {
        "title": "L'adresse %s a été bannie et ne pourra plus accéder à votre .",
        "htaccess": "Le fichier .htaccess de votre site %s a été adapté et une règle a été ajoutée afin de bloquer l'adresse IP %s.  Elle figure désormais dans la liste noire."
    },
    "jQuery-messages": {
        "required": "Ce champ est requis.",
        "email": "Veuillez saisir une adresse mail valide.",
        "url": "Veuillez saisir une URL valide.",
        "alphabetic": "Veuillez ne saisir que des lettres.",
        "alphanumeric": "Veuillez fournir seulement des lettres, nombres, espaces et soulignages",
        "number": "Veuillez saisir un nombre.(ex.: 12,-12.5,-1.3e-2)",
        "integer": "Veuillez saisir un nombre sans décimales.",
        "minlength": "Veuillez saisir au moins {0} caractères.",
        "maxlength": "Veuillez ne pas saisir plus de {0} caractères.",
        "ipv4": "Veuillez saisir une adresse IP valide (version 4)."
    }
}