{
    "main": {
        "about": "A proposito",
        "aeSecureRelease": "Cliquez ici pour prendre connaissance des informations de versions",
        "filecreated": "Le fichier %s a été créé",
        "downloadfile": "Télécharger ce dossier\/fichier",
        "pleasewaitcanbelong": "Cette opération peut prendre un long moment.   Merci de ne pas fermer cette fenêtre et d'attendre.   Cliquez sur cette notification pour la faire disparaître.",
        "filesandfolders": "Fichiers et dossiers",
        "search": "Chercher",
        "database": "Base de données",
        "execute": "Exécuter",
        "downloadandkill": "<h3>Le fichier qui vient d'être téléchargé a été immédiatement supprimé de votre serveur web.<\/h3>Il n'est donc pas accessible depuis une URL.",
        "file": "Fichier",
        "pro": "Cette fonctionnalité est réservée aux utilisateurs Professionnels",
        "session_killed": "Votre session a été supprimée; vous pouvez fermer cette fenêtre en toute sécurité.",
        "logout": "Se déconnecter",
        "helpreadonline": "Consultez le site web d'aeSecure pour en savoir encore plus",
        "restorefromconfig": "Restaurer",
        "restorefromconfig_hint": "Si vous aviez déjà configuré cette option précédemment, récupérez vos derniers paramètres en cliquant sur ce bouton",
        "restoreconfirm": "Souhaitez-vous réellement remplacer le contenu actuel pour la précédente version ayant été sauvée ?",
        "icon_warning": "Un problème de configuration a été rencontré sur votre site, veuillez cliquer sur ce bouton afin d'afficher la liste des problèmes à résoudre rapidement.",
        "loadfromaesecure": "Charger depuis aeSecure",
        "loadfromaesecure_hint": "Cliquez sur ce bouton afin de récupérer une liste de valeurs depuis le site d'aeSecure.  Cette liste contient des valeurs déjà identifiées par le développeur d'aeSecure vous permettant de rapidement initialiser l’option ci-dessus.",
        "add": "Ajouter",
        "add_hint": "Cliquez sur ce bouton pour afficher un formulaire simplifiant l'ajout d'une nouvelle valeur",
        "confirm_save": "\":\"<strong>Au cas où vous auriez commis une erreur de syntaxe, votre site sera immédiatement inaccessible (erreur 500) après la sauvegarde.<\/strong><br\/><br\/>Avant de cliquer sur le bouton OK, soyez certain d'avoir un accès à votre FTP ou à un panneau de contrôle au cas où il faudrait intervenir manuellement dans le fichier .htaccess.",
        "invalidregex": "L'expression régulière (regex) que vous avez introduite semble incorrecte.  Merci de prendre le temps de vérifier la validité de votre encodage.",
        "edithtaccessandsearchfor": "Éditez manuellement le fichier .htaccess qui se trouve à la racine de votre site et recherchez les lignes entre les deux balises %ACTION_TAG_START% et %ACTION_TAG_END%.  Supprimez les lignes entre ces balises (non comprises).  Sauvez votre fichier et rafraichissez votre page web.  Votre site sera à nouveau accessible.",
        "select_all": "Tout seléctionner",
        "unselect_all": "Tout déselectionner",
        "toggle": "Intervertir",
        "result": "Résultat",
        "fileext": "Extension",
        "advancedoptions": "Options avancées",
        "newer_version_htaccess": "<strong>Veuillez mettre à jour votre .htaccess<\/strong><br\/>La version de votre .htaccess ne correspond pas à la dernière version proposée par aeSecure.  Pour activer la version la plus récente, veuillez désactiver l'option 1.1 pour la réactiver immédiatement après; ce faisant, aeSecure utilisera la nouvelle programmation.",
        "chapter4popuptitle": "Selon que votre site web utilise un CMS ou pas, vous aurez plus ouu moins d'options dans la liste ci-dessous.<br\/><br\/>Les options disponibles varieront selon le CMS utilisé (Joomla!®, WordPress, ...).",
        "chapter8popuptitle": "L'objectif de ces fonctionnalités est de rendre l'affichage de votre site plus rapide.<br\/><br\/>L’optimisation du site n’est disponible qu’à partir de l'offre Premium d'aeSecure.",
        "chapter5popuptitle": "Si votre site web n'utilise pas de base de données et\/ou si les données de connexion ne sont pas complétées dans l'écran Outils->Options, la liste ci-dessous sera vide.",
        "configure": "Configurer",
        "hiddenindemo": "Le mode démo étant activé, cette information n'est pas disponible pour des raisons de confidentialité",
        "actual_config": "Configuration actuelle",
        "actualconfig_intro": "Votre configuration actuelle est affichée ci-dessous, ceci à des fins de contrôle.  Ces informations sont importantes et confidentielles, ne le transmettez pas à autrui.",
        "actualconfig": "Configuration actuelle",
        "advanced_parameters": "Paramètres avancés",
        "incorrect_token": "L'exécution de cette action exige la présence de votre jeton de sécurité or, soit il a été omis, soit il est incorrect.",
        "advancedoptionsarehidden": "Les fonctionnalité avancées ne sont pas affichées ci-dessous. Pour les voir, veuillez vous rendre dans l'écran Outils->Options et modifier le paramètre 'Voir les fonctions avancées'",
        "chapter1popuptitle": "Les fonctions 1.1 et 1.2 <strong style='color:red;'>doivent être activées<\/strong>.  Sans cela, votre installation d'aeSecure est incomplète.",
        "chapter2popuptitle": "Si possible, <strong style='color:green;'>activez l'option 2.1 ou, mieux, 2.2, pour protéger l'accès à un dossier<\/strong> comme p.ex. votre dossier d'administration ou celui qui contient aeSecure.",
        "chapter3popuptitle": "Gestion des dossiers et des fichiers : évitez les 'chmods' 777\".",
        "chapter7popuptitle": "Gestion des URLs (réécriture, référencement, redirection, ...).",
        "chapter9popuptitle": "Fonctionnalités diverses.",
        "versionfreehiddenpaidoptions": "Vous utilisez la version gratuite, les fonctionalités avancées y sont absentes.",
        "versionpremiumhiddenpaidoptions": "Vous utilisez la version Premium, <strong style='text-decoration:underline;'>merci!<\/strong>  Besoin de plus ? Optez pour la Pro.",
        "reset_snippetdone": "Le code associé à cette option a été mis à jour mais <strong>non implémenté<\/strong> : si vous souhaitez l’utiliser, vous devez (ré)activer l’option.  Si elle était déjà active, veuillez cliquer sur le bouton pour la désactiver puis l'activer à nouveau.",
        "unprotect": "Supprimer la protection",
        "unprotected": "La protection vient d'être levée",
        "app_title": "aeSecure - Protezione di siti web",
        "aeSecureGetIt": "<a href='%s' title='%s'>Acquistare aeSecure<\/a>",
        "aeSecurePageTitle": "aeSecure - Protezione del tuo sito web via .htaccess",
        "actions_base": "Sicurezza di base \/ obbligatoria",
        "actions_other": "Sicurezza aggiuntiva",
        "actions_optimisation": "Ottimizzazione del tuo sito",
        "actions_seo": "SEO (posizionamento)",
        "actions_misc": "Varie",
        "attention": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attenzione:<\/span>&nbsp;",
        "config": "Configurazione di aeSecure per il sito <span style='font-weight:bold;'>%s<\/span> (%s)",
        "contact": "Contatto",
        "continue": "Continua...",
        "success": "Riuscito",
        "failure": "Fallito",
        "cancel": "Annulla",
        "demo": "Modalità demo",
        "days": "giorni",
        "modal_close": "Chiudi la finestra",
        "nochange": "Nessun cambiamento è stato effettuato",
        "close": "Chiudi",
        "security": "Sicurezza",
        "login": "Login",
        "password": "Password",
        "recommanded_state": "État recommandé",
        "folder": "Cartella",
        "save": "Salva",
        "filecreatedorupdated": "É stato creato o aggiornato il file %s",
        "clickonprotect": "Non dimenticare di cliccare sul pulsante \"Proteggi!\" affinché i cambiamenti siano salvaguardati",
        "intro": "Introduzione",
        "important_info": "Informazioni importanti",
        "information": "Avviso",
        "warning": "Attenzione",
        "links": "Link",
        "scan": "Scansiona",
        "more_info": "Spiegazioni dettagliate",
        "authorize_popups": "Il tuo navigatore blocca le finestre pop-up; attivale per il tuo sito",
        "new_version": "<h4>Aggiornamento disponibile<\/h4>La versione attuale di aeSecure è la versione <span style='font-weight:bold;color:red;'>%1<\/span>.<br\/>La versione più recente è la versione <span style='font-weight:bold;color:green;'>%2<\/span>.<br\/><br\/>Vuoi installarla ?",
        "ajax_new_version": "<strong>La versione %s di aeSecure è disponibile.<\/strong><br\/>Clicca sul tasto %s in alto a destra se vuoi installarla.",
        "version_control": "Verifica sul server di aeSecure se hai o no l'ultima versione del software.",
        "latest_version": "Congratulazioni, hai già l'ultima versione di aeSecure.",
        "optimize": "Ottimizza!",
        "protect": "Proteggi!",
        "edit": "Modifica",
        "permissions": "Permessi",
        "premium": "Questa funzione è riservata agli utenti Premium",
        "onlypremium": "Spiacente, questa funzione è riservata agli utenti Premium.",
        "filereadonly": "Il file %s non è modificabile",
        "fanfacebook": "Segui aeSecure su Facebook",
        "action_enabled": "Attiva",
        "action_disabled": "Disattivare",
        "state_enabled": "Attivato",
        "state_disabled": "Disattivato",
        "feature_enabled": "<span style='font-size:1.5em;'>La protezione è attivata<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>La protezione è disattivata<\/span>",
        "optimization_enabled": "L'ottimizzazione è stata <span class='label label-success'>attivata<\/span>.",
        "optimization_disabled": "L'ottimizzazione è stata <span class='label label-warning'>disattivata<\/span>; le righe nel file .htaccess che la rendevano possibile sono state rimosse.",
        "are_you_sure": "Sei sicuro?",
        "readmore": "Saperne di più",
        "not_joomla": "Il tuo sito non è un sito Joomla!®, questa funzione non è quindi disponibile.",
        "sorry_notfree": "Spiacente, questa funzione non è disponibile nella versione gratuita di aeSecure.&nbsp;",
        "sure_yes": "Sì, confermo",
        "sure_no": "No",
        "test": "Prova",
        "verify": "Verifica",
        "pleasewait": "La visualizzazione del tab o del risultato può richiedere qualche secondi; grazie di pazientare.",
        "pleaseselectatleastone": "Almeno un'opzione deve essere selezionata",
        "filecontent": "Contenuto del file %s",
        "hint_folder": "Nome della cartella da proteggere",
        "uptodate_php": "Congratulazioni, utilizzi l'ultimo aggiornamento della versione PHP (%s)",
        "test_tip": "Se vuoi vedere come agisce questa protezione, clicca qui. Sarà quindi possibile provare la protezione prima che quest'ultima sia attivata, ma anche dopo."
    },
    "options": {
        "phpautocheck": "Vérifie automatique la version de PHP",
        "phpautocheck_hint": "A l'affichage de la page de configuration d'aeSecure, effectue un contrôle de la version de php installée sur votre serveur web.  Le contrôle se fait directement depuis le site http:\/\/www.php.net\/releases.",
        "seeadvancedoptions": "Voir les fonctions avancées",
        "seeadvancedoptions_hint": "En désactivant cette option, les fonctions Premium et ainsi que les Pro ne seront plus visibles si vous avez la version gratuite d'aeSecure.<br\/><br\/><strong>Merci de prendre quelques instants pour envisager l'achat d'une version Premium qui va accroître la sécurité de votre site.<\/strong>",
        "title": "Opzioni",
        "form_title": "Impostazione di aeSecure",
        "hint": "Impostazione di aeSecure, configurazione della lingua, dell'invio delle email, ...",
        "save_hint": "Salvaguardia dei nuovi parametri che saranno immediatamente presi in conto.",
        "saved": "La tua configurazione è stata salvata",
        "site": "Sito web",
        "sitename": "Nome del sito",
        "sitename_hint": "Indiquez ici le nom du site; ce nom sera p.ex. utilisé dans les emails qui seront envoyés par aeSecure.  Cela vous permettra de différencier vos sites, si vous en avez plusieurs.",
        "logging": "Logging",
        "folderlog": "Localisation du dossier log",
        "folderlog_hint": "Nom complet du dossier qui contient les fichiers log de votre CMS (si vous en utilisez un)",
        "foldertmp": "Localisation du dossier temporaire",
        "logwrite": "Sauvegarde des fichiers de logs",
        "logwrite_hint": "Lorsque aeSecure bloque un accès, souhaitez-vous qu'un fichier soit généré dans le dossier de log; ce qui vous permettra de suivre le fonctionnement d'aeSecure, savoir qui tente des accès illégitimes, ...",
        "logtype": "Type de log",
        "logtype_hint": "Quand vous visualiserez l'ensemble des fichiers de log, souhaitez-vous le voir au format texte ou xml?",
        "foldertmp_hint": "Nom complet du dossier qui contient les fichiers temporaires de votre site",
        "key": "Clef secrète",
        "key_hint": "La clef secrète est celle utilisée pour accéder à la page \/aesecure\/setup.php.  Il s'agit de la variable qui permet de vérifier que vous êtes légitime ou pas.  Si vous changez de clef secrète, choississez-en une forte (minimum 10 caractères idéalement).",
        "timeout": "Durée de vie de la session (sec)",
        "timeout_hint": "La durée de vie de la session définit le temps, en secondes, entre l'obligation d'introduire la clef d'utilisation d'aeSecure et la prochaine action que vous ferez.  Veillez à ne pas choisir une durée trop longue, c'est inutile et est, potentiellement, une source d'usurpation d'identité.",
        "emailfromname": "Nom de l'expéditeur",
        "emailfromname_hint": "Nom qui sera celui de l'expéditeur des mails",
        "emailfrom": "eMail de l'expéditeur (From)",
        "emailfrom_hint": "eMail de l'expéditeur (Adresse email de l'expéditeur, il s'agit du champ From du mail)",
        "email": "Adresse email (To)",
        "email_hint": "Indiquez ici l'adresse email vers laquelle il faut envoyer certaines alertes d'intrusion ou la clef de votre site lorsque vous demanderez à la recevoir par email.",
        "sendemail": "Envoi d'emails",
        "sendemail_hint": "Certaines tentatives d'intrusion déclencheront l'envoi d'un email, souhaitez-vous activer cet envoi ou, au contraire, ne rien recevoir.<br\/>Ce paramètre n'est pas pris en compte pour l'envoi de la clef, en cas d'oubli.",
        "autocheck": "Vérification automatique de la version de votre CMS",
        "autocheck_hint": "<strong>Uniquement pour Joomla!®<\/strong><br\/>Si vous avez un CMS installé, vérifie automatiquement si vous disposez de la dernière version à l'affichage de la page de configuration de aeSecure",
        "emailsubject": "Sujet du mail",
        "emailsubject_hint": "Mentionnez ici le sujet du mail qui est envoyé par aeSecure.  Vous pouvez utiliser les variables '%SITENAME%' ou '%SITEURL%', la première reprend le nom du site tandis que la seconde son URL.",
        "language": "Langue de l'interface",
        "language_hint": "Sélectionnez la langue dans laquelle vous souhaitez afficher les différents textes de aeSecure.",
        "misc": "Divers",
        "geocoding": "Géolocalisation",
        "geocoding_hint": "Indiquez ici une URL qui pointe vers un service de géolocalisation sur base d'une adresse IP et qui retourne un résultat au format JSON. Ce service sera alors appelé lors de l'envoi d'un email vers le webmaster du site lorsqu'il s'agira de localiser sur une carte Google Map le lieu de provenance de l'attaque",
        "timezone": "Fuseau horaire par défaut",
        "timezone_hint": "Fuseau horaire par défaut à utiliser par votre serveur Apache pour toutes les fonctions relatives aux dates\/heures",
        "db": "Base de données",
        "dbname": "Nom",
        "dbname_hint": "Si votre site web est dynamique comme c'est le cas pour un site basé sur un CMS, indiquez ici le nom de votre base de données",
        "dbtype": "Type",
        "dbtype_hint": "Type de la base de données, cela peut être mysqli, mysql, mssql ou autre",
        "dbhost": "Nom du serveur",
        "dbhost_hint": "Le nom du serveur où se trouve votre base de données; généralement <strong>localhost<\/strong>",
        "dbuser": "Nom du compte (login)",
        "dbuser_hint": "Login à utiliser pour se connecter sur la base de données (sur un site local, généralement <strong>root<\/strong>)",
        "dbpassword": "Mot de passe",
        "dbpassword_hint": "Mot de passe à utiliser (sur un site local, généralement le champ du mot de passe est laissé vide)",
        "dbprefix": "Préfixe",
        "dbprefix_hint": "Préfixe des tables dans votre base de données",
        "debug": "Debug",
        "debug_hint": "Active le mode debug",
        "debuglanguage": "Debug des langues",
        "debuglanguage_hint": "Afin de faciliter la traduction des chaînes de langue de aeSecure, toutes les chaînes provenant du fichier de langue sont préfixées par '#' et du code à traduire (exemple : #title#Ceci est le titre traduit)",
        "demo": "Mode demo",
        "demo_hint": "Active le mode demo : aucune action ne sera réellement effectuée dans ce mode."
    },
    "82_compress": {
        "notsupported": "Désolé mais votre hébergeur n'a pas activé les modules mog_gzip ou mod_deflate qui permettent de compresser vos données avant l'envoi à l'utilisateur.   La compression; côté serveur, ne peut donc pas se faire pour votre site.",
        "title": "Attiva la compressione lato server",
        "intro": "La compressione lato server (mod_gzip o mod_deflate) è una funzionalità offerta da quasi tutti i web hosting, permette di comprimere in tempo reale il codice delle tue pagine HTML. Questo tipo di compressione riduce drasticamente il peso della pagina e consente quindi una visualizzazione più rapida",
        "full": "La compressione <a href='https:\/\/developers.google.com\/speed\/articles\/gzip' title='How gzip compression works'>gzip<\/a> riduce il peso delle vostre pagine web. La decompressione è invece gestita dal navigatore senza che l'utente se ne accorga. \nLa compressione consente il caricamento della pagina molto più veloce offrendo quindi una migliore esperienza di navigazione all'utente.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Informazione:<\/span>&nbsp;La rapidità di un sito web è un elemento preso in considerazione dai motori di ricerca per la classificazione nei risultati di ricerca: più il sito è veloce, migliore sarà il suo posizionamento (ranking)<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Informazione:<\/span>&nbsp;Dalla version 2.0 di Apache, mod_deflate è preferito a mod_gzip che inizia ad essere datato.",
        "test": "Per verificare la differenza di velocità è necessario che il tuo sito sia online. Con gli utensili elencati qui sotto fai un primo test con l'ottimizzazione disattivata e un secondo test con l'ottimizzazione attivata; dovresti notare una notevole differenza.<br\/><br\/><ul><li><a href='http:\/\/checkgzipcompression.com\/?url=%s' target='_blank' title='Check GZIP compression'>http:\/\/checkgzipcompression.com<\/a><\/li><li><a href='http:\/\/www.whatsmyip.org\/http-compression-test\/?url=%s' target='_blank' title='HTTP Compression Test'>http:\/\/www.whatsmyip.org\/<\/a><\/li><li><a href='http:\/\/gtmetrix.com\/' target='_blank' title='GTMetrix | Website Speed and Performance Optimization'>GTMetrix<\/a><\/li><\/ul>",
        "feature_enabled": "<span style='font-size:1.5em;'>Ottimizzazione attivata<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Ottimizzazione disattivata<\/span>",
        "hint": "<span class='text-success'>Comprime il codice HTML della pagina prima che quest'ultima sia visualizzata dall'utente (<span style='font-weight:bold;'>il tuo hosting deve abilitare la compressione lato server altrimenti l'ottimizzazione non sarà presa in considerazione<\/span>).<br\/><br\/><span style='font-weight:bold;' class='text-success'>Consigliato<\/span><\/span>",
        "recommanded": "Attivato"
    },
    "31_permissions": {
        "seefile": "Cliquez sur cette icône pour afficher le contenu du fichier (fichiers textes) ou voir l'image (fichiers images)",
        "makezip": "Zipper le dossier",
        "makezip_hint": "Génère une archive zip du dossier en cours et propose l'archive pour téléchargement.",
        "makezipconfirm": "Souhaitez-vous compresser ce dossier ? Cette opération peut prendre un certain temps...",
        "killfile": "Cliquez ici si vous souhaitez supprimer le fichier de votre site web",
        "title": "File e cartelle",
        "intro": "Specifica i diritti di accesso (chmod) delle cartelle e dei file del tuo sito. In tal modo si possono impostare i file che non devono essere modificati o le cartelle nelle quali non è possibile scrivere nuovi file.",
        "full": "I script maligni hanno la caratteristica di modificare alcuni file del tuo sito scrivendo un pezzo di codice che potrebbe provocare l'apparizione di un popup o il reindirizzamento verso un sito ostile, o addirittura creare nuovi file (php, htaccess, ...) nelle tue cartelle.<br\/><br\/>Altri script invece cercheranno di rubare informazioni riguardo la configurazione del tuo sito (il file configuration.php di Joomla!® o wp_config.php per WordPress), ...<br\/><br\/>Specificando i diritti di accesso ai file, aumenterai il livello di protezione del tuo sito.",
        "confirm": "<span class='text-danger'>Cambiare la sicurezza di questo file \/ cartella può causare problemi come ad esempio non avere più accesso al tuo sito web.<br\/><br\/>Se confermi la modifica, fai un test controllando l'accessibilità al tuo sito.<br\/><br\/><span style='font-weight:bold'>In caso di problemi, collegati con un client FTP e ripristina i precedenti permessi.<\/span><\/span>",
        "confirm_kill": "<span class='text-danger'>Stai per cancellare il file <span style='font-weight:bold;'>%s<\/span>.  Sei sicuro ?<br\/><br\/><span style='font-weight:bold'>Attenzione, se confermi, il file viene fisicamente cancellato.<\/span><\/span>",
        "file_removed": "<span class='text-success'>Il file <span style='font-weight:bold;'>%s<\/span> è stato cancellato<\/span>",
        "previous": "Valore precedente",
        "feature_enabled": "<span style='font-size:1.5em;'>Nuovo(i) permesso(i) assegnato(i)<\/span>",
        "chmodinfo_group": "<ul><li>Prima cifra : il proprio account utente (proprietario) <\/li><li>Seconda cifra : il gruppo (group)<\/li><li>Terza cifra : chiunque (everyone)<\/li><\/ul>",
        "chmodinfo_sec": "<ul><li>0 : nessun diritto<\/li><li>1 : autorizzazione di esecuzione<\/li><li>2 : autorizzazione in scrittura<\/li><li>4 : autorizzazione in lettura<\/li><\/ul>",
        "chmodinfo": "Le cifre vanno addizionate: il valore 5 significa lettura ed esecuzione (per una cartella = diritto di apertura), 6: lettura e scrittura, 7: tutti i diritti, …<br\/>I valori consigliati sono <span class='label label-success'>644<\/span> per i file e <span class='label label-success'>755<\/span> per le cartelle.  In regola generale non attribuire mai il valore <span class='label label-danger'>777<\/span> salvo per casi specifici.",
        "chmodinfo_best": "<div class='chmodbest'>&nbsp;<input type='radio' disabled\/>&nbsp;<\/div>A priori, è la migliore configurazione per questo file.",
        "chmodinfo_min": "<div class='chmodmin'>&nbsp;<input type='radio' disabled\/>&nbsp;<\/div>Non attribuire un permesso inferiore a questo; potrebbero verificarsi problemi di accesso..",
        "chmodinfo_na": "<div class='label label-warning'>Attenzione :<\/div>&nbsp;Operate in Windows, i permessi sono inefficaci e quindi inutili.  Effettua le modifiche solo dal tuo sito in produzione.",
        "chmodhtaccess": "Attenzione, alcuni host richiedono il permesso con un valore di almeno 444 per il file .htaccess.&#10;&#10;Se opti per un permesso più restrittivo, avrai probabilmente una pagina 'Error 500' al successivo log sul tuo sito.&#10;&#10;Per ripristinare il permesso del file .htaccess, utilizza un client  FTP (FileZilla ad esempio) e adatta il 'chmod' almeno a 444.",
        "chmod644": "Solo il tuo conto utente dal tuo web hosting può leggere e scrivere nei file, per gli altri conti è invece concesso solo l'accesso in lettura.",
        "chmod777": "La numerazione 777 vuol dire che tutti gli utenti hanno il permesso di lettura, scrittura ed esecuzione. Di solito questo permesso non dovrebbe mai essere applicato, è una porta aperta a qualunque persona malintenzionata ed è il migliore modo per farsi piratare il sito.",
        "can_be_deleted": "Di solito questo file potrebbe essere eliminato perché non è di alcuna utilità in un sito in produzione.<br\/><br\/><span style='font-weight:bold;'>Elimina questo file<\/span>",
        "htaccess": "Un permesso sbagliato su questo file e si otterrà un errore di tipo 500.<br\/><br\/>Il permesso più indicato è 444, tuttavia puoi tentare un permesso a 440 o addirittura a 400, ma sappi che c'è rischio di non aver più accesso al sito, in tal caso bisognerà ricorrere ad un client FTP e riportare il permesso (chmod) del file .htaccess a 444.<br\/><br\/><span style='font-weight:bold;'>Questo file è sensibile e importante<\/span>",
        "backups": "Se archivi le tue salvaguardie in questa cartella, sappi che non è una buona idea perché è possibile accederci dal web. Idealmente bisognerebbe scegliere una cartella fuori dalla cartella 'public_html'.<br\/><br\/><span style='font-weight:bold;'>Se tuttavia desideri mantenere la cartella \/backups nella stessa posizione pensa a proteggerla. Utilizza le opzioni 2.1 e 2.2 d'aeSecure per consentire l'accesso alla cartella \/backups solo alle persone autorizzate.<\/span>",
        "configuration.php": "Nel caso di un sito in produzione si consiglia di applicare a questo file un permesso a 400 (massimo 444). Se in seguito è necessario modificare la configurazione generale del sito, riporta il permesso di questo file a 644. Una volta effettuate le modifiche dal pannello d'amministrazione di Joomla, ripristina l'accesso a 400.<br\/><br\/><span style='font-weight:bold;'>Questo file è sensibile e importante<\/span>",
        "htaccess.txt": "Questo file è inutile. Se disponi già di un file denominato .htaccess, eliminalo.<br\/><br\/><span style='font-weight:bold;'>Elimina questo file<\/span>",
        "index.php": "Questo file non deve mai essere accessibile in scrittura, nel caso contrario rischi di vedere il tuo sito piratato.<br\/><br\/><span style='font-weight:bold;'>Al massimo opta per un permesso a 444<\/span>",
        "logs": "La cartella logs è importante perché è utilizzata dal CMS per scrivere dei file di tipo log, è dunque necessario poterci scrivere (permesso 5 o 7)<br\/><br\/><span style='font-weight:bold;'>Attribuisci un permesso a 755<\/span>",
        "php.ini": "Questo file non deve in alcun caso avere un permesso in scrittura, un accesso in lettura è più che sufficiente<br\/><br\/><span style='font-weight:bold;'>Questo file è sensibile e importante<\/span>",
        "robots.txt": "Si tratta di un file che deve essere accessibile ai robot dei motori di ricerca, un permesso solo in lettura è ampiamente sufficiente. Non attribuire un permesso superiore a 444.",
        "tmp": "La cartella tmp è importante perché è utilizzata dal CMS per scriverci dei file temporanei, è dunque necessario poterci accederci (permesso 5 o 7)<br\/><br\/><span style='font-weight:bold;'>Attribuisci un permesso a 755<\/span>",
        "web.config.txt": "Su un server Apache questo file è inutile.<br\/><br\/>Su un server Microsoft, rinomina il file web.config per abilitare la riscrittura degli URL.<br\/><br\/>Se disponi già di un file denominato web.config, puoi eliminarlo<br\/><br\/><span style='font-weight:bold;'>Questo file è inutile<\/span>"
    },
    "tools": {
        "ZipWebsite": "Télécharger une archive du site",
        "ZipWebsite_hint": "Une archive au format zip va être générée (cette opération va prendre du temps!) et l'archive sera immédiatement proposée au téléchargement.&#10;&#10;Veuillez ne pas fermer la fenêtre jusqu'à obtention du fichier zip.&#10;&#10;NB : l'archive zip sera immédiatement supprimée du site web avant même que le téléchargement ne débute.  Le fichier ne sera donc pas 'téléchargeable' autrement que par cette fonction-ci.",
        "see_apache_error_log": "Voir le log des erreurs Apache",
        "see_apache_error_log_hint": "Le log des erreurs est le fichier dans lequel votre serveur web écrit chaque problème rencontré au niveau de votre site; par exemple les erreurs dites fatales qui provoquent l'affichage d'une page blanche.\\r\\nATTENTION\\r\\nCe fichier peut être volumineux et son affichage pourrait prendre beaucoup de temps.  Pour cette raison, seul un nombre limité de lignes (les dernières du fichier) sera affiché.",
        "apache_error_log_skip": "Ne seront pas affichées, les lignes du fichier de log qui contiennent ces chaînes de caractères :",
        "apache_error_log_skip_short": "rencontré %s fois",
        "lastmod-selectfolder": "Veuillez renseigner le nom d'un dossier",
        "lastmod-nonefound": "Ce dossier n'apparaît dans aucun résultat ci-dessous",
        "lastmod-hidefolder": "Souhaitez-vous supprimer de cette liste tous les fichiers se trouvant dans un dossier précis (p.ex. 'cache')?  Introduisez le nom du dossier ci-dessous et cliquez sur le bouton 'Masquer'.",
        "lastmod-hide": "Masquer",
        "lastmod-foldersample": "Entrez un nom de dossier comme p.e. cache",
        "fileread_notfound": "Aucune ligne ne contient la chaîne de caractères recherchée",
        "fileread_placeholder": "ex. accessdenied.php?s=651",
        "fileread_ignore": "Les lignes contenant une des valeurs ci-dessous ont été ignorées : ",
        "fileread_specify_something": "Veuillez s'il vous plaît spécifier une chaîne de caractères afin qu'aeSecure puisse la chercher et masquer les lignes qui la contiennent.",
        "see_apache_error_log_notfound": "Le log des erreurs Apache est actuellement vide.  Dès à présent, lorsqu’une erreur Apache sera rencontrée, ce dernier y écrira le message de l’erreur dans le fichier log.  Il est donc parfaitement normal si ce fichier est actuellement vide\/non trouvé.",
        "see_htaccess_notfound": "Le fichier .htaccess n’a pas été trouvé à la racine de votre site.  Veuillez activer l'option 1.1 d'aeSecure.   <br\/><br\/><span style='font-weight:bold;font-style:underline;font-size:1.5em;'>Note : en l'absence du fichier .htaccess, aeSecure est inopérant !<\/span>",
        "see_phpini_notfound": "Aucun fichier php.ini n'a été trouvé à la racine de votre site.  Ce fichier est ajouté lorsque vous activez l'option 1.2 d'aeSecure.  L’absence du fichier php.ini n’impacte aucunement le fonctionnement d’aeSecure puisque les mêmes informations sont également reprises dans le fichier .htaccess se trouvant à la racine de votre site web.",
        "see_activity_notfound": "Le fichier des activités commence à être créé dès que vous activez l'une ou l'autre option d'aeSecure.",
        "pentest-text": "Tests d'intrusion \/ hacking",
        "pentest-hint": "Cet outil permet d'exécuter un grand nombre de requêtes 'malsaines' vers un site et voir la manière dont il va réagir.   Lorsqu'aeSecure est actif, l'objectif est que toutes ces tentatives soient stoppées (tenant compte du paramétrage de votre site).&#10;&#10;NB : Les attaques sont factices; aucune n'étant réelle.",
        "title": "Outils",
        "coderemover-hint": "Trojan code remover est un script qui permet de scanner les fichiers js, php, html, shtml, htm, tpl, inc, asp, cfm, aspx et pl de votre site à la recherche d'une chaîne de caractères et, si elle est trouvée, la chaîne est supprimée.&#10;&#10;Il s'agit donc d'un outil pour nettoyer votre site après que ce dernier a été compromis.",
        "jamss-hint": "Joomla! Anti-Malware Scan Script est un script de détection de certains mots clefs dans les fichiers sources de votre site.   Il s'agit uniquement d'afficher les fichiers reprennant ces mots-clefs qui sont susceptibles d'être des malwares.&#10;&#10;Il s'agit donc d'un outil pour tenter de trouver les traces d'un éventuel piratage.&#10;&#10;ATTENTION: JAMSS génère un très grand nombre de faux positifs, il faut donc bien analyser les messages avant d'intervenir.",
        "false-positive": "<div style='color:red;width:80%;margin-left:100px;margin-right:100px;display:block;'><span style='font-weight:bold;'>Attention!!!<\/span> Ce type d'outil scanne les fichiers présents sur votre site à la recherche de patterns càd d'une liste de mots clefs qui, potentiellement, peuvent être dangereux.  Par exemple, le mot 'iframe' est recherché car il est possible, par iframe, d'afficher des informations en provenance d'un site tiers.  Toutefois, les boutons pour les réseaux sociaux utilisent fréquemment des iframes.  Les programmes de sécurité, comme aeSecure, contiennent aussi de tels patterns vu qu'ils sont développés justement afin de bloquer des attaques.  Soyez donc extrêmement vigilant et analysez correctement les informations retournées par le script.<br\/><br\/>Si vous lancez une opération de nettoyage; pensez à faire une sauvegarde de votre site juste avant, vous pourriez en avoir besoin en cas de pépin.<\/div>",
        "psi-hint": "PhpSecInfo est un outil d'audit de la configuration PHP de votre hébergement",
        "phpinfo-text": "phpinfo",
        "phpinfo-hint": "phpinfo va afficher la configuration php de votre site en, par exemple, listant des modules qui sont chargés.",
        "lastmod-text": "Fichiers ayant été modifiés récemment",
        "lastmod-hint": "Scanne votre site web à la recherche des fichiers ayant été modifiés durant les xxx derniers jours.  De cette manière, en cas de hacking, vous pouvez mettre en évidence les fichiers ayant été modifiés et vous pourrez porter votre attention sur ces fichiers-là.",
        "lastmod-explain": "Si vous souhaitez retrouver la liste des fichiers ayant été modifiés les 7 derniers jours, veuillez indiquer ce nombre (7) ci-dessous.   Vous pouvez mentionner un chiffre entre 1 et 99.",
        "lastmod-days": "Nombre de jours (1-99)",
        "lastmod-files": "Liste des fichiers ayant été modifiés les %d derniers jours",
        "lastmod-number": "Nombre de fichiers : %d",
        "allow_url_fopen": "Attention : allow_url_fopen doit être actif afin de garantir le bon fonctionnement de Joomla!®.  Ainsi, par exemple, en le désactivant, les fonctions de mises-à-jour de Joomla!® ne fonctionneront plus.",
        "HTML2PNG": "Capture la page au format PNG",
        "HTML2PNG_hint": "La capture de la page va générer une image PNG de ce qui est affiché, ainsi vous pourrez aisément sauvegarder vos paramètres par exemple",
        "see_htaccess": "Votre fichier .htaccess",
        "see_htaccess_hint": "Ouvre un popup qui vous permet de visualiser le fichier .htaccess qui a été mis en place",
        "see_phpini": "Votre fichier php.ini",
        "see_phpini_hint": "Ouvre un popup qui vous permet de visualiser le fichier php.ini de aeSecure.  Ce fichier se trouve dans le dossier racine de votre site web",
        "see_activity": "Votre journal des activités",
        "see_activity_hint": "Ce fichier reprend la liste des actions que vous avez entreprises comme l'activation d'une fonctionnalité.  En cas de problème, ce fichier vous permettra de savoir ce qui a été fait.",
        "reset_htaccess": "Désinstaller le .htaccess et php.ini de aeSecure",
        "reset_htaccess_hint": "Restaure votre .htaccess de base en supprimant toutes les références aux règles installées par aeSecure.  Si vous souhaitez désinstaller totalement aeSecure, veuillez supprimer le dossier \/aesecure de votre site web.",
        "reset_htaccess_notfound": "Le fichier .htaccess de aeSecure n'était visiblement pas encore activé sur votre site.  Aucune action n'a été faite.",
        "reset_htaccess_done": "Votre fichier .htaccess a été nettoyé du code de aeSecure.   Seul votre code personnel s'y trouve désormais.",
        "reset_htaccess_removed": "Avant installation de aeSecure, il n'y avait pas de fichier .htaccess en place.  Votre fichier .htaccess actuel a été renommé en OLD.htaccess.",
        "aeSecure_no_more_active": "aeSecure n'est plus actif sur votre site"
    },
    "15_blockip": {
        "title": "Blocage d'adresses IP",
        "intro": "Bloquer une adresse IP correspond à interdire à un ordinateur précis d'accéder à votre site web.  Lorsque vous subissez une attaque, il est souvent utile de bloquer les IP des machines.  Remarque: l'adresse IP est souvent dynamique et change donc régulièrement.",
        "full": "L'adresse IP est l'empreinte digitale de tous appareils connectés sur le web.  Au moment d'accéder à votre site, le visiteur dispose donc d'une adresse IP qui lui est propre et unique au monde.   Si vous souhaitez interdire l'accès à votre site à cette personne, il faut bloquer son adresse IP.<br\/><br\/><div class='text-primary'><strong>Remarque :<\/strong>&nbsp;L'adresse IP est la plupart du temps dynamique et attribuée à l'utilisateur au démarrage de son appareil.  En bloquant l'IP, vous bloquez donc 'temporairement' l'accès au site (à moins que l'adresse IP soit fixe et dans ce cas, c'est définitif).<br\/><br\/>Certains spammeurs ou 'crawler' (càd des scripts qui analysent toutes les pages de votre site) ont une adresse IP statique; invariable.<\/div>",
        "preface": "Veuillez introduire une adresse IP par ligne et\/ou séparée par des points virgules.<br\/>Exemple : 255.255.255.255;128.128.128.128;123.123.123.123 pour bloquer ces trois adresses IP.",
        "saved": "Vos modifications ont \\u00e9t\\u00e9 sauv\\u00e9es.<br\/><br\/><span class='lead text-danger'>En cas de probl\\u00e8me d'acc\\u00e8s, il vous faudra \\u00e9diter le fichier .htaccess depuis votre client FTP.<\/span>"
    },
    "21_protectFolderIp": {
        "preface": "Seules les adresses IP mentionnées ci-dessous auront accès au dossier; toute autre tentative de connexion sera redirigée vers une page \"Accès interdit\".",
        "title": "Limitare l'accesso ad una cartella in base all'indirizzo IP",
        "intro": "L'accesso ad una cartella (per es. \/amministratore) sarà limitato ad uno o più indirizzi IP predefiniti. In tal modo, solo alcuni computer avranno accesso al sito.",
        "full": "Limitando l'accesso su base di uno o più indirizzi IP, si rende impossibile ad altri computer di accedere ad una cartella. Questa sicurezza di \"accesso limitato\", è la migliore soluzione che si possa implementare di default, in tal modo saranno selezionati dei computer su base di una lista bianca.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attenzione:<\/span>&nbsp;Se l'indirizzo IP è dinamico, com'è il caso per la maggior parte degli ISP (Internet Service Provider - fornitore di servizi Internet), sarà opportuno utilizzare questa funzione in modo da aggiungere il nuovo indirizzo IP ad ogni aggiornamento.",
        "restrict": "Accesso limitato alla cartella basato sull'indirizzo dell'utente",
        "done": "L'accesso alla cartella %s è limitato all'indirizzo IP %s",
        "removed": "La limitazione basata sull'indirizzo IP è stata eliminata",
        "addressip": "Indirizzo IP",
        "hint": "<span class='text-danger'>Clicca sul pulsante soltanto se vuoi bloccare l'accesso alla cartella scelta che si trova nel computer con questo indirizzo IP.<br\/><br\/><span style='font-weight:bold;'>Bloccherai le altre connessioni; se è quello che vuoi fare, clicca sul pulsante<\/span><\/span>",
        "hint_ip": "Questo è il tuo indirizzo IP attuale"
    },
    "11_protecthtaccess": {
        "preface": "Si, après avoir activé cette protection vous deviez rencontrer une erreur à l'affichage de votre site, veuillez vous référer à la <span style='font-weight:bold;text-decoration:underline;'><a href='http:\/\/aesecure.com\/documentation\/faq.html' target='_blank'>FAQ<\/a><\/span> d'aeSecure.",
        "feature_enabled": "<span style='font-size:1.5em;'>aeSecure activé<\/span><br\/><br\/>Veuillez contrôler que votre site reste fonctionnel en testant quelques URLs.  Si vous deviez rencontrer un souci, merci de vous référer à la <span style='font-weight:bold;text-decoration:underline;'><a href='http:\/\/aesecure.com\/documentation\/faq.html' target='_blank'>FAQ<\/a><\/span><br\/><br\/>Si la réécriture de vos URLs n’est plus activée, merci d’activer l’option 7.1 d’aeSecure.",
        "title": "Mise en place du fichier .htaccess de aeSecure",
        "intro": "Il file .htaccess viene letto dal server web ogni volta che viene richiesto. Il file .htaccess di aeSecure contiene un gran numero di regole che aumenteranno la protezione e l'ottimizzazione del tuo sito web.",
        "full": "Che si tratti di visualizzare una pagina web oppure di scaricare un documento, il file .htaccess viene letto dal server web ogni volta che un indirizzo URL è eseguito sul vostro sito. Questo file è essenziale alla protezione del vostro sito in quanto sarà lui che eseguirà la scansione e deciderà se l'indirizzo URL analizzato potrà essere accettato o no.<br\/><br\/>aeSecure andrà a sostituire l'attuale file .htaccess aggiungendo un meccanismo di verifica degli indirizzi URL. Questa verifica determinerà se l'URL analizzato dovrà essere approvato o no, garantendo così una protezione del sito web<br\/><br\/>Il tuo file sarà incluso in quello generato da aeSecure<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Avviso:<\/span>&nbsp;Il tuo file sarà salvaguardato nella cartella \/aesecure\/setup\/backup prima di collocare il file di aeSecure.",
        "copy": "Copia del principale file .htaccess di aeSecure",
        "copyfromto": "Copia %s verso %s",
        "state_enabled": "Installato",
        "state_disabled": "Disinstallato",
        "recommanded": "<span style='font-weight:bold'>il file .htaccess di aeSecure è obbligatorio, deve essere installato.<\/span>",
        "keep_old_content": "Prima dell'installazione di aeSecure, il contenuto del file .htaccess originale è stato incluso in quello di aeSecure.",
        "renamed": "Il file precedente %s è stato rinominato in %s",
        "test": "<p>Alcuni file sono accessibili via un indirizzo URL allorché non dovrebbero esserlo, è il caso per esempio di alcuni file installati di default con Joomla, esempio (<a href='%HTTP_HOST%\/LICENSE.txt' target='_blank'>LICENSE.txt<\/a>,<a href='%HTTP_HOST%\/joomla.xml' target='_blank'>joomla.xml<\/a>,<a href='%HTTP_HOST%\/README.txt' target='_blank'>README.txt<\/a>, ...)<\/p><p>Altri invece dovrebbero essere protetti con particolare attenzione, come ad esempio il file <a href='%HTTP_HOST%\/configuration.php' target='_blank'>configuration.php<\/a> o il file <a href='%HTTP_HOST%\/.htaccess' target='_blank'>.htaccess<\/a><\/p><p>Esistono alcuni script che tentano di  raggiungere siti costruiti con Joomla verificando l'esistenza di alcuni file. È il caso di immagini presenti di default con Joomla, che se individuate possono svelare la versione installata di Joomla. Alcune immagini installate di default con Joomla: <a href='%HTTP_HOST%\/images\/joomla_black.gif' target='_blank'>images\/joomla_black.gif<\/a>, <a href='%HTTP_HOST%\/images\/banners\/white.png' target='_blank'>images\/banners\/white.png<\/a>, <a href='%HTTP_HOST%\/images\/sampledata\/apple.jpg' target='_blank'>images\/sampledata\/apple.jpg<\/a><\/p><p>Anche gli hacker cercano di accedere ai file del sistema operativo come win.ini e boot.ini lanciando un gran numero di richieste di questo tipo: <a href='%HTTP_HOST%\/index.php?option=com_users&task=..\\..\\..\\..\\..\\..\\..\\..\\..\\boot.ini%00.htm' target='_blank'>index.php?option=com_users&task=..\\..\\..\\..\\..\\..\\..\\..\\..\\boot.ini%00.htm<\/a>.  Se il tuo sito web non è sufficientemente protetto è probabile che il tuo file, in questo caso il file boot.ini, verrà visualizzato.<\/p><p>Il file .htaccess di aeSecure avrà il compito di vietare l'accesso ai seguenti file\/cartelle:<ul><li>file\/cartelle nascoste e dunque con il nome iniziante con un punto(.), è il caso del file .htaccess, ma altri file del tipo .backup o .git sono validi, trattandosi di file nascosti, aeSecure impedirà il loro accesso a partire da un indirizzo URL.<\/li><li>file\/cartelle installate di default, come per esempio <a href='%HTTP_HOST%\/images\/sampledata\/index.html' target='_blank'>images\/sampledata<\/a><\/ul><\/p><p>Inoltre saranno bloccati da aeSecure indirizzi URL con parametri, quali<ul><li>gli indirizzi URL che abitualmente vengono chiamati \"templates fingerprint\" <a href='%HTTP_HOST%\/index.php?tmpl=offline' target='_blank'>index.php?tmpl=offline<\/a>, <a href='%HTTP_HOST%\/index.php?tp=1' target='_blank'>index.php?tp=1<\/a><a href='%HTTP_HOST%\/index.php?template=beez' target='_blank'>index.php?template=beez<\/a>.<\/li><li>gli indirizzi URL basati su codici proibiti, di tipo \"carriages returns\" o \"escape characters\".<\/li><li>gli indirizzi di tipo \"PHP Easter Eggs\" che svelano la version PHP installata sul tuo sito web <a href='%HTTP_HOST%\/index.php?=PHPE9568F34-D428-11d2-A769-00AA001ACF42' target='_blank'>index.php?=PHPE9568F34-D428-11d2-A769-00AA001ACF42<\/a><\/li><li>gli indirizzi contenenti codice Javascript <a href='%HTTP_HOST%\/index.php?%3Cscript%3Ealert%28%27Msg%27%29;%3C\/script%3E' target='_blank'>index.php?%3Cscript%3Ealert%28%27Msg%27%29;%3C\/script%3E<\/a><li>...<\/li><\/ul><\/p><p>Molti altri attacchi tramite indirizzo URL saranno bloccati grazie al file .htaccess di aeSecure...<\/p><h4>\nIn assenza del file .htaccess di aeSecure, ciascuna delle richieste elencate qui sopra sarà visualizzata nei miglior dei casi con un messaggio d'errore e nel peggiore dei casi sarà visualizzata una pagina di contenuto. La protezione di aeSecure bloccherà queste richieste ancor prima che raggiungano il tuo sito web e, quindi, prima che quest'ultimo cerchi di rispondere.<\/h4>",
        "hint": "<span class='text-success'>Copia il file .htaccess di aeSecure alla radice (root) del tuo sito web ed incorpora il tuo file originale alla fine del file appena creato.<br\/><br\/><span class='text-success' style='font-weight:bold;'>Indispensabile e obbligatorio.<\/span><\/span>"
    },
    " 11_protecthtaccess": {
        "preface": "Si, après avoir activé cette protection, vous deviez rencontrer une erreur à l'affichage de votre site; veuillez vous référer à la <span style='font-weight:bold;text-decoration:underline;'><a href='http:\/\/aesecure.com\/documentation\/faq.html' target='_blank'>FAQ<\/a><\/span> d'aeSecure."
    },
    "73_editrobots": {
        "title": "Édition du fichier robots.txt",
        "intro": "Le fichier robots.txt est placé à la racine de votre site et donne des consignes aux moteurs de recherche quant à ce que vous autorisez ou pas.  Ainsi, par exemple, c'est grâce à robots.txt qui vous interdisez au moteur de recherche d'indexer les fichiers de votre dossier d'administration ou autres dossiers sensibles et privés.",
        "full": "Le fichier robots.txt va autoriser (allow) ou interdire (disallow) au moteur de recherche d'indexer tout ou partie de votre site.  Prenez le cas où vous avez un dossier \/administrator : vous ne souhaiterez pas voir apparaître dans les résultats d'une recherche des liens vers votre administration.  Si vous avez des dossiers personnels comme \/backups, \/confidentiel, \/members_only, ..., vous n'aimeriez pas plus que des liens soient retournés à quiconque ferait une recherche sur p.ex. Google.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Si vous utilisez un CMS, vous avez déjà un tel fichier; sinon, peut-être est-il manquant.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Notez que les moteurs de recherche ne sont pas 'obligés' de respecter le fichier robots.txt.  Un moteur de recherche 'peu scrupuleux' pourrait même tenter d'analyser le fichier pour voir ce que voudriez 'cacher'.",
        "explain": "Si vous souhaitez des explications sur la syntaxe à utiliser, visitez le site <a href='http:\/\/robots-txt.com\/' title=\\\\\"Robots.txt - Manuel d'implémentation\\\\\" target='_blank'>http:\/\/robots-txt.com<\/a>.<br\/><br\/><span class='label label-success'><i class='icon-info-sign icon-white'><\/i>&nbsp;Truc:<\/span>&nbsp;N'oubliez pas d'indiquer votre <a href='http:\/\/robots-txt.com\/ressources\/robots-txt-sitemap-xml' target='_blank'>Sitemap<\/a> dans le fichier robots.txt.<br\/><span class='label label-success'><i class='icon-info-sign icon-white'><\/i>&nbsp;Truc:<\/span>&nbsp;Vous pouvez tester la qualité de votre fichier robots.txt <a href='http:\/\/www.searchenginepromotionhelp.com\/m\/robots-text-tester\/robots-checker.php' target='_blank'>ici<\/a>",
        "saved": "Vos modifications ont été sauvées"
    },
    "45_dbadmin": {
        "failure": "<span class='bg-danger lead'>Attention, vous avez au moins un compte <strong>%s<\/strong> qui est actif dans votre base de données.<br\/><br\/><a href='http:\/\/aesecure.com\/fr\/documentation\/fonctionnalites.html' target='_blank'>Cliquez ici si vous avez besoin d'informations<\/a><\/span>",
        "congrats": "Félicitations, vous n'avez aucun login <strong>%s<\/strong> qui est actuellement actif sur votre site.",
        "nologinprovided": "Merci de bien vouloir indiquer le nom d'un login à vérifier; par exemple \"admin\".",
        "preface": "Le compte d'administration par défaut sous Joomla!® est \"admin\". Toutefois, si vous souhaitez tester un autre compte; veuillez introduire le nom ci-dessous.",
        "full": "Imaginez un instant que vous êtes un pirate ne serait-ce que quelques secondes : vous êtes face à un écran de connexion où l'on vous demande d'introduire un login et un mot de passe. Quel est le login que vous allez tenter sachant, en outre, qu'il s'agit d'un site Joomla!® ? Réponse : <strong>vous allez écrire \"admin\" dans le champ login.<\/strong><br\/><br\/>Dès lors que le login \"admin\" est effectivement encore utilisé sur le site en question; le pirate aura déjà fait 50% du travail : devenir un login existant et ayant des droits supérieurs.<br\/><br\/>Quel que soit le système informatique, il ne faut jamais utiliser les comptes par défaut car ils sont connus; les pirates les essayent en priorité. Si vous utilisez (encore) un tel compte, changez-en immédiatement! <strong>Créez un nouveau compte de type super-admin et désactivez le compte \"admin\".<\/strong>",
        "intro": "Auriez-vous encore un compte \"admin\" actif sur votre site ?",
        "title": "Recherche du compte \"admin\""
    },
    "51_backupdb": {
        "title": "Exportation de la base de données au format SQL",
        "intro": "Après exécution, vous obtiendez un fichier au format texte et qui reprendra le code SQL pour regénérer totalement votre base de données.<br\/><br\/>Il s'agit donc d'un backup complet de votre base de données.",
        "full": "L'exportation de la base de données vous permet de conserver un backup de celle-ci mais se révèlera également fort pratique pour rechercher du code malveillant puisque vous obtenez un fichier texte dans lequel il est aisé de faire des recherches manuellement, à la recherche de code qui pourrait être stocké dans des articles, modules, ...<br\/><br\/>Si vous avez un site en local, vous pouvez restaurer votre base de données en vous connectant dans votre interface phpMyAdmin locale et en exécutant le code SQL contenu dans le fichier.",
        "protect": "Exécuter"
    },
    "18_devilnumber": {
        "preface": "La zone de gauche vous permet de lancer une recherche et d'afficher la liste des dossiers et des fichiers ayant leur chmod à la valeur recherchée. <u>Aucune modification ne sera apportée à votre site<\/u>.<br\/><br\/>La zone de droite permet de définir les nouvelles valeurs pour les dossiers et les fichiers.  Si vous cliquez sur le bouton Protéger! de la zone de droite, les dossiers \/ fichiers ayant le chmod cherché ne seront plus seulement affichés mais le chmod sera adapté pour refléter votre choix.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Rappel:<\/span>&nbsp;Le chmod d'un dossier devrait être 755 et celui d'un fichier 644.",
        "title": "Verifica i permessi (chmod) delle cartelle e dei file",
        "intro": "Quando il livello di accesso (chmod) ad un file è parametrato a 777, significa che il file è accessibile, modificabile ed eseguibile da qualsiasi utente. La situazione è ancora più critica se tali parametri sono applicati ad una cartella: chiunque potrebbe creare un file, inserire un codice maligno ed eseguirlo.<br\/><br\/>A priori, non c'è scenario che richieda tale livello di accesso per le cartelle o\/e i file.",
        "full": "777 significa che chiunque può leggere, scrivere ed eseguire i file presenti sul server web. È una situazione contro la quale ogni webmaster deve assolutamente proteggersi.<br\/><br\/>Non c'è a priori, alcuna situazione in cui il livello di sicurezza debba essere così alto. Il numero 777 è anche conosciuto come <strong>la cifra del demonio<\/strong>.<br\/><br\/>\nClicca sul tab \"Verifica\" affinché aeSecure scansioni il sito web (ci vorrà tempo) per cercare i file con tale permesso. Se ne fosse trovato uno, è necessario cambiarne i permessi! Per i file applicare il permesso 644, mentre per le cartelle applicare il permesso 755.<br\/> \nAlcune applicazioni richiedono permessi 777 che se cambiati potrebbero causare la disfunzione del sito web. In tal caso sarà necessario informare lo sviluppatore dell'applicazione.",
        "congrats": "Nessuna cartella o file ha un livello di accesso pari al chmod richiesto. Nel caso di un chmod 777, questa sì che è una grande notizia!",
        "nbr_files": "Numero di ricorrenze trovate : %d",
        "feature_enabled": "Ricerca di cartelle\/file terminata",
        "windows": "Questo sito è in esecuzione su un server di tipo Windows, il <strong>chmod<\/strong> di un file non è supportato da Windows, questa funzionalità non è dunque eseguibile su questo server. Se sei attualmente su un sito di sviluppo, verifica l'opzione sul server in produzione."
    },
    "84_minify": {
        "title": "\"Minification\" des fichiers css, html et javascript",
        "intro": "Derrière ce terme barbare (minify en anglais) se cache une fonctionnalité qui va réduire le poids des feuilles de styles, fichiers html et javascript en supprimant à la volée les espaces et retour à la ligne inutile dans les fichiers.\n\nLe poids des fichiers étant allégé, le chargement de la page sera plus rapide.",
        "full": "Lorsqu'un développeur programme une feuille de styles (fichier css) ou un code javascript (fichier js), il fait en sorte que son code soit lisible par un humain en l'indentant, en ajoutant ici et là des retours à la ligne pour séparer les règles, les fonctions, ...   Sans cela, le code serait illisible et ingérable.<br\/><br\/>Ces espaces et retours à la ligne sont des caractères et donc \"alourdissent\" le poids du fichier.<br\/><br\/>Pour le navigateur web, ces caractères sont absolument inutiles et peuvent être ôtés.  Ce faisant, le poids du fichier est plus réduit et est donc plus rapidement transmis au navigateur.<br\/><br\/>Les outils de mesure de performance tels que GTmetrix ou YSlow accordent de l'importance à ce que les fichiers soient \"minifiés\".  Cette option va s'en charger.",
        "test": "Avant d'activer cette option, affichez une page de votre site puis faites un \"view-source\" càd appuyez sur CTRL-U pour visionner le code source de la page.  Repérez le lien vers un fichier css plus ou moins important en nombre de lignes.   Si le fichier n'est pas \"minifié\"; vous pourrez le lire assez aisément, la présentation du fichier sera claire.<br\/><br\/>Activez ensuite l'option et procédez à nouveau pour afficher à nouveau le fichier.   Vous verrez alors ce qu'est la minification à l'oeuvre.",
        "feature_enabled": "<span style='font-size:1.5em;'>Minification activée.<\/span><br\/><br\/><span class='lead text-danger'>En cas de problème d'accés, il vous faudra éditer le fichier .htaccess depuis votre client FTP.<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Minification désactivée<\/span>",
        "recommanded": "Activé sur un site de production, désactivé sur un site de test\/développement",
        "minifycss": "Minifier les feuilles de styles (fichiers .css)",
        "minifyjs": "Minifier les scripts javascript (fichiers .js)",
        "minifyjswarning": "La minification d'un fichier .js est souvent mal supportée et conduit à une erreur javascript.  Cette erreur, visible depuis la console de débogage du navigateur, va stopper l'exécution des fonctions javascript ce qui résultera en un dysfonctionnement du site web.<br\/><br\/>Veuillez par conséquent tester, tester et tester encore votre site si vous activez cette fonction afin de garantir qu'il fonctionne encore comme souhaité.",
        "minifyhtml": "Minifier les fichiers HTML (fichiers .htm et .html)",
        "explain": "<span class='label label-danger'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;<span style='color:red;'>La minification est un processus très sensible : il y a un grande probabilité que vos fichiers javascrit puissent ne plus fonctionner et conduire à des erreurs JS, ce qui va perturber l'affichage de votre site et bloquer l'exécution de tout code JS.<\/span><br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Il n'est pas utile d'activer cette option si l'option 8.1 l'est déjà et si elle est opérationnelle sur votre site."
    },
    "dashboard": {
        "title": "Multi-sites",
        "noaccess": "L'interface multi-sites est réservée aux utilisateurs professionnels de aeSecure.  Il s'agit d'un écran central qui vous permettra de suivre les différentes installations de aeSecure que vous avez sur vos sites clients.   Vous pourrez voir les versions installées, les mettre à jour, télécharger un zip du site, exporter la base de données, suivre le log des attaques et encore plein d'autres fonctionnalités.<br\/><br\/>L'offre \"pro\" est une option à acquérir sur le site de aeSecure.com.",
        "clickmore": "Cliquez sur Ok pour en savoir plus",
        "contact": "Contact",
        "actions": "Actions",
        "aesecureSetup": "Affichage de l'écran de configuration d'aeSecure",
        "aeSecureInstalledVersion": "Version d'aeSecure actuellement installée sur le site",
        "backend": "Affichage de la page d'administration du site (backend)",
        "addsite": "Ajouter un site",
        "addsite_prompt": "Veuillez indiquer ci-dessous l'URL complète vers le site à ajouter.<br\/><br\/>Veillez à donner l'adresse du site selon cette forme exclusivement : <strong>http:\/\/votresite\/aesecure\/setup.php?TRES_TRES_LONGUE_CLEF<\/strong>",
        "addsite_done": "Site ajouté, la page va être rafraichie pour que le nouveau site soit affiché...",
        "configuration": "État de la configuration actuelle des différentes fonctionnalités d'aeSecure",
        "dashboardversion": "multisites v",
        "edit": "Édition de données du site",
        "email": "Ouvre un écran d'envoi de mail dans votre client messagerie avec le destinaire précomplété à l'adresse du gestionnaire du site.  Aucun mail n'est envoyé automatiquement, il sera juste affiché afin de vous permettre de l'envoyer vous-même.",
        "exportdb": "Exporte la base de données du site.<br\/><br\/><span style='font-weight:bolder;color:blue;'>Merci de patienter car cette opération est longue...<\/span>",
        "footer": "aeSecure, optimisation et sécurisation de vos sites web Apache",
        "frontend": "Affichage du site (frontal)",
        "hideerrorsiste": "Masque les sites en erreur",
        "home": "Ouverture de votre site dans un nouvel onglet",
        "log": "Voir le log des attaques pour ce site",
        "onlyIfPremium": "<span class='text-danger'>NB : Uniquement disponible si le site distant dispose de la version Premium d'aeSecure<\/span>",
        "masterversion": "Version de référence d'aeSecure",
        "mailToWebmaster": "aeSecure : la nouvelle version (v%1) a été installée sur votre site %2",
        "notresponding": "aeSecure ne répond pas. Soit il a été désinstallé soit il s'agit d'une ancienne version",
        "PHPVersion": "Version de PHP sur le site web",
        "reinstall": "Exécute la mise à jour d'aeSecure sur ce site; réinstalle le logiciel",
        "releaseinfo": "Informations sur les mises à jour",
        "removesite_hint": "Cliquez ici si vous désirez retirer ce site de votre écran de gestion multisites",
        "removesite_prompt": "Merci de confirmer que vous souhaitez effectivement supprimer le site %1 de votre écran de gestion multisites?",
        "setup": "Accédez à l'interface de gestion d'aeSecure",
        "sites_network_errors": "%1 site(s) n'ont pas pu être vérifiés suite à une erreur de connexion réseau, la requête ajax de vérification ayant échoué.  Ces sites apparaissent sur un fond rouge.",
        "sites_with_old_version": "Vous avez %1 installation(s) avec une ancienne version d'aeSecure.  Ces sites apparaissent sur un fond rouge.",
        "subtitle": "En vert les sites à jour, en rouge ceux ne l'étant pas et en orange ceux qui ne répondent pas à la requête d'information.",
        "subtitle_buttons": "Les icônes dans la barre de boutons dépendent de la version d'aeSecure installée sur le site distant.",
        "zip": "Téléchargez une archive ZIP du site.<br\/><br\/><span style='font-weight:bolder;color:blue;'>Merci de patienter car cette opération est très longue...<\/span>",
        "click_and_modal": "Cliquez ici pour afficher l'information dans une fenêtre modale",
        "11_not_installed": "aeSecure n'a pas été complètement installé.  Veuillez activer les options 1.1 et 1.2.",
        "eraser": "Nettoie les dossiers 'cache' et temporaire du site distant",
        "cache_cleaned": "Les différents dossiers cache et temporaire ont été nettoyés",
        "lastmod": "Affiche la liste des fichiers ayant été modifiés récemment sur le site distant",
        "download_as": "Télécharger le tableau au format",
        "error_apache": "Voir le log des erreurs du serveur web Apache",
        "allow": "Activer la fonctionnalité",
        "allow_hint": "En activant cette option, vous allez autoriser votre site à transmettre des informations, cryptées, lorsqu'une interface multi-site le questionnera pour prendre connaissance de sa configuration.<br\/><br\/>Cette option ne devrait être activée que si et seulement si vous disposez d'un compte PRO et que vous souhaitez inclure le site dans votre écran de gestion multi-site.  Laissez l'option désactivée dans le cas contraire."
    },
    "74_editredirection": {
        "title": "Gestion des redirections",
        "intro": "Les redirections permettent de corriger certaines URLs pour les faire pointer vers d'autres adresses comme par exemple rediriger http:\/\/votresite\/page-supprimee vers http:\/\/votresite\/nouvelle-page.   Il s'agit d'un outil particulièrement efficace pour corriger les URLs \"mortes\" qui sont mentionnées par des outils type Google Webmaster Tools.",
        "full": "Durant la vie de votre site web, des pages vont être supprimées et d'autres seront déplacées.   Peut-être allez-vous programmer vos propres redirections pour simplifier une URL : p.ex. http:\/\/votresite\/contact.html et non plus une URL complexe, non SEF.<br\/><br\/>Un des usages les plus fréquents des redirections est de corriger les liens morts qui vous sont rapportés par, par exemple, Google Webmaster tools.",
        "explain": "<span class='text-info'><strong>Attention : Si vous faites une erreur de syntaxe, vous aurez immanquablement une erreur serveur de type 500.  Dans ce cas il faudra accéder à votre site par FTP pour corriger votre fichier \/.htaccess.  Ayez donc l'accès à votre client FTP \"sous la main\".<\/strong><\/span>",
        "saved": "Vos modifications ont été sauvées."
    },
    "72_seo_www": {
        "preface": "Si vous comptez utiliser un CDN pour optimiser la vitesse d'affichage de votre site, vous devez imposer le préfixe www.",
        "cant_be_used": "Cette fonctionnalité ne peut être utilisée que si votre site : <ol><li>n'est pas en localhost (ou 127.0.0.1),<\/li><li>n'est pas un sous-domaine (p.ex.http:\/\/sous-domaine.votresite.fr) et<\/li><li>si votre site est accessible en http:\/\/votre-site.fr\/index.php ou http:\/\/www.votre-site.fr\/index.php càd qu'il est au niveau racine de votre nom de domaine.<\/li><\/ol>",
        "title": "Costringe (o no) la scrittura del prefisso www negli indirizzi URL",
        "intro": "Per evitare i contenuti duplicati (duplicate content), si consiglia di costringere la scrittura degli URL del sito in modo che il prefisso www sia menzionato o no. Si avrà quindi un miglior posizionamento.",
        "full": "Quando un motore di ricerca arriva sul tuo sito, due sono i casi nel modo in cui ci accede: o tramite l'indirizzo www.iltuosito.it oppure tramite l'indirizzo iltuosito.it. Per il motore di ricerca sono due URL diversi e dunque due siti diversi.<br\/><br\/>In un contesto del genere, il motore di ricerca interpreterà due contenuti simili (duplicate content) per due indirizzi diversi (uno per il sito con il prefisso www e l'altro per il sito senza il prefisso www) penalizzando così il tuo posizionamento nei risultati dei motori di ricerca.\n<br\/><br\/>Si consiglia quindi di costringere la scrittura degli URL del sito con o senza il prefisso www. Se non desideri optare per questa soluzione, l'utente che avrà digitato manualmente l'URL www.iltuosito.it sarà reindirizzato piuttosto verso l'indirizzo senza il prefisso www",
        "with_done": "Modifica effettuata, il tuo sito sarà accessibile solo con il prefisso www (www.ilmiosito.it)",
        "without_done": "Modifica effettuata, il tuo sito sarà accessibile senza il prefisso www (ilmiosito.it)",
        "test": "<a href='%s' target='_blank'>Verifica il tuo sito %s<\/a>",
        "state_enabled": "www. imposto",
        "state_disabled": "www. cancellato",
        "feature_enabled": "<span style='font-size:1.5em;'>Prefisso www. imposto<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Prefisso www. cancellato<\/span>",
        "hint": "<span class='text-success'> Costringe o no il prefisso 'www.' degli URL. Un utente che arriva sul tuo sito digitando manualmente ilmiosito.it si vedrebbe cambiare l'indirizzo URL in www.ilmiosito.it <\/span>",
        "recommanded": "A secondo della tua scelta"
    },
    "errors": {
        "checkconfiguration": "Merci de bien vouloir vérifier votre écran de configuration (menu Outils - Options) afin de corriger les erreurs ci-dessous :",
        "err_missing_root_htaccess": "L'utilisation d'aeSecure implique l'existence d'un fichier nommé .htaccess à la racine de votre site.  Veuillez activer la fonction 1.1 d'aeSecure afin de créer ce fichier; sans cela aeSecure est inactif",
        "err_htaccess_no_aesecure": "Le fichier .htaccess présent à la racine de votre site n'est pas celui d'aeSecure qui est donc actuellement inactif sur votre site.  Veuillez activer la fonction 1.1 d'aeSecure afin d'inclure le code de protection.",
        "incorrect_installation": "L'installation d'aeSecure est partielle.  Le fichier <strong>%s<\/strong> est manquant, ce qui ne devrait pas être le cas.   Merci de bien vouloir réinstaller une nouvelle version d'aeSecure.",
        "dberror": "Erreur au niveau de l'accès base de données : %s",
        "folderlognotfound": "Le dossier des logs n'existe pas sur votre site.  Merci de bien vouloir corriger le chemin d'accès vers ce dossier en affichant l'écran des options d'aeSecure et en spécifiant un dossier existant, ceci pour l'option \"%s\"",
        "dirnotwritable": "le dossier est protégé contre l'écriture",
        "createerror": "Erreur lors de la création\/mise à jour du fichier %s.  Si le fichier existe, vérifiez qu'il n'est pas en lecture-seule.",
        "error_copying": "Une erreur est survenue lors de la copie du fichier %s <span class='label label-important'>%s<\/span>",
        "filenotfound": "Fichier %s non trouvé",
        "cantkill": "Le fichier %s ne peut pas être supprimé, vérifiez les permissions du fichier",
        "invalid_params": "Paramètres incorrects",
        "noaccessfolder": "Il semble que vous n'ayez pas l'autorisation d'accéder au dossier %s",
        "siteroot_foldernotfound": "Le dossier %s n'existe pas dans le dossier racine de votre site web",
        "foldernotfound": "Dossier inexistant : %s",
        "impossible_check_jversion": "Il n'a pas été possible de vérifier, en ligne, si votre version de Joomla!® est à jour",
        "old_php": "Votre version actuelle de PHP est la version <strong>%s<\/strong>.  Il existe une version plus récente (%s).   Si vous êtes hébergé sur un serveur mutualisé, voyez dans la FAQ de votre hébergeur s'il est possible d'activer une version plus récente.  Généralement, cela se fait en ajoutant une ligne précise dans le fichier .htaccess principal de votre site.",
        "old_php_major": "<span style='color:red;'>Sachez qu'il existe une version majeure de PHP plus récente que la vôtre<\/span>..  En effet, votre site tourne sur du PHP <strong>%s<\/strong>; peut-être pourriez-vous activer la version %s. <span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Le passage d'une version majeure à une autre n'est pas sans conséquence; pensez à le faire localement, sur un site de test, afin de vous assurer que votre site fonctionne correctement.",
        "not_supported": "<span class='label label-danger'>Erreur:<\/span><span style='color:red;font-style:italic;'>&nbsp;Oups, cette fonctionnalité n'est pas encore implémentée.  Numéro de la fonctionnalité : <strong>%s<\/strong>.<\/span>"
    },
    "91_cleantmpfolder": {
        "preface": "Nettoie le dossier \"%1\".  Si vous souhaitez adapter la localisation de ce dossier, veuillez cliquer sur le menu Outils -> Options.",
        "clean": "Dossier(s) temporaire purgé(s) : %",
        "title": "Svuota la cartella temporanea del tuo sito",
        "intro": "Ogni tanto pensa a svuotare la cartella temporanea",
        "full": "La cartella temporanea può contenere un gran numero di file generati dalle varie applicazioni installate sul tuo sito web.<br\/><br\/>Questi file non sono destinati a rimanere nella cartella temporanea, sono generati solo durante l'esecuzione di una funzionalità di un programma, occupando e diminuendo gradualmente il quota disponibile dal tuo hosting, pensa dunque ad eliminarli regolarmente.",
        "feature_enabled": "<span style='font-size:1.5em;'>Cartella temporanea svuotata<\/span>",
        "hint": "<span class='text-success'>Elimina i file temporanei ...<br\/><br\/><span style='font-weight:bold;' class='text-success'>Consigliato<\/span><\/span>",
        "protect": "Svuota!"
    },
    "blocked": {
        "Access denied to this folder": "L'accès direct à ce dossier \/ fichier depuis une URL est interdit.",
        "access to robots": "L'accès direct au fichier robots.txt n'est pas autorisé",
        "PHPSESSID attempt": "Tentative de fixation de l'ID de la session PHP",
        "javascript attempt": "Tentative d'exécution d'un code javascript dans l'URL",
        "SQL injections": "Tentative d'injections SQL",
        "Probited backend file's access": "Accès interdit à un fichier de l'administration du site",
        "Probited file's access": "Tentative d'accès à un fichier dont l'accès est strictement interdit depuis une URL",
        "Probited hidden file\/directory access": "Tentative d'accès à un fichier\/dossier dont l'accès depuis une URL n'est pas autorisé",
        "Unknown component": "Composant inconnu",
        "Are you a spammer ?": "Êtes-vous un spammer ? ",
        "Invalid referrer": "Referrer non valide et\/ou non autorisé",
        "Invalid characters in the querystring": "L'URL contient des caractères non autorisés",
        "base64_encode within the url": "base64_encode détecté dans l'URL",
        "Functions found in the querystring": "Appel à des fonctions depuis l'URL",
        "No file upload allowed on this website": "L'upload de fichiers est strictement interdit sur ce site",
        "Illegal words in the query string": "L'URL contient des mots se trouvant dans la liste noire",
        "Unauthorized access to a monitored folder": "Tentative d'accès à un dossier dont l'accès est sous surveillance",
        "Shell attacks": "Attaque de type shell détectée",
        "I think you don't need to access this folder...": "Passez votre chemin, vous n'avez rien à faire ici",
        "Access to this file is prohibited by server's rules": "Tentative d'accès à un fichier dont l'accès est interdit par les règles du serveur",
        "Block specials methods from HTTP Request": "Ce type de requêtes est interdit",
        "Trying to modify the REQUEST \/ PHP GLOBAL variables": "Tentative de modifier les variables globales ou de la requête web passée au serveur",
        "You're definitly a bad guy.  Why trying SQL injections?": "Vous êtes un sale type.  Pourquoi voulez-vous attaquer la base de données de ce site?",
        "PHP Easter Eggs": "PHP Easter Eggs",
        "No direct access to this file": "L'accès direct au fichier n'est pas autorisé; veuillez passer par l'interface de gestion de aeSecure",
        "Session timeout": "Votre session a expiré, veuillez relancer l'interface de gestion d'aeSecure",
        "Incorrect key": "Clef incorrecte (ou session expirée)",
        "Block xss tries": "Tentative d'exécution d'une attaque dite xss",
        "Registration page disallowed": "Aucune création d'utilisateur ne peut se faire sur ce site web",
        "com_media fileupload disallowed": "Le gestionnaire des médias ne permet pas d'uploader des fichiers",
        "Trying to run a javascript code from the url": "Code javascript détécté dans l'URL",
        "Fingerprint attacks detected": "Attaque de type fingerprint (empreinte digitale) détectée",
        "This script isn't allowed to be executed": "Tentative d'accès à un script php non autorisé explicitement par les règles du serveur web."
    },
    "quickinfo": {
        "generatedon": "Rapport généré le %s",
        "buttonhint": "Affiche un rapport tabulaire reprenant la configuration du site.&#10;%IsPremium%",
        "function": "Fonctionnalités",
        "quickoverview": "Aperçu rapide",
        "fullreport": "Rapport global",
        "value": "Valeur",
        "remarkversion": "La mémorisation des fonctionnalités a été introduite avec la version 1.2 d'aeSecure; si vous disposiez d'une version plus ancienne préalablement, il vous faudra réactiver la fonctionnalité (p.ex. désactiver puis réactiver l'option 1.3) pour que l'option apparaisse ci-dessus."
    },
    "tips": {
        "did_you_know": "Saviez-vous que ...",
        "close_hint": "En cliquant sur le bouton de fermeture, vous demandez à aeSecure de ne plus afficher ce message-ci",
        "joomla_quick_icons": "il existe un <strong>module 'QuickIcons' pour Joomla!<\/strong> permettant d'ajouter dans votre administration Joomla! un lien direct vers l'interface de gestion d'aeSecure.  Si vous souhaitez installer le module, veuillez cliquer sur le lien ci-dessous correspondant à votre version de Joomla!, téléchargez le fichier et installez-le dans votre interface de gestion des extensions.   Notez qu'il s'agit d'un module pour l'administration; il faudra donc afficher les modules pour le \"client\" administration.  Activez le module et placez-le, par exemple, dans la position 'Icône' ou 'menu' de Joomla!.",
        "folder_ip_restriction": "En matière de restriction d'accès à un dossier (p.ex. \/administrator), la meilleure protection est celle offerte par l'option 2.1 d'aeSecure.  En effet, vous bloqueriez l'accès à tout le monde sauf à quelques machines (adresses IP). Il faut cependant que vous disposiez d'une <strong>adresse IP fixe<\/strong> ce qui est assez rare mais, si c'est votre cas, optez pour cette protection-là.",
        "protect_aesecure": "... l'accès à votre dossier \/aesecure requiert une clef tellement longue et complexe qu'elle est impossible à deviner.  Toutefois, il se pourrait qu'un logiciel espion sur votre ordinateur puisse accéder à l'URL de votre interface aeSecure. Pour garantir la sécurité de votre interface, songez à utiliser les options 2.1 ou 2.2 pour bloquer l'accès au dossier \/aesecure.",
        "protect_dashboard": "... si vous êtes un utilisateur PRO et que vous utilisez l'interface Multi-sites; songez à protéger l'accès au dossier \/dashboard grâce aux options 2.1 ou 2.2.<hr\/>Sécurité accrue : vous pourriez installer l'interface multi-sites uniquement en local (serveur localhost) afin que la gestion centralisée de vos sites ne soit pas accessible en ligne."
    },
    "27_blockrobotstxt": {
        "title": "Bloque l'accès au fichier robots.txt aux curieux",
        "intro": "robots.txt est le nom d'un fichier à la racine de votre site qui reprend des informations pour les moteurs de recherche : indexer ceci, ne pas indexer cela.   Ce fichier est à destination des moteurs de recherche (les bots); pas pour les humains qui pourraient y découvrir l'architecture de votre site.",
        "full": "Lorsque vous accédez à l'URL <a href='%SITEURL%robots.txt' target='_blank'>%SITEURL%robots.txt<\/a>, vous ouvrez un fichier texte dans lequel se trouve des lignes comme Disallow: \/administrator pour indiquer aux bots de ne pas indexer le dossier administrator de votre site.<br\/><br\/>Ceci est parfait sauf que vous indiquez que vous avez un tel dossier sur votre site.<br\/><br\/>Sur certains sites, il pourrait y avoir un Disallow: \/Secrets p.ex. qui serait un dossier de votre site que vous souhaitez garder 'secret' et auquel seuls les initiés peuvent accéder.   Certains sites sont ainsi construits : ils ne prévoient pas de protection particulière et quiconque connaît l'existence du dossier \/Secrets peut y accéder.   Ces sites-là sont donc très vulnérables à la divulgation des informations du fichier robots.txt<br\/><br\/>La protection offerte par l'option 2.7 vise à détecter qui accède au fichier robots.txt et de n'autoriser l'accès qu'aux seuls robots connus et repris dans une liste blanche.",
        "test": "Avant d'activer cette option, accédez à cette URL : <a href='%SITEURL%robots.txt' target='_blank'>%SITEURL%robots.txt<\/a>.  Vous verrez le contenu du fichier.   Activez ensuite l'option et tenter à nouveau l'accès, le contenu du fichier vous sera masqué.",
        "hint": "Bloque l'acc\\u00e8s au fichier robots.txt aux humains.<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recommand\\u00e9<\/span>",
        "recommanded": "Activé"
    },
    "92_cleancachefolder": {
        "title": "Purge les dossiers cache de votre site",
        "intro": "Les dossiers cache sont, s'ils existent, le dossier \/cache et \/administrator\/cache de votre site. Vider le cache permet de garantir qu'une nouvelle version de la page sera envoyée à l'utilisateur.",
        "full": "Sur des sites dynamiques comme le sont les sites sur base d'un CMS, une fois que la page a été générée après de multiples requêtes vers la base de données, le code HTML de la page est sauvegardé sur le serveur afin que, si une autre personne demande l'affichage de la même page, la version cachée puisse être utilisée et donc accélérer la vitesse d'affichage du site.<br\/><br\/>Lorsque vous souhaitez forcer le rafraichissement d'une page de votre site, il convient de vider le cache pour que l'accès à l'URL provoque la lecture des données depuis la base de données.",
        "feature_enabled": "<span style='font-size:1.5em;'>Dossier(s) cache nettoyé(s)<\/span>",
        "hint": "<span class='text-success'>Purge le cache<\/span>",
        "protect": "Purger!",
        "clean": "Dossier(s) cache purgé(s) : %s"
    },
    "12_protectFolder": {
        "skip": "Un fichier %s est déjà présent sur votre site, il n'a pas été modifié par aeSecure <span class='label label-info'>Info<\/span>",
        "title": "Protezione delle cartelle",
        "intro": "<ol><li>Copia vari file .htaccess nelle principali cartelle del tuo sito web in modo da limitarne l'accesso ed impedirne l'esecuzione di codice php. Ad esempio nella cartella \/tmp, ecc.<\/li><li>Copia un file php.ini alla radice (root) del tuo sito web.<\/li><li>Scansiona la struttura del tuo sito web e copia un file index.html in ogni cartella che dovesse esserne sprovvisto.<\/li><\/ol>",
        "full": "<ol><li>Alcune cartelle del tuo sito web non dovrebbero mai essere accessibili tramite un indirizzo URL. È il caso per esempio della cartella \/tmp: nessuno dovrebbe accederci tramite un indirizzo URL del tipo http:\/\/vostro_sito\/tmp\/. Integrando un file .htacess con una regola deny all, avrai la garanzia che nessuno potrà accederci, ma soprattutto che un eventuale hacker possa introdurre un file php che una volta eseguito comprometterebbe la sicurezza del tuo sito web.<\/li><li>Il file php.ini che viene inserito alla radice (root) del tuo sito web (sempre a condizione che quest'ultimo sia accettato dal tuo web hosting), permette di impostare dei valori limitandone così l'accesso, come ad esempio la possibilità di aprire un file php a distanza (allow_url_fopen).<\/li><li>Ogni cartella del tuo sito web è scansionata in modo da determinare se in ognuna di essa è presente un file index.html. Se non fosse il caso, aeSecure collocherà un file il cui scopo è di vietare ad un visitatore di accedere a un URL che punta a questa cartella; in mancanza di un file index.html il contenuto della cartella sarebbe stato visibile. Infatti, a seconda della configurazione del server web, è possibile visualizzare l'elenco di file e cartelle, il che sarebbe dannoso in termini di sicurezza.<\/li><\/ol>",
        "hint": "<span class='text-success'>Colloca vari  file .htaccess nelle principali cartelle del tuo sito web. Viene poi scansionata l'arborescenza del sito web e un file index.html è copiato nelle cartelle dove non è presente.<br\/><br\/><span class='text-success' style='font-weight:bold;'>Indispensabile e obbligatorio.<\/span><\/span>",
        "install": "Mise en place du fichier %s <span class='label label-success'>Succès<\/span>",
        "copy_index": "Copia di file index.html",
        "no_index_copied": "Congratulazioni, tutte le cartelle contenevano già un file index.html"
    },
    "16_blockpartURL": {
        "title": "Blocage sur base d'éléments dans l'URL",
        "intro": "Après analyse des logfiles de votre serveur web, vous constatez des tentatives d'accès à des URLs bien précises : <ul><li>des URLs qui mentionnent p.ex. des noms de fichiers inexistants sur votre site (p.ex. food.php)<\/li><li>des URLs dont les paramètres fournis sont dangereux (p.ex. des tentatives d'upload de fichiers)<\/li><\/ul>Cette option 1.6 va vous permettre de spécifier des règles de blocages pour ces URLs.",
        "preface": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Si les lignes que vous ajoutez contiennent une erreur de syntaxe, votre site web sera imm\\u00e9diatement inaccessible (erreur 500).  Il vous faudra dans ce cas vous connecter sur votre site gr\\u00e2ce \\u00e0 votre client FTP, \\u00e9diter le fichier .htaccess qui se trouve \\u00e0 la racine de votre site et supprimer manuellement les lignes que vous venez d'ajouter.<br\/><br\/><div class='text-center'><span class='label label-primary'><i class='icon-info-sign icon-white'><\/i>&nbsp;Si vous souhaitez faire plusieurs blocages, veuillez n'en encoder qu'un par ligne.<\/span>&nbsp;<\/div>",
        "url": "Encodez ici les blocages à effectuer <u>sur l'URL<\/u> (ce qui précède l'éventuel point d'interrogation)",
        "url_sample": "Cliquez sur le bouton \"%ADD%\" afin d'obtenir des exemples.",
        "querystring": "Encodez ici les blocages à effectuer <u>sur les paramètres<\/u> de l'URL (partie située après le point d'interrogation)",
        "querystring_sample": "Cliquez sur le bouton \"%ADD%\" afin d'obtenir des exemples.",
        "full": "Lorsque vous analysez vos logs, vous allez voir comment des pirates tentent d’accéder à votre site.\nIls vont essayer d’exploiter des trous de sécurité connus comme p.ex., fin 2013, l’exploitation d’une faille dans le composant JCE et qui permettait d’uploader une image depuis une URL contenant les instructions <strong>option=com_jce&task=plugin&plugin=imgmanager<\/strong>.   \nD’autres exploits vont essayer d’exécuter une librairie php qui pourrait être présente sur votre site (p.ex. openflashchart).\nIl s’agit à chaque fois de lignes dans le log des accès de votre site qui démontre une tentative de pénétration du site.\nCette option 1.6 vous donne la possibilité de bloquer les URLs de deux façons : soit sur la base d’un mot dans l’URL soit sur la présence d’un mot dans les paramètres de l’URL.  Les paramètres sont ce qui suit le point d’interrogation (s’il est présent).",
        "addmsg": "Veuillez introduire ci-dessous une expression régulière afin de bloquer des URLs sur base de la présence d'un ou de plusieurs mots <strong><u style='color:red;'>dans l'URL<\/u><\/strong>.<br\/><br\/>Si vous désirez bloquer un mot, veuillez utiliser une expression telle que celle ci-dessous si, p.ex., vous souhaitez bloquer le mot <strong>steaming<\/strong> et ce, peu importe sa position dans l'URL : <pre style='margin:0 0 2% 3%;width:90%;'>.*(streaming).*<\/pre><p>Vous pouvez également indiquer ici des expressions régulières plus complexes comme ci-dessous pour bloquer toutes les URLs se terminant par <strong>\/admin.php<\/strong><\/p><pre style='margin:0 0 2% 3%;width:90%;'>.(\\\/admin.php)$<\/pre><h4 style='background-color:rgb(205, 241, 177);margin:10px;padding:10px;border:1px solid green'>Pour tester vos expressions régulières, n'hésitez pas à utiliser ce site : <a href='http:\/\/regex101.com\/' target='_blank'>http:\/\/regex101.com\/<\/a><\/h4><hr\/>Veuillez introduire votre restriction ci-dessous :<br\/>",
        "addmsg2": "Veuillez introduire ci-dessous une expression régulière afin de bloquer des URLs sur base de la présence d'un ou de plusieurs mots <strong><u style='color:red;'>dans les paramètres de l'URL<\/u><\/strong>.<br\/><br\/>Les paramètres d'une URL représentent tout ce qui suit le ? présent dans l'URL.   Si vous avez une URL du type index.php?task=upload, vous pourriez bloquer <strong>la tâche d'upload<\/strong> comme ceci : <pre style='margin:0 0 2% 3%;width:90%;'>.*(task=upload).*<\/pre><h4 style='background-color:rgb(205, 241, 177);margin:10px;padding:10px;border:1px solid green'>Pour tester vos expressions régulières, n'hésitez pas à utiliser ce site : <a href='http:\/\/regex101.com\/' target='_blank'>http:\/\/regex101.com\/<\/a><\/h4><hr\/>Veuillez introduire votre restriction ci-dessous :<br\/>",
        "saved": "Vos modifications ont été sauvées.<br\/><br\/><span class='lead text-danger'>En cas de problème d'accès, il vous faudra éditer le fichier .htaccess depuis votre client FTP.<\/span>"
    },
    "28_blockuseragent": {
        "title": "Bloque l'accès sur base du 'user-Agent'",
        "intro": "Chaque accès à votre site se fait au travers d'un logiciel; le plus souvent un navigateur.  Sauf exception, chaque logiciel dispose d'une signature : son nom.   Cette information est transmise à chaque connexion sur votre site; dans la variable 'user-Agent'.<br\/><br\/>Certains d'entres eux sont réputés pour être des scripts d'attaques comme p.ex. 'BOT\/1.0 (BOT for JCE)' qui essaye de pirater votre site en utilisant une faille de sécurité de l'éditeur JCE (colmatée depuis longtemps).<br\/><br\/>Cette option va vous permettre d'opérer un blocage des accès à votre site sur base du user-Agent utilisé.",
        "full": "<div class='label label-warning'>Attention, le user-Agent n'est pas une information fiable.<\/div><p>&nbsp;<\/p><p>Le user-Agent est une information initialisée par le script \/ le programme qui accède à votre site.  N'importe quel script peut donc inscrire 'Firefox' comme user-Agent; c'est cette information-là que vous verrez alors.   Toutefois, certains scripts ne font pas d'usurpation et utilisent une signature comme p.ex. 'BOT\/1.0 (BOT for JCE)' qui dit clairement ce qu'il essaie de faire; en l'occurence essayer de pirater votre site au travers de l'éditeur JCE.<\/p><p>L'option 2.8 vous permet, une fois que vous aurez identifié des agents néfastes sur votre site, de leurs interdire tout accès ultérieurs.  Ils seront immédiatement bloqués.<\/p>",
        "explain": "Veuillez introduire le nom des user-Agents que vous souhaitez bloquer ci-dessous, une ligne par nom.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Vous pouvez introduire une expression régulière (pour les tester, n'hésitez pas à utiliser ce site : <a href='http:\/\/regex101.com\/' target='_blank'>http:\/\/regex101.com\/<\/a>).<\/div>",
        "saved": "Vos modifications ont été sauvées.<br\/><br\/><span class='lead text-danger'>En cas de problème d'accès, il vous faudra éditer le fichier .htaccess depuis votre client FTP.<\/span>"
    },
    "pentest": {
        "title": "Tests d'intrusion",
        "intro": "Ce script va exécuter un grand nombre de requêtes vers votre site web afin de vérifier qu'elles sont bien stoppées par aeSecure (<em>dès lors que vous avez activé le blocage adhoc<\/em>). La colonne Résultat apparaîtra alors en <span class='status403 success'>vert<\/span> dans ce cas précis.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;&nbsp;Aucune attaque n'est menée, il s'agit juste de simulation.<br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Si vous avez activé l'envoi d'une notification par email en cas d'attaque; songez à désactiver cette option avant de lancer les tests sous peine de recevoir plusieurs emails.",
        "run": "Exécuter le test",
        "finished": "Tous les tests ont été exécutés; si le résultat est sur fond vert; aeSecure a donc bloqué l'attaque (HTTP status 403)"
    },
    "mimetype": {
        "title": "Détection du type MIME",
        "intro": "Ce script va parcourir la globalité de votre site web et, pour chaque fichier qui s'y trouve, va déterminer son type (est-ce une image, est-ce du code exécutable, etc.) <strong>non pas sur base de l'extension du fichier mais bien de son contenu<\/strong>.  L'objectif étant de repérer p.ex. les codes PHP exécutables qui se cache dans des fichiers dont l'extension serait .jpg.<br\/><br\/>Seuls les fichiers dont le contenu diffère de celui attendu seront affichés ci-dessous.<br\/><br\/><span class='label label-danger'><i class='icon-warning-sign icon-white'><\/i>&nbsp;ATTENTION:<\/span>&nbsp;Le type Mime détecté est basé sur la fonction fileinfo() de PHP.   Cette fonction 'essaie' (meilleure estimation) de déterminer le type sur base de son contenu : <strong>cette fonction n'est pas donc totalement fiable<\/strong> mais donne toutefois une excellente indication sur le type de contenu.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Vous pourriez avoir des 'faux-positifs' aussi, par précaution, éditez toujours le fichier mentionné avant de décider d'une action comme sa suppression.  N'accédez pas au fichier depuis une URL (ce qui exécuterait le code caché dans une image p.ex.) mais ouvrez-le avec un éditeur de texte.",
        "hint": "Scanne votre site web à la recherche de fichiers dont le contenu diffère de ce qui était attendu sur base de l'extension.&#10;&#10;Exemple : un fichier dont l'extension est .png mais qui contient du code PHP.",
        "danger": "L'extension du fichier n'est pas conforme à son contenu mais, surtout, ce contenu est exécutable : si ce fichier est accessible depuis une URL, il est potentiellement dangeureux.",
        "folder_hint": "Si vous souhaitez vérifier les fichiers d'un dossier précis, veuillez indiquer le nom du dossier ici.",
        "detected": "Contenu détecté",
        "seefile": "Cliquez sur cette icône pour afficher le contenu du fichier EN MODE TEXT : même si l'extension du fichier laisse à croire que c'est une image, vous verrez apparaître le code ASCII du fichier.  Si le fichier contient un virus, il ne sera pas exécuté mais son code source sera affiché."
    },
    "29_blockreferrer": {
        "title": "Bloque l'accès sur base du 'Referrer'",
        "intro": "Le referrer (référant en Français), s'il est mentionné, est le site qui a généré une requête sur le vôtre.  Par exemple, lorsque quelqu'un arrive sur votre site après avoir cherché sur Google, le referrer est 'www.google.com'.<br\/><br\/>Lorsqu'un site tiers affiche un flux RSS proposé par le vôtre, le referrer est le nom de domaine du site tiers.  En bloquant tel ou tel referrer, vous allez interdire le trafic venant de ces sites-là.",
        "full": "<div class='label label-warning'>Attention, le Referrer n'est pas une information fiable; elle peut être vide ou être manipulée.<\/div><p>&nbsp;<\/p><p>Certains sites sont des voleurs de contenu qui profitent de l'existence d'un flux RSS de votre site pour vous 'voler' du trafic si malheureusement ils sont mieux référencés que vous.<\/p><p>D'autres sites pourraient afficher des images stockées sur votre site (et vous voler de la bande passante); voir aussi l'option 8.9 Empêcher le Hotlinking.<\/p><p>D'autres sites pourraient proposer un hyperlien vers une page de votre site alors que vous nous souhaitez pas que quelqu'un puisse, au départ de ce site-là, arriver chez vous.<\/p><p>Vous pourriez encore indiquer aux moteurs de recherches que le lien proposé sur un site tiers ne doit pas arriver sur votre page car vous ne souhaitez pas être lié d'aucune sorte avec ce site-là.<\/p><p>Les exemples ne manquent pas pour souhaiter 'blacklister' un site tiers.<\/p>",
        "explain": "Veuillez introduire ci-dessous le nom de domaine à bloquer, une ligne par nom de domaine (ex <strong>www.voleurs.fr<\/strong>).",
        "saved": "Vos modifications ont été sauvées.<br\/><br\/><span class='lead text-danger'>En cas de problème d'accès, il vous faudra éditer le fichier .htaccess depuis votre client FTP.<\/span>"
    },
    "93_crontab": {
        "title": "Crontab - Exécution planifiée sur le serveur",
        "intro": "Selon votre formule d'hébergement, vous pourriez avoir la possibilité d'accéder au 'crontab' : il s'agit d'une option, côté serveur, qui vous permet d'exécuter un job p.ex. toutes les heures, une fois par jour, le 1er jour du mois, etc.<br\/><br\/>aeSecure propose aux utilisateurs Pro un script qui, p.ex., peut être exécuté toutes les heures pour détecter les fichiers qui auraient été ajoutés ou modifiés sur votre serveur. Une notification par email sera alors envoyée; ce qui vous permettra d'immédiatement agir en cas de modification n'étant pas de votre chef.",
        "full": "Le script <strong>aesecure.sh<\/strong> va, selon votre configuration:<br\/><br\/><dl><dt>1. Analyser la date de dernière modification des fichiers<\/dt><dd>Le script va analyser la date de modification (ou date de création) des fichiers sur votre serveur et faire un relevé des fichiers ayant été modifiés depuis la dernière exécution.  Ainsi, si vous exécutez le script toutes les heures, vous recevrez une notification par email avec la liste des fichiers ajoutés\/modifiés durant la dernière heure.<br\/><br\/><\/dd><dt>2. Prendre une sauvegarde de votre base de données<\/dt><dd>Une fois par jour, votre base de données sera sauvegardée et stockée dans le dossier <strong>\/pro\/crontab\/db_backups<\/strong> d'aeSecure.<br\/><br\/><\/dd><dt>3. Faire un relevé des derniers utilisateurs ajoutés dans votre base de données<\/dt><dd>Une fois par jour, aeSecure va vérifier si de nouveaux utilisateurs ont été ajoutés dans votre base de données et, si c'est le cas, vous recevrez un mail de notification qui reprendra les données de cet utilisateur avec son appartenance aux différents groupes du CMS.  Ainsi, pour Joomla!, vous verrez apparaître s'il s'agit d'un utilisateur 'enregistré', 'auteur', 'administrateur', ...<br\/><br\/><\/dd><\/dl>Veuillez cliquer sur l'onget 'Configurer' pour appliquer vos choix et prendre du chemin d'accès du script; chemin à ajouter dans votre 'crontab'.",
        "option1_title": "Relevé des fichiers modifiés \/ ajoutés récemment",
        "option2_title": "Sauvegarde de votre base de données",
        "option3_title": "Relevé des nouveaux utilisateurs",
        "explain": "Veuillez configurer le script aesecure.sh selon vos besoins en utilisant les options ci-dessous.  Une fois la configuration réalisée, connectez-vous sur le panneau de configuration de votre site (cpanel de l'hébergeur).  Suivez les consignes de l'hébergeur pour ajouter un script dans le crontab.<br\/><br\/>Le chemin d'accès du script est celui-ci : <blockquote><strong>%1<\/strong><\/blockquote>Il n'y a aucun paramètre à ajouter au script; la seule chose que vous devrez faire est de choisir la récurrence que vous désirez (p.ex. tous les jours, toutes les heures 30)",
        "actualconfig_extra": "L'information ci-dessous est stock\\u00e9e dans le fichier <strong>%s<\/strong>.<br\/><br\/>L'essentiel des données de configuration provient des options d'aeSecure, disponible dans le menu supérieur (menu Outils->Options).<br\/><br\/>Les autres données sont paramétrables depuis l'onglet &quot;Configurer&quot; ci à gauche",
        "actionstofire": "Actions à exécuter",
        "sendemail": "Envoyer des notifications par email",
        "duration": "Durée entre deux planifications de votre script",
        "duration_hint": "Veuillez faire correspondre la durée ici avec votre planification : si vous avez programmé l'exécution du script aesecure.sh toutes les huit heures dans votre crontab, veuillez sélectionner exactement la même valeur ci-dessous.",
        "one_hour": "Une heure",
        "two_hours": "Deux heures",
        "four_hours": "Quatre heures",
        "eight_hours": "Huit heures",
        "one_day": "Une journée",
        "savelogs": "Conserve une copie des fichiers de logging",
        "savelogs_hint": "Lorsque le script aesecure.sh détecte un changement apporté à des fichiers, lorsqu'il détecte des nouveaux utilisateurs inscrits dans la base de données, ..., il génère une liste dans un fichier de log qui sera ensuite envoyé par email.   En activant cette option, les fichiers de log seront conservés dans le dossier \/pro\/crontab\/logs\/.",
        "sendemail_hint": "Active l'envoi des emails pour le script aesecure.sh : si p.ex. un fichier a été modifié, aeSecure enverra une notification par email lorsque cette option est activée."
    },
    "17_blockfiles": {
        "title": "Interdiction d'accès à certains fichiers par URL",
        "intro": "Votre site web contient certains fichiers dont l'accès direct par URL doit être rendu impossible; c'est le cas p.ex. des fichiers configuration.php (Joomla!®) ou wp-config.php (WordPress).  C'est aussi le cas pour les fichiers .htaccess, readme.txt, etc.",
        "full": "Lorsqu'une personne mal intentionnée désire mettre à mal votre sécurité, il va essayer d'accéder à des fichiers tels que configuration.php ou wp-config.php pour, essayer, d'afficher le contenu de ces fichiers de configuration.   Il va aussi tenter d'afficher le fichier .htaccess ou encore des fichiers texte tels que changelog.txt, php.ini, readme.txt, etc. pour afficher leur contenu et comprendre votre site (est-il basé sur un CMS, lequel, quelle version, ... ).<br\/><br\/>Vous pourriez aussi avoir détecté un fichier suspect sur votre site tel que phpinfo.php, \/media\/bad.php, ... pour lesquels vous souhaitez rendre impossible leur utilisation par accès direct à p.ex. http:\/\/votresite\/phpinfo.php.",
        "preface": "Veuillez introduire un nom de fichier par ligne et\/ou séparé par des points virgules.<br\/>Exemple : .htaccess;configuration.php;wp-config.php pour bloquer l'accès URL à ces trois fichiers.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;L'interdiction est valable pour tous les dossiers de votre site, peu importe la localisation exacte du fichier.",
        "saved": "Vos modifications ont été sauvées.<br\/><br\/><span class='lead text-danger'>En cas de problème d'accès, il vous faudra éditer le fichier .htaccess depuis votre client FTP.<\/span>"
    },
    "94_password": {
        "title": "Générateur de mot de passe",
        "intro": "Cet outil va vous permettre de générer un mot de passe aléatoire d'une longueur variant entre 10 et 40 caractères.  Le mot de passe généré sera aléatoire et composé de majuscules, de minuscules, de chiffres et de caractères spéciaux.",
        "full": "Le choix d'un bon mot de passe est crucial dans la sécurisation de votre site web.   Les attaques de type brute-force se multiplient et les mots de passe simples sont devinés en quelques secondes voire instantanément pour des valeurs telles que 'admin', '123456', 'azerty'.. <br\/><br\/>Un petit outil en ligne comme \\\"<a href='https:\/\/howsecureismypassword.net\/' target='_blank'>How Secure Is My Password?<\/a>\\\" permet de tester la solidité de son mot de passe.<br\/><br\/>Le générateur proposé par aeSecure va suggérer un mot de passe aléatoire d'une longueur variant entre 10 et 40 caractères, le mot proposé mélangera les minuscules, les majuscules, les chiffres et les caractères spéciaux.<br\/><br\/>Un mot de passe tel que <strong>Mw$02z3plq<\/strong> mettra 96 ans à être cassé ce qui vous laissera le temps de constater l'attaque.  Préférez toutefois une longueur encore supérieure car la puissance de calcul des ordinateurs évolue sans cesse.",
        "password_length": "Longueur souhaitée du mot de passe",
        "password_generated": "Votre mot de passe"
    },
    "13_error_reporting": {
        "title": "Nascondere gli errori Apache",
        "intro": "Una volta il sito web messo in rete, devi assicurarti che l'utente non abbia modo di visualizzare errori PHP in modo da non divulgare informazioni che potrebbero indurre ad ulteriori attacchi.",
        "full": "Il server web può essere configurato in tal modo da rivelare e visualizzare errori di programmazione. Questa funzione è ideale durante lo sviluppo di un sito web perché permette allo sviluppatore di individuare eventuali bug, ma su un sito in produzione, se questa funzione è attiva potrebbe rivelarsi pericolosa, infatti qualsiasi utente avrebbe accesso a dati sensibili: il nome del database, il nome di una tabella, accedere al percorso del file incriminato …  tutte informazioni che potrebbero essere sfruttate da un utente malintenzionato.<br\/><br\/>Su un sito in produzione si consiglia di disabilitare la visualizzazione degli errori.",
        "state_enabled": "Visualizzazione proibita",
        "state_disabled": "Visualizzazione abilitata",
        "feature_enabled": "<span style='font-size:1.5em;'>Eventuali errori saranno nascosti<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Gli errori saranno visualizzati dall'utente<\/span>",
        "hint": "<span class='text-danger'>Cliccando sul pulsante \"Visualizzazione attivata\" viene richiesto al server web di visualizzare gli errori, il che può verificarsi pericoloso per un sito in produzione.<\/span>",
        "recommanded": "Visualizzazione proibita"
    },
    "14_old_htaccess": {
        "title": "Modifica manuale del tuo file .htaccess",
        "intro": "A volte può essere necessario di modificare il file .htaccess per aggiungere alcune regole supplementari, come ad esempio l'attivazione di una versione PHP, una regola di reindirizzamento, …",
        "full": "Dopo aver verificato a più riprese che la sintassi è corretta, inserisci le poche righe nel campo memo e salva le modifiche che saranno aggiunte all'inizio del file .htaccess (il file .htaccess si trova alla radice (root) del tuo sito).<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attenzione:<\/span>&nbsp;Il file .htaccess viene letto dal server web ogni volta che un indirizzo URL è eseguito sul tuo sito. Se le regole aggiunte nel file .htaccess dovessero contenere degli errori di sintassi o qualche istruzione non valida, il server web restituirà inevitabilmente un errore 500. Se hai accesso ai file log del server web, è possibile leggerne la causa. Sarà dunque necessario collegarsi al sito utilizzando un programma FTP (FileZilla ad esempio) per accedere alla radice (root) del tuo sito web e modificare le regole contenute nel file .htaccess.",
        "explain": "Qui di seguito è riportato il contenuto del file .htaccess prima dell'installazione di aeSecure. È possibile modificarne le regole esistenti o aggiungerne altre.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attenzione:<\/span>&nbsp;Se le regole aggiunte contengono errori di sintassi, il sito non sarà più accessibile e visualizzerà un errore di tipo 500. In questo caso bisognerà accedere al file .htaccess  che si trova alla radice del sito (root) tramite un client FTP (FileZilla ad esempio) e modificare o cancellare le regole aggiunte in precedenza.",
        "saved": "Le tue modifiche sono state aggiornate.<br\/><br\/><span class='lead text-danger'>In caso di problemi di accesso, sarà necessario modificare il file .htaccess a partire dal tuo client FTP (FileZilla ad esempio).<\/span>"
    },
    "19_maintenance": {
        "title": "Attiva\/Disattiva la modalità di manutenzione",
        "intro": "Questa modalità consente di reindirizzare tutti gli utenti (tranne te) che arrivano su un sito in manutenzione",
        "full": "Quando è necessario effettuare una manutenzione del sito o quando bisogna vietare l'accesso perché è stato individuato un potenziale intruso, la modalità \"manutenzione\" permette di reindirizzare l'utente verso una pagina '…sito in manutenzione…'; ciò è possibile qualunque sia l'URL utilizzato (frontend, backend, download di un file, …). Grazie a questa manovra sarà possibile analizzare il sito ed effettuare le modifiche necessarie.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attenzione:<\/span>&nbsp;Dopo aver completato le operazioni di manutenzione, torna su questa opzione per disabilitare la modalità di manutenzione e ripristina l'accesso a tutti gli utenti.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Avviso:<\/span>&nbsp;Questa funzione è diversa da quella predefinita nel CMS (Joomla® ad esempio) in quanto l'attivazione della modalità \"manutenzione\" vieta l'accesso all'intero sito e non solo alle pagine pubblicate a partire dal CMS.",
        "pagetitle": "Il sito \"%s\" è attualmente in fase di manutenzione",
        "comeback": "Grazie per tornare a trovarci tra qualche ora...",
        "contact": "<a href=\"mailto:%s?subject=Site %s en maintenance\">Contattaci<\/a>",
        "confirm": "Sei sicuro? Nessun'altra connessione sarà possibile, eccetto la tua (basata sul tuo indirizzo IP).",
        "hint": "<span class='text-danger'>Attivando la modalità manutenzione, nessun altro utente, eccetto te, avrà la possibilità di accedere al tuo sito web, <br\/><br\/><span style='font-weight:bold;'>tutte le connessioni saranno deviate verso una pagina di avviso prevista a questo scopo, indicando all'utente che il sito è in manutenzione. <\/span><\/span>",
        "recommanded": "Disattivato"
    },
    "22_protectPassword": {
        "title": "Protezione tramite password",
        "intro": "Colloca un file .htpasswd In una directory per limitare l'accesso solo ai detentori di un login\/password.<br\/><br\/><span class='label label-primary'><i class='icon-primary-sign icon-white'><\/i>&nbsp;Suggerimento:<\/span>&nbsp;Idealmente si dovrebbe proteggere almeno la cartella admin. Se la cartella di salvaguardia (backups) si trova nella struttura del sito web (per es. \/salvaguardie) pensa a proteggere pure questa.",
        "full": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attenzione:<\/span>&nbsp;La protezione viene effettuata tramite la creazione di un file .htpasswd che richiede all'utente di inserire un log\/pass prima di poter accedere ad una cartella specifica.<br\/>Soluzione ideale per proteggere la cartella admin di Joomla®, attenzione però perché può causare disfunzioni con alcuni componenti.",
        "restrict": "Protezione di una cartella con log\/password",
        "done": "Utente <span class='text-success' style='font-weight:bold;'>%s<\/span> creato. Si prega di utilizzare la password <span class='text-success' style='font-weight:bold;'>%s<\/span> per connettersi alla cartella <span class='text-success' style='font-weight:bold;'>%s<\/span>.",
        "testit": "Clicca qui per verificare la tua protezione: <a href='%s' target='_blank'>%s<\/a>",
        "keepit": "<h5><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attenzione:<\/span>&nbsp;si prega di conservare queste informazioni al sicuro.<\/h5>",
        "error": "Errore durante la creazione del file .htpasswd, cartella non protetta"
    },
    "23_blockbots": {
        "title": "Limita i robots e lo spam",
        "intro": "Blocca l'accesso del tuo sito web ai robot la cui firma è nota come dannosa e cioè vieta l'accesso ai programmi capaci di effettuare una copia del tuo sito (chiamati anche \"aspirapolveri di siti web\"). Blocca inoltre alcune parole chiavi su base di liste nere. ",
        "full": "Quando un programma, come ad esempio un navigatore web accede al tuo sito web, esso s'identifica tramite una firma che viene chiamata \"user_agent\". Allo stesso modo i virus <a href='http:\/\/perishablepress.com\/ultimate-htaccess-blacklist\/' title='Ultimate htaccess Blacklist | Perishable Press' target='_blank'>vengono identificati e riconosciuti<\/a> dalla loro firma come \"cattivi visitatori\" (\"bad bot\"); possono essere definiti come software utilizzati da pirati informatici, spammer … \nSe è vero che è abbastanza facile falsificare questo tipo d'informazione, gli intrusi di cui il \"user_agent\" è un \"bad_bot\" non devono in alcun motivo ritrovarsi sul tuo sito. <br\/><br\/>Attivando la protezione, si bloccherà così un gran numero di questi bad bot. ",
        "hint": "<span class='text-success'>Attivando questa sicurezza i robot non avranno più accesso al tuo sito web.<br\/><br\/><span style='font-weight:bold;' class='text-success'>Consigliato<\/span><\/span>",
        "recommanded": "Attivato"
    },
    "24_blockfileupload": {
        "title": "Blocca l'upload dei file",
        "intro": "L'hacking di un sito avviene spesso con l'invio di programmi pericolosi.  Bloccandone l'invio sul tuo server sarai protetto contro questo tipo di attacco. <strong>Leggi le spiegazioni dettagliate prima di attivare la protezione<\/strong>",
        "full": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attenzione:<\/span>&nbsp;Vietando l'upload, bloccherai qualsiasi tipo di aggiornamento: un utente che vuole caricare un avatar, l'aggiornamento di un componente, gli aggiornamenti di un CMS (Joomla ® o altri), ecc. Infatti, questi aggiornamenti necessitano di scaricare il file che permetterà in seguito di effettuare questo tipo di operazione.<br\/><br\/>Tuttavia è possibile attivare l'upload solo per alcune fasi di manutenzione.",
        "confirm": "Sei sicuro? Non sarà più possibile aggiornare il CMS se non riattivando l'upload.",
        "hint": "<span class='text-danger'>Vietando l'upload, non sarà più possibile aggiornare il CMS e le estensioni; gli utenti non avranno più la possibilità di caricare un avatar.<br\/><br\/><span style='font-weight:bold;'>Devi essere sicuro della tua manovra...<\/span><\/span>",
        "recommanded": "Se non sei sicuro di quello che fai, lascia disattivato."
    },
    "25_noarchive": {
        "title": "Blocca l'indicizzazione di alcuni file.",
        "intro": "Vieta l'accesso ai motori di ricerca verso file di tipo zip e MS Office che si trovano sul tuo sito web.",
        "full": "Vietando ai motori di ricerca di fornire dei link diretti verso i file del tuo sito, obblighi in qualche modo l'utente a visitare le pagine del tuo sito. In termini di sicurezza c'è un fatto ancora più importante, garantisci che nessun altro file inizialmente accessibile sarà disponibile dopo una ricerca effettuata con un motore di ricerca, sembra ovvio eppure Google propone molti risultati contenenti risultati di questo tipo.",
        "hint": "Richiede ai motori di ricerca di non indicizzare file di tipo zip e MS Office (accdb, doc, docx, mdb, ppt, pptx, xls, xlsx, zip).<br\/><br\/><span style='font-weight:bold;' class='text-success'>Consigliato<\/span>",
        "recommanded": "Attivato"
    },
    "26_blockhiddenfolders": {
        "title": "Blocca l'accesso ai file e cartelle nascoste",
        "intro": "I file e cartelle avendo come caratteristica un punto prima del nome risultano dei file \/ cartelle nascoste. In alcuni siti cartelle tali .backups, .git, .svn, … possono essere presenti  ed essere accessibili (di default) da un indirizzo URL.",
        "full": "I file e cartelle che si trovano sul tuo sito Apache e il cui nome inizia con un punto sono considerati come elementi nascosti, può dunque capitare che in alcune mascherate questi file non siano visibili. Apache non blocca l'accesso tramite indirizzo URL, si potrebbe dunque raggiungere facilmente un indirizzo di questo tipo http:\/\/votresite\/.backups\/monbackup. Se ti sei dato la pena di non rendere visibile una cartella, si presuppone che sia al fine di non renderla accessibile tramite un indirizzo URL<br\/><br\/>L'obiettivo di questa protezione è di vietare tale accesso, eccetto per il file .htaccess che aeSecure blocca in modo sistematico; puoi scegliere di bloccare l'accesso (consigliato) o al contrario di autorizzarlo a chiunque conosca l'indirizzo URL.",
        "hint": "Vieta l'accesso ai file e cartelle nascoste e cioè a quelli che iniziano con un punto (.)<br\/><br\/><span style='font-weight:bold;' class='text-success'>Consigliato<\/span>",
        "recommanded": "Attivato"
    },
    "41_joomlaversion": {
        "title": "Controllo della versione di Joomla®",
        "intro": "Finché si rimane all'ultima versione maggiore della versione in uso (1.5.x, 2.5.x, 3.x), non vi è <span style='font-weight:bold;'>alcun<\/span> motivo per non aggiornare Joomla!®",
        "full": "Quando una nuova versione di Joomla!® è messa a disposizione dalla comunità, non è soltanto perché nuove funzionalità sono state sviluppate, ma anche perché nuove falle di sicurezza sono state scoperte e corrette dal team di sviluppatori di Joomla!® È dunque essenziale tenere sempre aggiornato l'ultima versione del CMS.<br\/><br\/>Tuttavia se si dispone di un sito Joomla! rimasto in una versione 1.5 e si desidera installare una versione più recente, 2.5 o 3.x, si tratta allora di un aggiornamento maggiore. In questo caso è importante pianificare l'aggiornamento e farlo quando si ha tempo, in quanto potrebbe richiedere diverse ore a diversi giorni di lavoro, tutto dipenderà dalla complessità del sito e dalle estensione utilizzate.",
        "current": "La versione attuale del tuo CMS Joomla!® : %s",
        "updated": "Ultima version di Joomla!® : %s",
        "youvethelast": "Complimenti, hai l'ultima versione di Joomla!® (%s)",
        "url_package": "URL del pacchetto di aggiornamento : %s",
        "unknown": "Spiacente, non è stato possibile determinare l'ultima versione di Joomla!®"
    },
    "42_blockcomusers": {
        "title": "Bloccare le iscrizioni native di Joomla!®",
        "intro": "Alcuni script maligni mirano i siti Joomla tramite un indirizzo URL pubblico che permette loro di creare utenti \"fantasma\" in massa. Se vuoi proibire la creazione di nuovi conti utenti e\/o se utilizzi un componente di tipo Community Builder o JomSocial, disattiva il componente nativo com_user",
        "full": "Anche in assenza di un link da menù e\/o di un modulo di connessione Joomla, è semplice creare un conto utente tramite l'indirizzo <strong>index.php?option=com_users&view=registration<\/strong>, il quale permette, grazie a degli script, di creare conti in modo automatizzato. Questi utenti, chiamati anche utenti 'fantasma', diventeranno presto gli spam del tuo sito e inizieranno ad invadere il tuo forum, i tuoi spazi di commenti, …<br\/><br\/>Inoltre, se consenti agli utenti di caricare un avatar c'è rischio che l'immagine sia contaminata da codice maligno o addirittura che un'immagine poco gradevole sia pubblicata.<br\/><br\/>Bloccando la gestione nativa degli utenti Joomla (com_users), andrai a bloccare questo tipo di script.<br\/><br\/>Se utilizzi Community Builder è possibile anche bloccare com_user e consentire la registrazione tramite CB. Per effettuare questo tipo di operazione recati nella configurazione globale per la gestione degli utenti e disattiva la registrazione utente, poi vai nelle impostazioni generali di CB e attiva la registrazione utente <strong>indipendentemente<\/strong> da quella del sito.",
        "test": "Clicca qui per visualizzare in un tab la pagina che ti permette di creare un conto utente:<a href='%HTTP_HOST%\/index.php?option=com_users&view=registration' title='Afficher la page de création d'un utilisateur grâce au composant natif de Joomla!®' target='_blank'>Crea un nuovo utente<\/a><br\/><br\/>Se la protezione non è stata ancora attivata, vedrete apparire una pagina per creare un conto utente. Se il tuo sito Joomla! è configurato per accettare automaticamente le registrazioni, uno script potrà creare utenti fantasma ininterrottamente.<br\/><br\/>Una volta attivata la protezione aeSecure non sarà più possibile visualizzare la pagina per creare i conti utenti.",
        "hint": "<span class='text-danger'>Blocca le iscrizioni tramite il componente com_users, questo riduce notevolmente il rischio di spam. Se vuoi consentire l'iscrizione al tuo sito, non attivare questa opzione.\n.<br\/><br\/><span style='font-weight:bold;'>Devi essere sicuro di quello che fai...<\/span><\/span>",
        "recommanded": "A meno di sapere esattamente quello che stai facendo, disattiva"
    },
    "43_protectadmin": {
        "title": "Protegge i file dell'amministrazione Joomla!®",
        "intro": "Blocca l'accesso diretto (via indirizzo URL) ai file della cartella \/administrator. Alcuni file, ad esempio i file di tipo XML, possono rivelare molte informazioni ad una persona malintenzionata (ad esempio la versione esatta di Joomla!®)<br\/><br\/>L'accesso ai file multimediali (css, js, png ...) resta possibile.",
        "full": "Senza protezione, i file della tua cartella \/administrator sono accessibili via un URL. È possibile accedere ai file .ini (lingua), .xml (manifest), .txt, … che sono situati nella cartella di amministrazione semplicemente digitando l'indirizzo completo del file.<br\/><br\/>La situazione si complica quando questi file rivelano informazioni sul tuo sito, come ad esempio la versione esatta di Joomla (es. 2.5.16). Questi file devono essere bloccati dal tuo server web.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Nota:<\/span>&nbsp;Superfluo se hai protetto l'accesso all'amministrazione tramite una password o limitandone l'accesso via un indirizzo IP.",
        "test": "Cliquez ci-après pour afficher, dans un nouvel onglet, le manifeste de votre site Joomla : <a href='%HTTP_HOST%\/administrator\/manifests\/files\/joomla.xml' title='Afficher le manifeste de votre site Joomla!®' target='_blank'>Afficher le manifeste de votre site Joomla!®<\/a>.<br\/><br\/>Si la protection n'est pas encore active, vous verrez apparaître le manifeste d'installation de Joomla!® : vous verrez le numéro de version exact.<br\/><br\/>Les fichiers manifestes de vos composants sont pareillement adressables.  Un pirate pourrait donc tester si vous avez tel composant et telle version.",
        "recommanded": "Attivato"
    },
    "44_blockcomp": {
        "title": "Blocca l'accesso ad alcuni componenti Joomla!®",
        "intro": "Nel file log del server Apache (non quello di Joomla!®), si possono trovare un gran numero di righe che fanno riferimento a URL di tipo index.php?option=com_xxxxx allorché com_xxxxx non è mai stato installato sul tuo sito. Si tratta di un tentativo di hacking: probabilmente com_xxxxx è un componente Joomla!® per il quale una falla di sicurezza è conosciuta ed alcuni hackers sono in agguato pronti a scansionare il web alla ricerca di siti potenzialmente vulnerabili.<br\/><br\/>Utilizza questa opzione per bloccare questi URL.",
        "full": "Dai un'occhiata nel componente di reindirizzamento (amministrazione Joomla -> Componenti -> Redirect) oppure nel file .log di Joomla!® e analizza le richieste che sono fallite. Se trovi un gran numero di URL di tipo ?option=com_xxxxx e che questo componente non è installato sul sito (e non lo sarà) è bene bloccarlo al fine di proteggere il tuo sito da una potenziale falla di sicurezza.<br\/><br\/>Utilizza il formulario e specifica il nome del componente (com_xxxxx). aeSecure bloccherà tutti gli URL in cui questo nome apparirà.",
        "test": "Osserva quello che fa Joomla!® quando si accede a com_xxxxx : <a href='%HTTP_HOST%\/index.php?option=com_xxxxx&' target='_blank'>%HTTP_HOST%\/index.php?option=com_xxxxx&<\/a>.<br\/><br\/>Se visualizzi una pagina 404 è buon segno, ma dimostra che la richiesta è stata ricevuta da Joomla!®. Essendo un tipo di richiesta che viene effettuata decine\/centinaia di volte sul sito, sarebbe stato più opportuno visualizzare una pagina di divieto d'accesso.",
        "explain": "Indica qui di seguito i nomi dei componenti che desideri bloccare. Inizia sempre con 'com_' seguito dal nome del componente (ad esempio 'com_prettyform').<br\/><br\/>Per specificarne più di uno, basta separarli con un punto e virgola (com_prettyform;com_survey;com_whatever).",
        "blocked": "I componenti %s saranno bloccati."
    },
    "49_showredirect": {
        "title": "Visualizza il contenuto dei reindirizzamenti Joomla!®",
        "intro": "Dalla versione 1.7, Joomla!® salva nel componente redirect (reindirizzamento) gli indirizzi URL che non sono arrivati a buon fine, ad esempio quando l'URL fa riferimento ad un componente che non è installato. Dai un'occhiata a questa tabella, potrebbe eventualmente elencare una lista di URL utilizzati da hacker per accedere al tuo sito.",
        "full": "Gli hacker utilizzano degli script capaci di scansionare la rete del web. Il loro scopo è accedere a degli indirizzi URL con falle di sicurezza. Potresti quindi vedere un gran numero di accessi verso degli URL del tipo %HTTP_HOST%\/index.php?option=com_xxxx dove com_xxxx corrisponde ad un componente che non è mai stato installato sul tuo sito.<br\/><br\/>Presupponendo cha falle di sicurezza siano state individuate per questo componente, l'obiettivo degli hacker è di scovare siti dove tale componente è installato al fine di poterne sfruttare la falla.<br\/><br\/>Dai regolarmente un'occhiata all'elenco degli indirizzi URL del componente redirect (reindirizzamento) in modo da proteggere al meglio il tuo sito.",
        "column_oldurl": "URL utilizzato, non riconosciuto da Joomla! ® (pagina 404). &#10;&#10;Analizza l'URL per vedere se per esempio è un indirizzo di tipo maligno; se si riferisce a un componente che non è mai stato installato, guarda i parametri. &#10;&#10;Si tratta di un ottimo metodo per vedere come il tuo sito si comporta quando è sotto attaco da parte di hacker.",
        "column_hits": "Numero di volte che Joomla! ® ha riscontrato questo URL.&#10;&#10;Se il numero di riscontri è elevato e l'URL è valido, sarebbe opportuno reindirizzare l'URL o bloccarlo via il file .htaccess; ad esempio bloccando il componente se quest'ultimo non è installato sul sito.",
        "truncatetable": "Svuota l'intera tabella; cancella tutti i record in una volta",
        "truncatetable_confirm": "Stai per eliminare tutti i record della tabella, confermi che è quello che vuoi fare?",
        "tablenotfound": "Spiacente ma il componente di reindirizzamento (redirect) non è presente nella tua versione Joomla!®.",
        "deleterows": "Elimina le righe spuntate (checked) nel database di Joomla!®.",
        "delete_confirm": "Vuoi eliminare i record spuntati (checked) e relativi al componente di reindirizzamento (redirect) di Joomla®! ?",
        "deleted": "ID=%s cancellato",
        "error_deleted": "Errore durante l'eliminazione dell'ID=%s",
        "onlyfirstrows": "Schermata limitata ai %s primi dati, classificati per ordine decrescente sulla colonna 'hits'. Sono quindi gli URL con maggiore frequenza che vengono visualizzati in questa schermata.",
        "tryit": "Apri questo URL in un nuovo tab",
        "norecords": "La tabella di reindirizzamento è al momento vuota"
    },
    "71_seo_rewrite": {
        "title": "Riscrittura (rewriting) degli URL",
        "intro": "I siti web dinamici utilizzano degli URL con molti parametri, è il caso di Joomla!® che utilizza un URL di questo tipo index.php?option=com_users&amp;view=registration.  Questi URL sono poco intuitivi per i motori di ricerca e non consentono di definire quello per cui la pagina è stata creata, contrariamente ad una pagina con un URL di tipo \/inscriptions.html che sarà più facilmente reperibile dai motori di ricerca.",
        "full": "Attivando la riscrittura degli indirizzi, viene applicata la funzione di routing del CMS. In tal modo la stringa di caratteri 'index.php' seguita dai vari parametri, non sarà più visibile e sarà sostituita dall'alias che avrai dichiarato per la pagina. L'arborescenza dell'URL farà riferimento all'alias dei vari menu di navigazione seguito dall'alias della pagina, avrai così un URL pulito ed esplicito per i motori di ricerca.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Nota:<\/span>&nbsp;La riscrittura dell'URL dipende dal CMS utilizzato e dal componente installato; sono loro che gestiscono la riscrittura dell'URL..",
        "test": "Se il tuo sito è dinamico (Joomla!®, Drupal, Wordpress, ...), osserva gli URL durante la navigazione. Attiva la riscrittura e naviga di nuovo sul sito; ti accorgerai che gli URL sono ormai 'puliti' ed 'espliciti'",
        "feature_enabled": "<span style='font-size:1.5em;'>Riscrittura (rewriting) attivata<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Riscrittura (rewriting) disattivata<\/span>",
        "hint": "<span class='text-success'>Attiva la riscrittura (rewriting) degli URL<br\/><br\/><span style='font-weight:bold;' class='text-success'>Consigliato<\/span>",
        "recommanded": "Attivato"
    },
    "81_pagespeed": {
        "title": "Sfruttare il modulo mod_pagespeed",
        "intro": "Il mod_pagespeed è un modulo Apache che può essere attivato dal tuo hosting e nel caso fosse possibile il tuo sito potrà essere ottimizzato grazie a questo modulo",
        "full": "<a href='https:\/\/developers.google.com\/speed\/pagespeed\/module' title='PageSpeed module by Google'>mod_pagespeed<\/a> è un modulo sviluppato da Google e che punta a ridurre il peso della tua pagina web: rimuovendo i commenti HTML, comprimendo le immagini, minificando il codice HTML, …\n<br\/><br\/>L'attivazione del modulo mod_pagespeed dipende dal contratto che hai con il tuo hosting. È quindi possibile che non sia attivato sul tuo conto e in questo caso l'ottimizzazione proposta da asSecure non sarà presa in considerazione.",
        "test": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attenzione:<\/span>&nbsp;È necessario che il tuo hosting abbia attivato il modulo Apache Google pagespeed e che il tuo abbonamento comprenda questa funzionalità.<br\/><br\/>Al fine di verificare la differenza di velocità, è necessario che il tuo sito sia online e che un test di velocità sia effettuato con un tool come ad esempio <a href='http:\/\/gtmetrix.com\/' target='_blank' title='GTMetrix | Website Speed and Performance Optimization'>GTMetrix<\/a>.  Procedi ad un primo test con l'ottimizzazione disattivata, poi ripeti il test con l'ottimizzazione attivata, potrai accorgerti di un notevole miglioramento.",
        "feature_enabled": "<span style='font-size:1.5em;'>Ottimizzazione attivata<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Ottimizzazione disattivata<\/span>",
        "hint": "<span class='text-success'>Attiva l'ottimizzazione del tuo sito grazie a mod_pagespeed (<span style='font-weight:bold;'>richiede che il tuo hosting abbia attivato questo modulo sul tuo conto, nel caso contrario  l'ottimizzazione non sarà presa in conto.<\/span>).<br\/><br\/><span style='font-weight:bold;' class='text-success'>Consigliato<\/span><\/span>",
        "recommanded": "Attivato"
    },
    "83_expire": {
        "title": "Specifica la durata di vita dei file statici.",
        "intro": "I file statici, come ad esempio i file JavaScript, css, immagini, web font, … sono per impostazione predefinita (default) scaricati ogni volta che una pagina è visualizzata dal medesimo utente. Specificare la durata di vita permette al navigatore di non scaricare nuovamente questi file.",
        "full": "Definendo una durata di vita per un file statico, il navigatore non andrà più a scaricare dal server lo stesso file, essendo quest'ultimo già presente nella cache. Quando l'utente tornerà a navigare sul tuo sito un gran numero di file saranno già presenti nella cache del navigatore e saranno dunque trattati localmente. Questo avrà un impatto immediato sulla velocità di navigazione del tuo sito.",
        "test": "Per verificare la differenza di velocità, è necessario che il tuo sito sia online. Prova a fare un test con questo utensile <a href='http:\/\/gtmetrix.com\/' target='_blank' title='GTMetrix | Website Speed and Performance Optimization'>GTMetrix<\/a>. Fai un primo test con l'ottimizzazione disattivata e un secondo test con l'ottimizzazione attivata; dovresti notare una notevole differenza.\n",
        "feature_enabled": "<span style='font-size:1.5em;'>Ottimizzazione attivata<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Ottimizzazione disattivata<\/span>",
        "hint": "<span class='text-success'>Indica al navigatore dell'utente una durata di vita lunga per i file statici di tipo css, javascript, immagini,  ...<br\/><br\/><span style='font-weight:bold;' class='text-success'>Consigliato<\/span><\/span>",
        "recommanded": "Attivato per un sito in produzione, disattivato per un sito in fase di test o di sviluppo."
    },
    "89_hotlinking": {
        "title": "Impedire l'hotlinking",
        "intro": "Proibisce ad altri utenti di utilizzare la tua larghezza di banda al fine di riferire le tue immagine sul loro sito.",
        "full": "I siti web che utilizzano immagini di tua proprietà (immagini registrate sul tuo server), vengono chiamati \"siti parassiti\". Se una richiesta da terze parti al fine di visualizzare una tua immagine viene effettuata, è la tua larghezza di banda che viene sollecitata, è quindi il tuo server che dovrà fornire l'immagine al richiedente.<br\/><br\/>Autorizzando la visualizzazione esclusivamente dal tuo nome di dominio e\/o soltanto da alcuni siti affidabili (come ad esempio Google, Facebook, Yahoo, Bing, …), riduci questo tipo di intrusione e conservi le risorse del tuo server.",
        "feature_enabled": "<span style='font-size:1.5em;'>Ottimizzazione attivata<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Ottimizzazione disattivata<\/span>",
        "hint": "<span class='text-success'>Rifiuta la visualizzazione di un'immagine del tuo sito se viene richiesta da un altro nome di dominio che non sia il tuo<br\/><br\/><span style='font-weight:bold;' class='text-success'>Consigliato<\/span><\/span>",
        "recommanded": "Attivato"
    },
    "install": {
        "install_done": "<strong>Installazione di  aeSecure %s riuscita.<\/strong>",
        "key": "Per garantire l'accesso a questa schermata di configurazione solo alle persone autorizzate, è richiesta una chiave di accesso da specificare nell'URL. Quando vuoi accedere a questa pagina, utilizza il seguente URL :",
        "key_change": "Se vuoi modificare questa chiave, recati nella schermata Utensili -> Opzioni.",
        "postinstall": "<div class='text-primary'><strong>Nota :<\/strong>&nbsp;Per sicurezza, i file d'installazione di aeSecure sono stati automaticamente eliminati.<\/div>",
        "disclaimer": "<span id='disclaimer'>Prima di utilizzare aeSecure effettua un test su una copia del tuo sito, <span style='text-decoration:underline;'>non farlo mai su un sito in produzione<\/span>.  L'attivazione di una protezione o la disattivazione di una funzionalità (per esempio vietare gli upload) può causare la disfunzione del tuo sito.\nProteggere un sito web è un'operazione necessaria ma difficile, è dunque necessario effettuare vari test affinché il tuo sito rimanga sempre funzionale.<\/span>",
        "disclaimer_checkbox": "aeSecure non potrà essere ritenuto responsabile per eventuali disfunzioni.",
        "disclaimer_limitation": "La protezione di aeSecure mira a chiudere il maggior numero di porte attraverso le quali un hacker potrebbe entrare. Se il tuo sito è già infettato da un malware, procedi ad una pulizia prima di installare aeSecure.",
        "disclaimer_limitation_checkbox": "Capisco che aeSecure incrementa la protezione del mio sito, ma non può garantire una totale sicurezza (come qualsiasi altro programma di sicurezza)",
        "pleaseaccept": "Per completare l'installazione di aeSecure spilla le seguenti caselle",
        "finish": "Termina l'installazione"
    },
    "accessdenied": {
        "banned": "Votre adresse IP a été bannie du site",
        "contactwebmaster": "Si vous pensez que c'est une erreur, merci de contacter le gestionnaire du site pour qu'il adapte le niveau de sécurité",
        "emailsent": "Un email a été envoyé au gestionnaire du site",
        "pagetitle": "Accès refusé",
        "mailwebmaster": "Si vous êtes le webmaster de ce site, cliquez <a href='sendkey.php'>ici<\/a> pour recevoir par email la clef de votre site",
        "reminderkey_title": "Rappel de la clef de votre site",
        "reminderkey_info": "Quelqu'un a tenté récemment de se connecter sur votre interface de gestion de aeSecure avec une mauvaise clef, probablement est-ce vous (adresse IP : %s).  Veuillez trouver ci-après le lien mentionnant la clef, n'oubliez-pas de mettre ce lien en favoris. ",
        "reminderkey_secret": "Pour rappel, conservez ce lien à l'abri des regards indiscrets.",
        "title": "Accès refusé."
    },
    "documentation": {
        "title": "Documentation",
        "hint": "Accédez à la documentation en ligne de aeSecure"
    },
    "forum": {
        "title": "Forum",
        "hint": "Forum de discussion de aeSecure"
    },
    "mail": {
        "illegitimate": "Quelqu'un a tenté d'accéder à votre site '%s' depuis une URL non légitime",
        "url": "URL accédée",
        "attack": "Type de l'attaque",
        "title": "Votre attention est requise sur votre site %s",
        "ipaddress": "Adresse IP",
        "showlog": "Afficher le logfile",
        "banip": "Bannir l'IP",
        "showvar": "Voir les variables",
        "technicalinfos": "Informations techniques"
    },
    "getlog": {
        "menu": "Log des accès refusés par aeSecure",
        "menu_hint": "Le fichier de log est celui qui contient une ligne par 'attaque' càd par URL ayant été bloquée par aeSecure.",
        "empty": "Votre fichier de log est actuellement vide",
        "emptymore": "Il semble que pour l'instant aucune tentative d'accès illégitime n'ait été rencontrée et capturée par aeSecure."
    },
    "ban": {
        "title": "L'adresse %s a été bannie et ne pourra plus accéder à votre .",
        "htaccess": "Le fichier .htaccess de votre site %s a été adapté et une règle a été ajoutée afin de bloquer l'adresse IP %s.  Elle figure désormais dans la liste noire."
    },
    "jQuery-messages": {
        "required": "Ce champ est requis.",
        "email": "Veuillez saisir une adresse mail valide.",
        "url": "Veuillez saisir une URL valide.",
        "alphabetic": "Veuillez ne saisir que des lettres.",
        "alphanumeric": "Veuillez fournir seulement des lettres, nombres, espaces et soulignages",
        "number": "Veuillez saisir un nombre.(ex.: 12,-12.5,-1.3e-2)",
        "integer": "Veuillez saisir un nombre sans décimales.",
        "minlength": "Veuillez saisir au moins {0} caractères.",
        "maxlength": "Veuillez ne pas saisir plus de {0} caractères.",
        "ipv4": "Veuillez saisir une adresse IP valide (version 4)."
    }
}