{
    "main": {
        "about": "A propósito",
        "aeSecureRelease": "Clique aqui para ver informações sobre a versão",
        "filecreated": "O arquivo %s foi criado",
        "downloadfile": "Baixar esta  pasta\/arquivo",
        "pleasewaitcanbelong": "Isso pode levar um certo tempo. Obrigado: não fechar esta janela e esperar. Clique esta notificação para fazê-lo desaparecer.",
        "filesandfolders": "Ficheiros e Pastas",
        "search": "Pesquizar",
        "database": "Banco de dados",
        "execute": "Realizar",
        "downloadandkill": "<h3> O arquivo foi baixado e foi imediatamente removido do seu servidor web.<\/h3> Portanto, já não é acessível a partir de uma url.",
        "file": "Pasta",
        "pro": "Este recurso está reservado para usuários profissionais",
        "session_killed": "Sua sessão foi removido, você pode fechar esta janela com segurança.",
        "logout": "Sair",
        "helpreadonline": "Verificar o site para saber mais aeSecure",
        "restorefromconfig": "Restaurar",
        "restorefromconfig_hint": "Se você já definio essa opção antes, obter suas últimas configurações clicando neste botão",
        "restoreconfirm": "Você realmente deseja substituir o conteúdo atual para a versão anterior ter sido salvo?",
        "icon_warning": "Um problema de configuração foi encontrado em seu site, por favor, clique neste botão para exibir a lista de problemas a serem resolvidos rapidamente.",
        "loadfromaesecure": "Carregar de aeSecure",
        "loadfromaesecure_hint": "Clique nesse botão para obter uma lista de valores a partir do site de aeSecure. Esta lista contém os valores já identificados pelo desenvolvedor aeSecure que lhe permite definir rapidamente a opção acima.",
        "add": "Adicionar",
        "add_hint": "Clique nesse botão para exibir um formulário simplifica a adição de um novo valor",
        "confirm_save": "\":\"<strong>Se você cometer um erro de sintaxe, o site irá estar imediatamente inacessível (erro 500) após o backup.<\/strong><br\/><br\/>Antes de clicar em OK, verifique se você tem acesso ao seu FTP ou um painel de controle no caso de necessidade de intervir manualmente no arquivo htaccess.",
        "invalidregex": "A expressão regular (regex) digitado, parece estar incorreto. Obrigado por tomar o tempo para verificar a validade da sua codificação.",
        "edithtaccessandsearchfor": "Edite manualmente o arquivo htaccess localizado na raiz do seu site e procure as linhas entre as duas marcas%ACTION_TAG_START% et %ACTION_TAG_END%.  Excluir as linhas entre estes marcadores (não incluído). Salve o arquivo e atualize sua página web. Seu site estará acessível novamente.",
        "select_all": "Selecionar tudo",
        "unselect_all": "Cancelar tudo",
        "toggle": "Intervertir",
        "result": "Rssultado",
        "fileext": "Extensão",
        "advancedoptions": "Opções avançadas",
        "newer_version_htaccess": "<strong>Por favor, atualize seu htaccess<\/strong><br\/>\nA versão do seu htaccess não corresponde à versão mais recente aeSecure proposta. Para ativar a versão mais recente, por favor, desative 1.1 para reativar imediatamente depois; ao fazer isso aeSecure usar a nova programação.",
        "chapter4popuptitle": "Dependendo se o seu site é baseado em um CMS ou não, a lista de opções abaixo estará vazia ou não.<br\/><br\/>Da mesma forma, as opções para um CMS específico (p.ex. Joomla!®) apenas será exibido se o site está sendo executado no CMS em questão.",
        "chapter8popuptitle": "O objetivo desses recursos é fazer com que a exibição de seu site mais rápido.<br\/><br\/>\nEstas funções só estão disponíveis para Premium  aeSecure.",
        "chapter5popuptitle": "Se o seu website não usa um banco de dados e\/ou os dados de conexões não estão completados na tela de Ferramentas-> Opções, na lista abaixo estará vazia.",
        "configure": "Configurar",
        "hiddenindemo": "O modo de demonstração está ativado, esta informação não está disponível por razões de confidencialidade",
        "actual_config": "Configuração atual",
        "actualconfig_intro": "Sua configuração atual é mostrada abaixo, é para os efeitos desta análise. Esta informação é importante e confidencial, não transmitem aos outros.",
        "actualconfig": "Configuração atual",
        "advanced_parameters": "Configurações avançadas",
        "incorrect_token": "A execução desta ação requer a presença da sua \"token de segurança\" , ou  tenha sido omitido ou está incorreto.",
        "advancedoptionsarehidden": "A funcionalidade funções avançadas não é exibida abaixo. Para vê-los, por favor, vá para a tela Ferramentas-> Opções e altere a configuração \"Mostrar funções avançadas '",
        "chapter1popuptitle": "As funções 1.1 et 1.2 <strong style='color:red;'>deve ser activada<\/strong>.  Sem isso, sua instalação é aeSecure incompleto.",
        "chapter2popuptitle": "Se possível, <strong style='color:green;'>opção 2.1 ou superior, 2.2, para proteger o acesso a uma pasta, selecione<\/strong> como por ex. o sua pasta de administração ou um que contém aeSecure.",
        "chapter3popuptitle": "Gerenciamento de arquivos e pastas: Evite 'chmods \"777\".",
        "chapter7popuptitle": "Gerenciando URLs (reescrevendo, SEO, redirecionar, ...).",
        "chapter9popuptitle": "Várias funcionalidades.",
        "versionfreehiddenpaidoptions": "Você usa a versão gratuita, funcionalidades avançadas estão ausentes.",
        "versionpremiumhiddenpaidoptions": "Você usa a versão Premium, <strong style='text-decoration:underline;'>Obrigado!<\/strong>  Precisa de mais? Ir para o Pro.",
        "reset_snippetdone": "O código associado a esse  opção foi atualizado, mas<strong>não implementado<\/strong> : Se você quiser usar, você deve (re) ativar. Se ele já estava ativo, por favor clique no botão para desativar e ativá-lo novamente.",
        "unprotect": "Remova a proteção",
        "unprotected": "Proteção foi levantada",
        "app_title": "aeSecure - Protecção do seu site web ",
        "aeSecureGetIt": "<a href='%s' title='%s'>Comprar aeSecure<\/a>",
        "aeSecurePageTitle": "aeSecure - Proctecção do site web com o  .htaccess",
        "actions_base": "Segurança básico \/ obrigatório",
        "actions_other": "Segurança adicional",
        "actions_optimisation": "Optimizar o seu site",
        "actions_seo": "SEO  (referenciamento)",
        "actions_misc": "Diversos",
        "attention": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Atenção:<\/span>&nbsp;",
        "config": "Configuração de aeSecure para o site <span style='font-weight:bold;'>%s<\/span> (%s)",
        "contact": "Contactos",
        "continue": "Continuar...",
        "success": "Sucesso",
        "failure": "Falha",
        "cancel": "Anular",
        "demo": "O modo de demonstração",
        "days": "dias",
        "modal_close": "Fechar esta janela",
        "nochange": "Nenhuma alteração feita",
        "close": "Fechar",
        "security": "Segurança",
        "login": "Login",
        "password": "Palavra chave",
        "recommanded_state": "Estado recomendado",
        "folder": "Pasta",
        "save": "Salvar",
        "filecreatedorupdated": "O arquivo %s foi criado ou actualizado",
        "clickonprotect": "Não se esqueça de clicar no botão Protecão! para que as alterações sejam salvos",
        "intro": "Introdução",
        "important_info": "Informações Importantes",
        "information": "Informação",
        "warning": "Atenção",
        "links": "Ligações",
        "scan": "Digitalizar",
        "more_info": "Explicações detalhadas",
        "authorize_popups": "O seu navegador bloqueia as janelas pop-up, active-as por favor para que funcione no seu site",
        "new_version": "<h4>Actualizações disponíveis<\/h4>A sua aeSecure   actual versão é  <span style='font-weight:bold;color:red;'>%1<\/span>.<br\/>A versão mais recente é a versão <span style='font-weight:bold;color:green;'>%2<\/span>.<br\/><br\/>Você gostaria de o instalar?",
        "ajax_new_version": "<strong>A versão %s de aeSecure está disponível.<\/strong><br\/>Clique no botão %s superior direito, se você a deseja instalar.",
        "version_control": "Verificação no servidor aeSecure se você tem ou não a versão mais recente do software.",
        "latest_version": "Parébens, você já tem a última versão do aeSecure.",
        "optimize": "Optimizar!",
        "protect": "Proteger!",
        "edit": "Editar",
        "permissions": "Permissão",
        "premium": "Este funcionalidade é para usuários Premium",
        "onlypremium": "Desculpe, este recurso é para usuários Premium aeSecure.",
        "filereadonly": "O arquivo %s não pode ser alterado",
        "fanfacebook": "Seguir aeSecure no Facebook",
        "action_enabled": "Activar",
        "action_disabled": "Desactivar",
        "state_enabled": "Activado",
        "state_disabled": "Desactivado",
        "feature_enabled": "<span style='font-size:1.5em;'>A segurança esta activada<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>A segurança foi desactivada<\/span>",
        "optimization_enabled": "Optimização foi <span class='label label-success'>activada<\/span>.",
        "optimization_disabled": "Optimização foi <span class='label label-warning'>desactivada<\/span>; linhas no arquivo. htaccess que possibilitou foram removidos.",
        "are_you_sure": "Você tem a certeza?",
        "readmore": "Ler mais",
        "not_joomla": "Seu site não é um site Joomla!®, este recurso não está,disponível.",
        "sorry_notfree": "Desculpe, este recurso não está disponível na versão gratuita do aeSecure.&nbsp;",
        "sure_yes": "Sim, eu confirmo",
        "sure_no": "Não",
        "test": "Testar",
        "verify": "Vérificar",
        "pleasewait": "A exibição da informação pode demorar alguns segundos obrigado pela sua paciência.",
        "pleaseselectatleastone": "Selecione pelo menos uma opção",
        "filecontent": "Conteúdo do arquivo de %s",
        "hint_folder": "Nome da pasta para proteger",
        "uptodate_php": "Parabéns, você está usar a versão mais recente do PHP (%s)",
        "test_tip": "Se você quiser 'ver' o que faz esta protecção, clique aqui. Você pode, então testar a protecção antes e depois de ser activado."
    },
    "options": {
        "phpautocheck": "Verifica automaticamente a versão do PHP",
        "phpautocheck_hint": "Para exibir a página de configuração aeSecure, verifica a versão do PHP instalado no seu servidor web. O controle é feito diretamente do site http:\/\/www.php.net\/releases.",
        "seeadvancedoptions": "Veja as funções avançadas",
        "seeadvancedoptions_hint": "Ao desativar essa opção, os recursos premium como o Pro e não será visível se você tem a versão gratuita do aeSecure.<br\/><br\/><strong>Obrigado por tomar o tempo para considerar a compra de uma versão premium que irá aumentar a segurança do seu site.<\/strong>",
        "title": "Opções",
        "form_title": "Configuração de aeSecure",
        "hint": "Parametros aeSecure, configuração de idioma, envio de e-mails ...",
        "save_hint": "Salvando as novas configurações serão imediatamente levados em conta",
        "saved": "Sua configuração foi salva",
        "site": "Web site",
        "sitename": "Nome do site",
        "sitename_hint": "Especifique o nome do site, este nome será usado por exemplo no envio de e-mails pelo aeSecure. Isso permitirá que você possa diferenciar os seus sites, se tiver vários.",
        "logging": "Logging",
        "folderlog": "Localização da pasta log",
        "folderlog_hint": "Nome completo da pasta que contém os arquivos log do ​​seu CMS (se você tiver um)",
        "foldertmp": "Localização da pasta temporária",
        "logwrite": " Backup dos arquivos log",
        "logwrite_hint": "Quando o aeSecure bloquear o acesso,  quer um arquivo log seja gerado na pasta log, o que lhe permite de verificar o funcionamento do aeSecure, saber quem está a tentar fazer um acesso ilegítimo... ",
        "logtype": "Tipo de log",
        "logtype_hint": "Quando visualizar todos os arquivos de log, quer ver em formato texto ou xml?",
        "foldertmp_hint": "Nome completo da pasta que contém os arquivos temporários do seu site",
        "key": "Palavra-passe",
        "key_hint": "A palavra-passe que é usada para acessar a página \/ aesecure \/ setup.php. Esta é a variável que garante que você é legítimo ou não. Se você alterar a palavra-passe, escolha outra mais forte (10 caracteres no mínimo).",
        "timeout": "Duração da sessão (seg)",
        "timeout_hint": "A duração da sessão define o tempo, em segundos, entre a obrigação de introduzir de novo a palavra-passe da aeSecure e a próxima acção que fizer. Tenha cuidado para não escolher um período demasiado longo, não é necessário e é potencialmente uma fonte de roubo de identidade. ",
        "emailfromname": "Nome do remetente",
        "emailfromname_hint": "Nome que será do remetente e-mails",
        "emailfrom": "eMail do remetente (De)",
        "emailfrom_hint": "E-mail do remetente  (endereço de e-mail do remetente, é o campo de e-mail)",
        "email": "Endereço de email (A)",
        "email_hint": "Digite aqui o endereço de email para o qual enviar alguns alertas de invasão ou palavra-passe para o seu site quando você pedir para recebê-la por e-mail.",
        "sendemail": "Envio de e-mails",
        "sendemail_hint": "Algumas tentativas de intrusão irá accionar o envio de um e-mail, quer activar o envio ou, o contrário, de não receber nada. <br\/> Este parâmetro é ignorado para o envio da palavra-passe, no caso de você se esquecer.",
        "autocheck": "Verificação da versão automática do seu CMS",
        "autocheck_hint": "<strong>Unicamente para Joomla!®<\/strong><br\/>Se você tiver um CMS instalado, verifica automaticamente se você tiver a versão mais recente ao exibir a página de configuração aeSecure",
        "emailsubject": "Assunto do mail",
        "emailsubject_hint": "Mencione aqui o assunto do e-mail que é enviado pelo aeSecure. Você pode usar variáveis '%SITENAME%' ou '%SITEURL%', a primeira contém o nome do site, enquanto a segunda  URL.",
        "language": "A Interface do Idioma",
        "language_hint": "Seleccione o idioma em que você deseja exibir diferentes textos aeSecure.",
        "misc": "Vários",
        "geocoding": "Fuso horário",
        "geocoding_hint": "Digite aqui um URL que aponte para um serviço de localização com base no endereço IP e retorne a um resultado no formato JSON. Este serviço será chamado quando o envio de um e-mail  para o webmaster quando se tratar de localizar num mapa do Google o lugar de origem do ataque",
        "timezone": "Fuso horário",
        "timezone_hint": "Digite aqui um URL que aponte para um serviço de localização com base no endereço IP e retorne a um resultado no formato JSON. Este serviço será chamado quando o envio de um e-mail para o webmaster quando se tratar de localizar num mapa do Google o lugar de origem do ataque",
        "db": "Base de dados",
        "dbname": "Nome",
        "dbname_hint": "Se o seu site é dinâmico como é o caso de um CMS com  base de dados, digite aqui o nome do seu banco de dados",
        "dbtype": "Tipo",
        "dbtype_hint": "Digite o banco de dados, ele pode ser mysqli, mysql, mssql ou outro",
        "dbhost": "Nome do Servidor",
        "dbhost_hint": "O nome do servidor onde se encontra geralmente o banco de dados,<strong>localhost<\/strong>",
        "dbuser": "Nome da conta (login)",
        "dbuser_hint": "Login para se conectar ao banco de dados (em um site local, généralemente<strong>root<\/strong>)",
        "dbpassword": "Senha",
        "dbpassword_hint": "Mot de passe à utiliser (sur un site local, généralement le mot de passe n'est pas complété)",
        "dbprefix": "Prefixo",
        "dbprefix_hint": "Prefixo para as tabelas no banco de dados",
        "debug": "Debug",
        "debug_hint": "Activa o modo de debug",
        "debuglanguage": "Debug Língua ",
        "debuglanguage_hint": "Para facilitar as cadeias de tradução do idioma do aeSecure, todas as strings do arquivo de linguagem são prefixados por '#' e traduzir código (por exemplo, #título #  Este é o título traduzido)",
        "demo": "Modo de demonstração",
        "demo_hint": "Activa o modo de demonstração: nenhuma acção será realmente executada neste modo."
    },
    "82_compress": {
        "notsupported": "Desculpe, mas o seu alojamento não activou os módulos mog_gzip ou mod_deflate  que lhe permitem compactar os dados antes de enviar para o usuário. A compressão no lado do servidor, de modo que não pode feita no seu site.",
        "title": "Permite a compressão do lado do servidor",
        "intro": "A compressão do lado do servidor (ou mod_gzip mod_deflate) é um recurso oferecido por quase todos os provedores de hospedagem e pode comprimir código HTML em tempo real da sua página web. Esta compressão reduz drasticamente o peso da página e, assim, permitirá a rápida visualização.",
        "full": "A compressão <a href='https:\/\/developers.google.com\/speed\/articles\/gzip' title='How gzip compression works'>gzip<\/a>irá reduzir o tamanho da sua página web. A descompressão é fornecida pelo navegador da web e sem o conhecimento do usuário. Esta compressão permitirá a transferência da página muito mais rápido e, portanto, melhor a experiência do usuário no seu site.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;A velocidade de um website é levado em conta pelos motores de busca, que preferem para fazer a sua classificação. O site mais rápido, melhora a sua classificação.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Informação:<\/span>&nbsp;Desde Apache 2.0, mod_deflate tem o privilégio de envelhecimento mod_gzip.",
        "test": "Para testar a diferença de velocidade é necessário que o seu site esteja online e fazer um teste de velocidade com ferramentas que seguem . Faça o teste pela primeira vez, sem fazer a optimização e de seguida teste novamente uma vez que a optimização esteja feita, você deve ver uma diferença significativa<br\/><br\/><ul><li><a href='http:\/\/checkgzipcompression.com\/?url=%s' target='_blank' title='Check GZIP compression'>http:\/\/checkgzipcompression.com<\/a><\/li><li><a href='http:\/\/www.whatsmyip.org\/http-compression-test\/?url=%s' target='_blank' title='HTTP Compression Test'>http:\/\/www.whatsmyip.org\/<\/a><\/li><li><a href='http:\/\/gtmetrix.com\/' target='_blank' title='GTMetrix | Website Speed and Performance Optimization'>GTMetrix<\/a><\/li><\/ul>",
        "feature_enabled": "<span style='font-size:1.5em;'>Optimização activada<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Optimização desativada<\/span>",
        "hint": "<span class='text-success'>Comprimir o código HTML da sua página antes de enviar para o navegador do visitante (<span style='font-weight:bold;'>exige que seu host lhe permita usar a compressão do lado do servidor, optimização não terá efeito de outra forma<\/span>).<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recomdado<\/span><\/span>",
        "recommanded": "Activado"
    },
    "31_permissions": {
        "seefile": "Clique neste ícone para ver o conteúdo do arquivo (arquivo de texto) ou ver a imagem (arquivos de imagem)",
        "makezip": "Arquivo Zip",
        "makezip_hint": "Gera um arquivo zip da pasta atual e propõe o arquivo para download.",
        "makezipconfirm": "Você deseja comprimir este arquivo? Isso pode levar algum tempo ...",
        "killfile": "Clique aqui se você deseja excluir o arquivo do seu site",
        "title": "Arquivos e Pastas",
        "intro": "Especifica os direitos de acesso (chmod)pastas restritas e arquivos no seu site.  Assim, você pode definir quais arquivos que nunca podem ser alterados ou pastas que você não pode escrever novos arquivos.",
        "full": "Scripts maliciosos têm em comum modificar certos arquivos em seu site, a fim de escrever um pedaço de código que fazer com que a aparição por exemplo, um pop-up ou redireccionar para um site de pouco interesse ou para criar novos arquivos (PHP,. htaccess, ...) para seus registos..<br\/><br\/>Outros scripts vão estar dispostos a tentar roubar informações de configuração do seu site (configuration.php no Joomla! ® ou arquivo WordPress wp_config.php) ...<br\/><br\/>Especificando direitos de acesso aos arquivos restritas, você adiciona um nível extra de protecção para o seu site.",
        "confirm": "<span class='text-danger'>Altere a segurança do arquivo \/ pasta pode causar problemas como por exemplo, não terá mais acesso ao seu website.<br\/><br\/>Se confirmar as alterações, testar o seu site ainda funciona correctamente.<br\/><br\/><span style='font-weight:bold'>Em caso de problemas, ligue com o seu cliente FTP e restaure a permissão anterior.<\/span><\/span>",
        "confirm_kill": "<span class='text-danger'>Você está prestes a eliminar o ficheiro <span style='font-weight:bold;'>%s<\/span>.  Você tem certeza ?<br\/><br\/><span style='font-weight:bold'>Lembre-se, uma vez confirmado, o arquivo é excluído fisicamente.<\/span><\/span>",
        "file_removed": "<span class='text-success'>O ficheiro <span style='font-weight:bold;'>%s<\/span> foi removido<\/span>",
        "previous": "valor anterior",
        "feature_enabled": "<span style='font-size:1.5em;'>Nova(s) autorização(ões) classificação (ões)<\/span>",
        "chmodinfo_group": "<ul><li>Primeiro dígito: sua conta de usuário (proprietário)<\/li><li>Em segundo lugar figura: o grupo (group)<\/li><li>Terceiro dígito, todos<\/li><\/ul>",
        "chmodinfo_sec": "<ul><li>0 :nenhum direito<\/li><li>1 :permissão de execução<\/li><li>2 : permissão de escrita<\/li><li>4 : permissão de leitura<\/li><\/ul>",
        "chmodinfo": "Os números se somam da seguinte maneira, o valor,5 significa leitura e execução (para uma pasta = abertura à direita), 6 : leitura e escrita, 7 : todos os direitos, ...<br\/>Os valores recomendados são <span class='label label-success'>644<\/span> para arquivos é <span class='label label-success'>755<\/span> para pastas. Em princípio, nunca por em <span class='label label-danger'>777<\/span>",
        "chmodinfo_best": "<div class='chmodbest'>&nbsp;<input type='radio' disabled\/>&nbsp;<\/div>Em princípio, é a melhor configuração para este arquivo.",
        "chmodinfo_min": "<div class='chmodmin'>&nbsp;<input type='radio' disabled\/>&nbsp;<\/div>Não seleccione a permissão mais baixa, porque pode encontrar problemas para acesso mais tarde.",
        "chmodinfo_na": "<div class='label label-warning'>Atenção :<\/div>&nbsp;Você está ainda no Windows, os direitos de acesso são ineficazes e, portanto, inútil. Faça os ajustes apenas para o seu site, uma vez que esta em produção.",
        "chmodhtaccess": "Atenção, alguns hosts exigem permissão de pelo menos 444 para o arquivo .htaccess.&#10;&#10;Se você optar por uma permissão mais restritiva, você provavelmente terá um erro de página '500' da próxima vez que efectuar login em seu site.&#10;&#10;Para restaurar a permissão do arquivo .htaccess, você tem que usar o seu cliente FTP e adaptar o 'chmod'  pelo menos 444.",
        "chmod644": "Só a sua conta de usuário no seu host pode ler e gravar arquivos, somente leitura o acesso é concedido para outras contas.",
        "chmod777": "O nível de 777 significa que tudo é permitido: você dá tudo a todos. Normalmente, essa permissão não deve ser usado porque é a melhor maneira de ser 'hacké'.",
        "can_be_deleted": "Normalmente, este arquivo pode ser excluído porque é inútil num site em produção.<br\/><br\/><span style='font-weight:bold;'>Excluir este arquivo<\/span>",
        "htaccess": "Permissões impróprias do arquivo e você obterá um erro 'Erro 500' no seu site.<br\/><br\/>A melhor permissão funcional é a 444. No entanto, você pode tentar uma permissão 440 ou 400, mas esteja ciente de que os riscos são grandes já não têm acesso ao seu site. Se este for o caso, abra seu cliente FTP e ajustar manualmente o nível de acesso (chmod) du arquivo .htaccess em 444.<br\/><br\/><span style='font-weight:bold;'>Este arquivo é sensível e importante<\/span>",
        "backups": "Se você armazenar seus backups nesse caso, saiba que não é uma boa ideia fazê-lo aqui, porque ele pode ser acessível a partir da web.  O ideal é usar uma pasta fora do seu arquivo 'public_html'.<br\/><br\/><span style='font-weight:bold;'>A mudar, pelo menos para um lugar seguro com uma senha \/ limitar com um endereço IP.<\/span>",
        "configuration.php": "Recomenda-se colocar este arquivo para 400 (max. 444) em um site de produção. Se você precisar alterar a configuração geral do seu site, mudar este arquivo para 644, em seguida, uma vez que as alterações feitas a partir da sua administração Joomla!, Restaurar o acesso de 400.<br\/><br\/><span style='font-weight:bold;'>Este arquivo é sensível e importante<\/span>",
        "htaccess.txt": "Este arquivo é inútil. Se você já tem um arquivo chamado .htaccess, você pode excluir este arquivo.<br\/><br\/><span style='font-weight:bold;'>Excluir este arquivo<\/span>",
        "index.php": "Este arquivo nunca deve ser acessível em escritura não vale a pena correr o risco de seu site 'desfigurar'.<br\/><br\/><span style='font-weight:bold;'>Ao máximo, vá para 444<\/span>",
        "logs": "O arquivo de registo é importante porque é usado pelo CMS para escrever seus arquivos de logs, por isso deve estar com direitos de escritura se  possível  (autorização de 5 ou 7)<br\/><br\/><span style='font-weight:bold;'>Especifique o acesso 755<\/span>",
        "php.ini": "Este arquivo não deve estar em escritura, um nível apenas de acesso de leitura é suficiente(400, 440 ou 444)<br\/><br\/><span style='font-weight:bold;'>Este arquivo é sensível e importante<\/span>",
        "robots.txt": "Este é um arquivo que deve ser acessível aos motores de pesquisa, um acesso só de leitura é suficiente. Não dê um nível de acesso superior a 444.",
        "tmp": "Pasta TMP é importante porque é usado pelo seu CMS para gravar arquivos temporários, por isso deve estar com direitos de escritura se  possível  (autorização de 5 ou 7)<br\/><br\/><span style='font-weight:bold;'>Especifique o acesso 755<\/span> ",
        "web.config.txt": "Num servidor Apache, este arquivo inútil.<br\/><br\/>Em um servidor Microsoft, renomeie o arquivo web.config para permitir reescrever urls.<br\/><br\/>Se você já tem um arquivo chamado web.config, você pode excluir este arquivo<br\/><br\/><span style='font-weight:bold;'>Este arquivo é inútil<\/span>"
    },
    "tools": {
        "ZipWebsite": "Baixe o arquivo do site",
        "ZipWebsite_hint": "Um arquivo zip será gerada (isso vai levar tempo!) Este arquivo será imediatamente proposto para download.&#10;&#10;\npor favor, não feche a janela até que o arquivo zip.&#10;&#10;NB : zip será imediatamente removido do site, mesmo antes de começar o download. O arquivo não vai, portanto, ser 'baixado', exceto via esta função.",
        "see_apache_error_log": "Consulte o log de erros do Apache",
        "see_apache_error_log_hint": "O log de erro é o arquivo no qual o servidor web escreve cada problema em seu site; por exemplo, dizer erros fatais que causam a exibição de uma página em branco.\\r\\nATENÇÃO\\r\\nEste arquivo pode ser volumosos e sua tela pode levar um longo tempo. Por esse motivo, apenas um número limitado de linhas (o último ficheiro) será exibida.",
        "apache_error_log_skip": "Não vai ser exibido, as linhas do arquivo de log que contenha essas seqüências:",
        "apache_error_log_skip_short": "encontradas %s vezes",
        "lastmod-selectfolder": "Por favor insira o nome de uma pasta",
        "lastmod-nonefound": "Esta pasta não aparece em qualquer resultado abaixo",
        "lastmod-hidefolder": "Quer tirar dessa lista todos os arquivos de uma pasta específica (por exemplo, 'cache')? Digite o nome da pasta abaixo e clique no botão 'Esconder'.",
        "lastmod-hide": "Esconder",
        "lastmod-foldersample": "Digite um nome de pasta como por exemplo Cache",
        "fileread_notfound": "Nenhuma linha contém a seqüência de pesquisa",
        "fileread_placeholder": "ex. accessdenied.php?s=651",
        "fileread_ignore": "As linhas que contêm um dos seguintes valores foram ignorados :",
        "fileread_specify_something": "Por favor, especifique linhas que contenham uma (cadeia de valores ) para o qu'aeSecure possa procurar e ocultar .",
        "see_apache_error_log_notfound": "O log dos erros Apache está vazio. A partir de agora, quando um erro Apache é encontrado, ele vai escrever a mensagem de erro no arquivo de log. É perfeitamente normal, se o arquivo estiver vazio \/ não encontrado.",
        "see_htaccess_notfound": "Htaccess não foi encontrado na raiz do seu site. Por favor, habilite a opção 1.1 d'aeSecure.   <br\/><br\/><span style='font-weight:bold;font-style:underline;font-size:1.5em;'>\nNota: na ausência de htaccess, aeSecure está inoperante!<\/span>",
        "see_phpini_notfound": "Nenhum arquivo php.ini foi encontrado na raiz do seu site. Este arquivo é adicionado quando você habilita 1.2 aeSecure. A ausência do php.ini não afeta o funcionamento de aeSecure desde que a mesma informação também esteja incluído no arquivo htaccess localizado na raiz do seu site.",
        "see_activity_notfound": "A atividade de arquivo começa a ser criado assim que você ativar qualquer opção de aeSecure.",
        "pentest-text": "Testes d'intrusão \/ hackers",
        "pentest-hint": "Esta ferramenta permite que você execute várias consultas 'insalubre' para ver como o site vai reagir. Assim 'aeSecure estiver ativo, pretende-se que todas essas tentativas são parados (considerando a criação de seu site).&#10;&#10;NB :Os ataques são apenas; nenhum dos quais é real.",
        "title": "Ferramentas",
        "coderemover-hint": "Trojan code remover  é um script que pode digitalizar js, php, html, shtml, htm, dwt, Inc., asp, cfm, aspx e pl no seu site à procura de uma sequência de caracteres, e se é encontrada, a sequência é removida.&#10;&#10;\nÉ, portanto, uma ferramenta para limpar o seu site depois de ter sido comprometida.",
        "jamss-hint": "Joomla! Anti-Malware Scan é um script de detecção de de script de determinadas palavras-chave nos arquivos de origem do seu site. É só para ver os arquivos reprennant essas palavras-chave que são susceptíveis de ser malware.&#10;&#10;É, portanto, uma ferramenta para tentar encontrar vestígios de uma possível pirataria.&#10;&#10;ATENCÃO: JAMSS gera um grande número de falsos positivos, é preciso analisar cuidadosamente as mensagens antes de intervir. ",
        "false-positive": "<div style='color:red;width:80%;margin-left:100px;margin-right:100px;display:block;'><span style='font-weight:bold;'>Atenção!!!<\/span> Este tipo de ferramenta verifica os arquivos em seu site à procura de padrões, ou seja, uma lista de palavras-chave que potencialmente pode ser perigoso. Por exemplo, a palavra 'iframe' é procurado porque é possível, iframe, para visualizar as informações de um site de terceiros. No entanto, os botões para redes sociais freqüentemente usam iframes. Programas de segurança, como também aeSecure contêm tais patterns como eles são desenvolvidos justamente para bloquear ataques. Portanto ser extremamente cuidadoso e devidamente analisar as informações retornadas pelo script.<br\/><br\/>Se você executar uma operação de limpeza, lembre-se de fazer um backup do seu site pouco antes, pode ser necessário no caso de algo der errado. <\/div>",
        "psi-hint": "PhpSecInfo é uma ferramenta de auditoria para a configuração do PHP de seu hosting",
        "phpinfo-text": "phpinfo",
        "phpinfo-hint": " O phpinfo irá mostrar a configuração do seu site, por exemplo, listando os módulos que são carregados.",
        "lastmod-text": "Os arquivos que foram modificados recentemente",
        "lastmod-hint": "Digitaliza o seusite em busca de arquivos web que foram modificados durante os últimos dias . Desta forma, em caso hacking, você pode destacar os arquivos que foram alterados, para que possa prestar sua atenção a esses arquivos.",
        "lastmod-explain": "Se você quiser encontrar a lista de arquivos que foram alterados nos últimos 7 dias, indicar o número (7) abaixo. Pode mencionar um número entre 1 e 99.",
        "lastmod-days": "Número de dias (1-99)",
        "lastmod-files": "Lista de arquivos que foram alterados nos %d últimos dias",
        "lastmod-number": "Número de arquivos: %d",
        "allow_url_fopen": "Aviso: allow_url_fopen deve estar activo a fim de garantir o bom funcionamento do Joomla ®!. Assim, por exemplo, se desactivado as funções de up-to-date Joomla! ® não funcionam mais.",
        "HTML2PNG": "Página de captura no formato PNG",
        "HTML2PNG_hint": "Página de captura irá gerar uma imagem PNG do que é exibido, assim você pode facilmente salvar suas configurações, por exemplo",
        "see_htaccess": "O seu .htaccess",
        "see_htaccess_hint": "Abre um pop-up que permite que você visualize o arquivo htaccess. Foi criado",
        "see_phpini": "O seu arquivo php.ini",
        "see_phpini_hint": "Abra um pop-up que permita que você veja através do aeSecure o arquivo php.ini. Este arquivo está na pasta da raiz do seu site",
        "see_activity": "Seu registo de actividades",
        "see_activity_hint": "Este arquivo contém a lista de acções que você tomou como activação de uma funcionalidade . Em caso de problemas, este arquivo vai lhe mostrar o que foi feito.",
        "reset_htaccess": "Desinstalar o .htaccess e php.ini do aeSecure",
        "reset_htaccess_hint": "Restaura o seu .htaccess de base removendo todas as referências às regras estabelecidas por aeSecure. Se você desejar desinstalar completamente aeSecure, por favor, apague a pasta \/ aesecure seu site.",
        "reset_htaccess_notfound": "O arquivo .htaccess do AeSecure  não foi activado no seu site obviamente. Nenhuma acção foi feita.",
        "reset_htaccess_done": "O seu arquivo .htaccess foi limpo pelo código aeSecure. Apenas o seu código pessoal está lá agora.",
        "reset_htaccess_removed": "Antes de instalar aeSecure, não havia nenhum arquivo .htaccess no local. O seu actual .htaccess foi renomeado como OLD.htaccess.",
        "aeSecure_no_more_active": "O aeSecure se não encontra activo no seu site"
    },
    "15_blockip": {
        "title": "Bloqueio de endereços IP",
        "intro": "Bloquear um endereço IP é proibir um computador específico para acessar seu site. Quando você sofre um ataque, muitas vezes é útil para bloquear os IPs das máquinas. Nota: O endereço IP é dinâmico e as mudanças muitas vezes tão regularmente.",
        "full": "O endereço IP é a impressão digital de todos os dispositivos conectados à web. Ao acessar o site, para que o visitante tenha um endereço IP próprio e único. Se você quiser negar o acesso ao seu site para essa pessoa, bloqueanda o seu endereço IP<br\/><br\/><div class='text-primary'><strong>Observação :<\/strong>&nbsp;O endereço IP é na maior parte dinâmico e atribuída ao usuário no início . Ao bloquear o IP, para que bloquear temporariamente \"o acesso ao site (a menos que o endereço IP é fixo e, neste caso, é final).<br\/><br\/>Alguns spammers ou 'crawler' (ou seja, scripts que analisam todas as páginas do site) têm um endereço IP estático inalterado.<\/div>",
        "preface": "Por favor, digite um endereço IP por linha e \/ ou separados por ponto-evírgula.<br\/>Exemplo : 255.255.255.255;128.128.128.128;123.123.123.123 par a bloquear estas 3 adresses IP.",
        "saved": "Suas altera\\u00e7\\u00f5es foram salvas.<br\/><br\/><span class='lead text-danger'>Em caso de problemas de acesso, voc\\u00ea ter\\u00e1 que editar o arquivo. Htaccess do seu cliente FTP.<\/span>"
    },
    "21_protectFolderIp": {
        "preface": "Somente endereços IP listados abaixo terá acesso, qualquer tentativa de conexão será redirecionado para uma página de \"Acesso proibido\".",
        "title": "proibir o acesso a uma pasta por endereço IP",
        "intro": "O acesso a uma pasta (por exemplo, \/ administrador) será restrita a um ou mais IPs pré-definidas. Assim, apenas os computadores então ter acesso ao Site.",
        "full": "Limitar o acesso com base a um ou mais IPs o acesso é impossível a outros computadores para se conectar à pasta.Esta segurança de acesso é o melhor que você pode implementar no padrão, proibindo todos, excepto um ou outro computador sendo este o princípio whitelist.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Atenção:<\/span>&nbsp;Se o seu endereço IP é dinâmico (este é o caso da maioria dos fornecedores de internet) terá que utilizar uma função irá adicionar o novo endereço IP a cada vez que ele muda.",
        "restrict": "Acesso restrito ao arquivo com base no endereço do visitante",
        "done": "A conexão ao arquivo %s está limitado a IP %s",
        "removed": "Restrição com base no endereço IP foi removido",
        "addressip": "Endereço IP ",
        "hint": "<span class='text-danger'>Clique no botão somente se você deseja bloquear o acesso ao arquivo mencionado no computador com esse endereço IP.<br\/><br\/><span style='font-weight:bold;'>Você bloqueia outras conexões, se esse for o seu desejo, clique no botão.<\/span><\/span>",
        "hint_ip": "Este é o seu endereço IP actual"
    },
    "11_protecthtaccess": {
        "preface": "Se, depois de ativar essa proteção, você deve obter um erro no seu site, por favor consulte o<span style='font-weight:bold;text-decoration:underline;'><a href='http:\/\/aesecure.com\/documentation\/faq.html' target='_blank'>FAQ<\/a><\/span> d'aeSecure.",
        "feature_enabled": "<span style='font-size:1.5em;'>aeSecure actio<\/span><br\/><br\/>\nVerifique se o seu site permanece funcional testando algumas URLs. Se você achar que você tem alguns problemas, obrigado a se referir ao<span style='font-weight:bold;text-decoration:underline;'><a href='http:\/\/aesecure.com\/documentation\/faq.html' target='_blank'>FAQ<\/a><\/span><br\/><br\/>Se a reescritura das suas URLs não está  ativo, obrigado ativar a opção aeSecure 7.1.",
        "title": "Implementação do Arquivo .htaccess do aeSecure",
        "intro": "O arquivo .htaccess é lido pelo servidor web cada vez que é solicitado.  O arquivo .htaccess do aeSecure contém um número muito grande de regras que irão aumentar a segurança e optimizar seu site.",
        "full": "O arquivo .htaccess é lido pelo servidor web sempre que uma url está a ser executada no seu site, quer se trate de uma página web ou baixar um arquivo. Este arquivo é essencial para proteger o seu site como ele vai ser aquele que vai digitalizar a URL e decidir que é legítimo.<br\/><br\/>aeSecure irá substituir o arquivo actual para adicionar um mecanismo de controle das urls para determinar se elas são legítimas ou se tem que ser bloqueadas, caso representem uma ameaça total do seu site<br\/><br\/>Votre fichier actuel sera inclus dans celui généré par aeSecure.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i> Information:<\/span><\/span> Seu arquivo actual, antes de colocar o de aeSecure será salvo na pasta \/aesecure\/setup\/backup.",
        "copy": "Cópia do arquivo .htaccess principal do aeSecure",
        "copyfromto": "Cópia %s para %s",
        "state_enabled": "Instalado",
        "state_disabled": "Desinstalado",
        "recommanded": "<span style='font-weight:bold'>. aeSecure htaccess é obrigatório e deve ser instalado.<\/span>",
        "keep_old_content": "O conteúdo do seu arquivo .htaccess original antes de instalar aeSecure, foi incluído no de aeSecure.",
        "renamed": "O seu arquivo anterior %s foi renomeado en %s",
        "test": "<p>Alguns arquivos são acessíveis através de uma URL, então eles não devem ser, é o caso por exemplo, arquivos instalados por padrão com o exemplo Joomla (<a href='%HTTP_HOST%\/LICENSE.txt' target='_blank'>LICENSE.txt<\/a>,<a href='%HTTP_HOST%\/joomla.xml' target='_blank'>joomla.xml<\/a>,<a href='%HTTP_HOST%\/README.txt' target='_blank'>README.txt<\/a>, ...)<\/p><p>Outros arquivos devem ser especificamente protegidos como <a href='%HTTP_HOST%\/configuration.php' target='_blank'>configuration.php<\/a> ou <a href='%HTTP_HOST%\/.htaccess' target='_blank'>.htaccess<\/a> : você não deve ser capaz de acessar a essas urls.<\/p><p>Alguns scripts têm como alvo os sites Joomla e para fazer isso, verificam se certos arquivos existem. É o caso de algumas imagens instaladas por defeito padrão do Joomla: sua presença indica que este é um site Joomla e de acordo com a presença de certos arquivos presentes, é possível determinar o número de versão do Joomla instalado.  Algumas imagens instaladas por defeito com o Joomla : <a href='%HTTP_HOST%\/images\/joomla_black.gif' target='_blank'>images\/joomla_black.gif<\/a>, <a href='%HTTP_HOST%\/images\/banners\/white.png' target='_blank'>images\/banners\/white.png<\/a>, <a href='%HTTP_HOST%\/images\/sampledata\/apple.jpg' target='_blank'>images\/sampledata\/apple.jpg<\/a><\/p><p>Os hackers também tentam entrar nos arquivos do sistema operacional como boot.ini ou win.ini e para isso, eles lançam um grande número de consultas desse tipo : <a href='%HTTP_HOST%\/index.php?option=com_users&task=..\\..\\..\\..\\..\\..\\..\\..\\..\\boot.ini%00.htm' target='_blank'>index.php?option=com_users&task=..\\..\\..\\..\\..\\..\\..\\..\\..\\boot.ini%00.htm<\/a>.  Se o seu servidor web não está suficientemente protegido, é possível que o arquivo(boot.ini iqui) seja exibido.<\/p><p>O arquivo .htaccess do aeSecure irá impedir o accesso a arquivos\/pastas<ul><li>escondidas ou seja, aqueles cujo nome começa com um ponto (.), é o caso, o ficheiro .htaccess mas você também pode ter criado uma pastas, como '.backup', '.git', ...   Relativamente as pastas ocultas, aeSecure vai proibir o acesso a partir de uma url.<\/li><li>instalado por defeito como p.ex. <a href='%HTTP_HOST%\/images\/sampledata\/index.html' target='_blank'>images\/sampledata<\/a><\/ul><\/p><p>Várias URLs parametrizadas serão bloqueadas pelo aeSecure como<ul><li>o que é chamado de impressões digitais modelo <a href='%HTTP_HOST%\/index.php?tmpl=offline' target='_blank'>index.php?tmpl=offline<\/a>, <a href='%HTTP_HOST%\/index.php?tp=1' target='_blank'>index.php?tp=1<\/a> ou ainda <a href='%HTTP_HOST%\/index.php?template=beez' target='_blank'>index.php?template=beez<\/a>.<\/li><li>Urls reprennant certos códigos proibidos como retornos ou 'Escape caracteres'.<\/li><li>les 'PHP Easter Eggs' revelam que o número de PHP versão trabalho em seu site : <a href='%HTTP_HOST%\/index.php?=PHPE9568F34-D428-11d2-A769-00AA001ACF42' target='_blank'>index.php?=PHPE9568F34-D428-11d2-A769-00AA001ACF42<\/a><\/li><li>esses com código javascript na URL como p.ex. <a href='%HTTP_HOST%\/index.php?%3Cscript%3Ealert%28%27Msg%27%29;%3C\/script%3E' target='_blank'>index.php?%3Cscript%3Ealert%28%27Msg%27%29;%3C\/script%3E<\/a><li>...<\/li><\/ul><\/p><p>Muitos outros ataques URLs serão bloqueados pelo arquivo .htaccess do aeSecure...<\/p><h4>Na ausência de arquivo .htaccess do aeSecure, cada uma das consultas acima irá exibir uma mensagem no melhor e no pior dos casos um conteúdo de página de erro.  A protecção aeSecure vi bloquear todas as tentativas antes mesmo que elas cheguem alcançar o seu site web e, mesmo antes que ela seja executada e que o servidor web tente dar uma resposta.<\/h4>",
        "hint": "<span class='text-success'>Cópia do arquivo .htaccess do aeSecure na raiz do seu site e incorpora o arquivo original na parte inferior do arquivo criado.<br\/><br\/><span class='text-success' style='font-weight:bold;'>Indispensável e obrigatório.<\/span><\/span>"
    },
    " 11_protecthtaccess": {
        "preface": "Se, depois de ativar essa proteção, você encontrar um erro no no seu site, por favor consulte o<span style='font-weight:bold;text-decoration:underline;'><a href='http:\/\/aesecure.com\/documentation\/faq.html' target='_blank'>FAQ<\/a><\/span> d'aeSecure."
    },
    "73_editrobots": {
        "title": "Edição do arquivo robots.txt",
        "intro": "O arquivo robots.txt é colocado na raiz do seu site e dá instruções para os motores de busca, permitir ou não. Por exemplo, é graças a você robots.txt impedir o motor de busca para indexar os arquivos da administração ou outras pastas sensíveis e privadas.",
        "full": "O arquivo robots.txt permitirá (permitir) ou negar (impedir) o motor de busca para indexar todo ou parte do seu site. Tomemos o caso em que você tem uma pasta \/ administrador: você não deseja que apareça nos links de resultados de pesquisa lincada a administração. Se você tiver arquivos pessoais, como \/ backups, \/ confidencial \/ members_only ... você não quer mais ligações a serem devolvidos para qualquer um que faz uma pesquisa no Google, por exemplo.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;Se você usar um CMS, você já tem esse arquivo, caso contrário, talvez seja falta.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Atenção:<\/span>&nbsp;Note-se que os motores de busca não são \"forçados\" a respeitar o arquivo robots.txt. Um motor de busca sem escrúpulos \"poderia até tentar analisar o arquivo para ver o que 'esconder'.",
        "explain": "Se você quer uma explicação da sintaxe, visitar o site <a href='http:\/\/robots-txt.com\/' title=\\\\\"Robots.txt - Manuel d'implémentation\\\\\" target='_blank'>http:\/\/robots-txt.com<\/a>.<br\/><br\/><span class='label label-success'><i class='icon-info-sign icon-white'><\/i>&nbsp;Truc:<\/span>&nbsp;N'oubliez pas d'indiquer votre <a href='http:\/\/robots-txt.com\/ressources\/robots-txt-sitemap-xml' target='_blank'>Sitemap<\/a>no arquivo robots.txt.<br\/><span class='label label-success'><i class='icon-info-sign icon-white'><\/i>&nbsp;Truc:<\/span>&nbsp;Você pode testar a qualidade do seu arquivo robots.txt <a href='http:\/\/www.searchenginepromotionhelp.com\/m\/robots-text-tester\/robots-checker.php' target='_blank'>Aqui<\/a>",
        "saved": "Suas alterações foram salvas"
    },
    "45_dbadmin": {
        "failure": "<span class='bg-danger lead'>Atenção, você tem pelo menos uma conta <strong>%s<\/strong> que está ativo em seu banco de dados.<br\/><br\/><a href='http:\/\/aesecure.com\/fr\/documentation\/fonctionnalites.html' target='_blank'>Clique aqui se você precisar de informações<\/a><\/span>",
        "congrats": "Parabéns, você não tem acesso <strong>%s<\/strong> que está ativo no seu site.",
        "nologinprovided": "Obrigado a indicar o nome de um link para verificar, por exemplo, \"admin\". ",
        "preface": "A conta de administração padrão do Joomla! ® é \"admin\". No entanto, se você quiser testar outra conta, digite o nome abaixo.",
        "full": "Imagine por um momento que você é um pirata se apenas alguns segundos você está enfrentando uma tela de login, onde você será solicitado a digitar um login e senha. Qual o login que você vai tentar saber, além disso, é um site Joomla! ®? Resposta:<strong>você escreve \"admin\" no campo de login.<\/strong><br\/><br\/>Uma vez que o login é \"admin\" , sendo assim, usado no site em questão, o hacker terá feito 50% do trabalho tornando-se um login existente e ter direitos superiores.<br\/><br\/>Seja qual for computador sistema, não utilize as contas padrão, como são conhecidos, os hackers experimentá-los primeiro. Se você os usa  (ainda) tal tipo de  conta, mude imediatamente!<strong>Criar uma nova conta tipo super-administrador e desativar a conta \"admin\".<\/strong>",
        "intro": "Você ainda tem uma conta \"admin\" ativo no seu site?",
        "title": "Procure a conta \"admin\""
    },
    "51_backupdb": {
        "title": "Exporte o banco de dados em formato SQLExporte o banco de dados em formato SQL",
        "intro": "Após a execução, você vai obter um arquivo de texto e retomar o código SQL para reconstruir completamente o seu banco de dados.<br\/><br\/> É, portanto, um backup completo do seu banco de dados...",
        "full": "A exportação do banco de dados permite que você mantenha um backup dele, mas também ser muito útil ao procurar por códigos maliciosos, porque você começa um arquivo de texto em que é fácil de pesquisar manualmente, procurando código que pode ser armazenado em artigos, módulos, ...<br\/><br\/> Se você tem um site local, você pode restaurar seu banco de dados, entrando em sua interface phpMyAdmin local e executar o código SQL no arquivo.",
        "protect": "Realizar"
    },
    "18_devilnumber": {
        "preface": "A esquerda permite pesquisar e exibir a lista de pastas e arquivos com chmod tendo o valor desejado <u>Nenhuma alteração será feita no seu site<\/u>.<br\/><br\/>A área à direita para definir novos valores para pastas e arquivos. Se você clicar no botão Proteger! a área da direita, as pastas \/ arquivos com o chmod procurado não será exibido, mas apenas o chmod será adaptado para refletir sua escolha.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Lembre-se:<\/span>&nbsp;Chmod um pasta deve ser 755 e o de um arquivo 644 .",
        "title": "Garante que nenhuma pasta ou arquivo é chmod 777",
        "intro": "Quando o nível de acesso a um arquivo é 777, isso significa que o arquivo está acessível, editável e executável por qualquer pessoa. É a pior situação, com uma pasta: qualquer pessoa pode criar um arquivo, colocar o código malicioso e executá-lo.<br\/><br\/>A priori, não há cenário que exige que você deve ter arquivos ou pastas com este nível de acesso.",
        "full": "777 significa que qualquer pessoa pode, se ele pode acessar os arquivos no seu servidor web, ler, escrever e executar qualquer arquivo e criar muitos arquivos, executável,que desejar. Este é um cenário contra o qual todos os webmasters devem absolutamente proteger.<br\/><br\/>Não existem, a priori, qualquer situação em que o nível de segurança deve ser como descrito acima. O número 777 é também conhecido como<strong>o número do diabo<\/strong>.<br\/><br\/>Clique na guia de selecção para que aeSecure analisa o seu site (isso vai levar tempo) para procurar esses arquivos. Se encontrado, alterar as permissões! Para um arquivo, escolher 644 e 755 para uma pasta. Note que você pode, talvez, encontrar o mau funcionamento de parte do site é se um programa legítimo exige um 777, caso em que você terá que notificar por exemplo,   o desenvolvedor deste software.",
        "congrats": "Parabéns! Nenhuma pasta ou arquivo tem um acesso igual au nível 777 .",
        "nbr_files": "Número de ocorrências encontradas: %d",
        "feature_enabled": "Pesquisa das Pastas \/ arquivos concluída",
        "windows": "Seu site está sendo executado em um tipo de servidor do Windows, o <strong>chmod<\/strong>um arquivo que não é suportado pelo Windows esta funcionalidade não está disponível no servidor. Se você está actualmente no seu servidor de desenvolvimento, testar a opção em seu servidor de produção."
    },
    "84_minify": {
        "title": "\"Minification\" des fichiers css, html et javascript",
        "intro": "Por trás deste termo bárbaro (minify Inglês) esconde um recurso que irá reduzir o peso das folhas de estilo e arquivos javascript, removendo o espaço real e voltar à linha desnecessária nos arquivos.\n\nO tamanho do arquivo é reduzido, o carregamento da página será mais rápido.",
        "full": "Quando um programa de desenvolvimento de uma folha de estilo (css) ou um código javascript (js), ele garante que o código pode ser lido por um humano no recuo, acrescentando aqui e ali novas linhas de regras específicas, funções ... Caso contrário, o código é ilegível e incontrolável.<br\/><br\/>Estes espaços e retorno às linhas, e os personagens são tão \"sem graça\", o tamanho do arquivo.<br\/><br\/>Para o navegador web, esses personagens são absolutamente inúteis e podem ser removidos. Ao fazer isso, o tamanho do arquivo é menor e, portanto, mais rápido para o navegador.<br\/><br\/>As ferramentas de medição de desempenho, como o YSlow ou GTmetrix atribuem importância que os arquivos são \"minified\". Esta opção vai o fazer.",
        "test": "Antes de ativar esta opção, exibir uma página do seu site, em seguida, fazer um \"view source\", ou seja pressione CTRL-U para ver o código fonte da página. Localize o link do arquivo css mais ou menos importante em número de linhas. Se o arquivo não é \"minified\" você pode ler facilmente, arquivo de apresentação será clara.<br\/><br\/>Em seguida, ative a opção e prossiga novamente para exibir o arquivo novamente. Em seguida, você vai ver o que minification no trabalho.",
        "feature_enabled": "<span style='font-size:1.5em;'>Minification activada.<\/span><br\/><br\/><span class='lead text-danger'>Em caso de problemas de acesso, você terá que editar o arquivo. Htaccess do seu cliente FTP..<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Minification desativado<\/span>",
        "recommanded": "Activado no site de producção, desativado em um teste \/ desenvolvimento",
        "minifycss": "Minifier  as folhas de estilo (fichiers .css)",
        "minifyjs": "Minifier os scripts javascript (fichiers .js)",
        "minifyjswarning": "Modificando um arquivo js é muitas vezes mal tolerada e levou a um erro de javascript. Este erro, visível a partir do console de depuração do navegador, vai parar a execução de funções javascript que irá resultar em um mau funcionamento do website..<br\/><br\/>Por favor, testar, testar e testar novamente o seu site se você ativar este recurso para garantir que ele ainda funcione como desejado.",
        "minifyhtml": "Minifier os ficheiros HTML (ficheiros .htm et .html)",
        "explain": "<span class='label label-danger'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Aenção:<\/span>&nbsp;<span style='color:red;'>A mudança é um processo muito sensível: há uma alta probabilidade de que seus arquivos Javascript podem  parar de trabalhar e levar a erros JS, que irá interromper a exibição de seu site e bloquear a execução de qualquer código JS.<\/span><br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Informação:<\/span>&nbsp;  não precisa habilitar esta opção se a opção  8.1  está sendo executado em seu site."
    },
    "dashboard": {
        "title": "Multi-sites",
        "noaccess": "A interface multi-site é restrito a usuários profissional aeSecure. É uma tela central que permite que você siga as diferentes instalações aeSecure você tem em seus sites clientes. Você pode ver as versões instaladas, atualização, o download de um zip do site, exportar o banco de dados, siga os ataques de log e muitas outras características.<br\/><br\/>A oferta \"pro\" está numa opção para adquirir o site aeSecure.com.",
        "clickmore": "Clique em OK para saber mais",
        "contact": "Contatos",
        "actions": "Actions",
        "aesecureSetup": "Exibição da tela de configuração aeSecure",
        "aeSecureInstalledVersion": "AeSecure versão atualmente instalada do site",
        "backend": "Mostrar a página de administração do site (backend).",
        "addsite": "Adicionar um site",
        "addsite_prompt": "Por favor, indique abaixo a URL completa para o local para adicionar <br\/><br\/> se esqueça de dar o endereço do site de acordo com esta forma. <strong> Http:\/\/seusite\/aesecure\/<br\/>setup.php ? TRES_TRES_LONGUE_CLEF <\/strong>",
        "addsite_done": "Adicionado local, a página será atualizada para o novo site é exibido ...",
        "configuration": "Estado da configuração atual de várias características aeSecure",
        "dashboardversion": "multisites v",
        "edit": "Edição de dados do site",
        "email": "Abre uma tela de envio de email  cliente de e-mail com o destinatário previamente preenchido pelo responsável do site. Nenhum e-mail é enviado automaticamente, ela só vai ser exibida para permitir que você envie a si mesmo.",
        "exportdb": "Exportações do site de banco de dados..<br\/><br\/><span style='font-weight:bolder;color:blue;'>Obrigado pela sua paciência, pois isso é muito tempo ...<\/span>",
        "footer": "aeSecure, otimizar e proteger o seu site Apache",
        "frontend": "Ver o site (frontend)",
        "hideerrorsiste": "Sites de máscara no erro",
        "home": "Abra o seu site em uma nova aba",
        "log": "Ver registo de ataques neste site",
        "onlyIfPremium": "<span class='text-danger'>NB: Disponível apenas se o site remoto tem a versão Premium aeSecure<\/span>",
        "masterversion": "Versão Referência de aeSecure",
        "mailToWebmaster": "aeSecure: a nova versão (v%1) foi instalado em seu site %2",
        "notresponding": "aeSecure não responde. Ou ele foi desinstalado ou é uma versão mais antiga",
        "PHPVersion": "A versão do PHP no site",
        "reinstall": "Executa a atualização do aeSecure  neste site; reinstalar o software",
        "releaseinfo": "Informações da atualização",
        "removesite_hint": "Clique aqui se você deseja remover este site de sua gestão multisite",
        "removesite_prompt": "Obrigado de confirmar que você realmente deseja excluir o site %1 de sua gestão multisite ?",
        "setup": "Acesse o aeSecure interface de gerenciamento",
        "sites_network_errors": "%1 sítio (s) não puderam ser verificadas devido a um erro na conexão com a rede,a requete de verificação  ajax falhou. Estes sites aparecem em um fundo vermelho.",
        "sites_with_old_version": "Você tem %1 de dispositivo (s) instalados com uma versão antiga do aeSecure. Esses sites aparecem em um fundo vermelho.",
        "subtitle": "Espaços verdes o site esta em dia, os vermelhos não e os que estão em laranja não respondem ao pedido de informações.",
        "subtitle_buttons": "Os ícones na barra de botões dependem da versão do aeSecure instalado.",
        "zip": "Baixe um arquivo ZIP do site.<br\/><br\/><span style='font-weight:bolder;color:blue;'>Obrigado por sua paciência  esta operação pode levar muito tempo ...<\/span>",
        "click_and_modal": "Clique aqui para ver informações em uma janela modal",
        "11_not_installed": "aeSecure não foi completamente instalado. Ative as opções 1.1 e 1.2.",
        "eraser": "Limpa arquivos 'cache' e  temporário do site",
        "cache_cleaned": "Os diferentes e arquivos do cache e temporários foram limpos",
        "lastmod": "Exibe uma lista de arquivos que foram modificados recentemente no site",
        "download_as": "Faça o download o formato de tabela",
        "error_apache": "Consulte o log de erro do servidor web Apache",
        "allow": "Activar a fonctionnalité",
        "allow_hint": "Ao ativar esta opção, você vai permitir que o seu site para transmitir informação, criptografada, quando interface irá questionar o multi-site para saber mais sobre a sua configuração. <br\/> <br\/>  Esta opção só deve ser ativado caso e somente se você tiver uma conta PRO e você deseja incluir o site na sua tela de gerenciamento multi-site. Deixe a opção desmarcada contrário."
    },
    "74_editredirection": {
        "title": "Gestão redirecionamentos",
        "intro": "Redirects são usados ​​para corrigir algumas urls para apontá-los para outros endereços, como redirecionamento http:\/\/votresite\/page-supprimee vers http:\/\/votresite\/nouvelle-page. É particularmente eficaz em corrigir as urls \"mortos\" que são mencionados por tais ferramentas Google Webmaster Tools.",
        "full": "Durante a vida  do seu site as páginas serão eliminados e os outros serão deslocados. Você, talvez, tenha programado como atalhos p.ex. http:\/\/votresite\/contact que aponta para uma página em seu site para o qual a criação de uma entrada de menu não é possível.<br\/><br\/>Um dos usos mais freqüentes de redirecionamentos é corrigir links quebrados que são relatadas por exemplo, Google Webmaster tools.",
        "explain": "<span class='text-info'><strong>Atenção : Se você cometer um erro de sintaxe, você vai inevitavelmente um tipo de erro do servidor 500. Neste caso,  vai ter que acessar o seu site via FTP para corrigir o seu arquivo \/.htaccess.  Portanto ter acesso ao seu cliente de FTP \"na mão\".<\/strong><\/span>",
        "saved": "Suas alterações foram salvas."
    },
    "72_seo_www": {
        "preface": "Se você pretende usar um CDN para otimizar a exibição de sua velocidade do site, você deve forçar o prefixo www.",
        "cant_be_used": "Esse recurso só pode ser usado se o seu site <ol> <li> não é localhost (127.0.0.1 ou) <\/li> <li> não é um subdomínio (por exemplo, http:\/\/sous-domaine.votresite.fr) e <\/li> <li> se o site é acessível ou http:\/\/votre-site.fr\/index.php http:\/\/www.votre-site. en \/ index.php ou seja, é a raiz do seu nível de nome de domínio. <\/li> <\/ol>",
        "title": "Forçar o www (ou não) nas URL",
        "intro": "Para evitar \"conteúdo duplicado\", recomenda-se para forçar urls no seu site para que as urls mencionadas ou não www. Você vai ter uma melhor classificação (SEO).",
        "full": "Quando um motor de busca chegar ao seu site, é possível que o acesso ao site com um tipo www.o-seusite.pt url. É também possível que chegue com simplesmente o-seusite.pt. Para o motor de busca, existem duas urls diferentes e, portanto, dois locais diferentes.<br\/><br\/>nesse contexto, o motor de busca vai ver que tem o mesmo conteúdo uma vez que o site com www. e uma vez sobre a não www. Para ele, por isso é \"conteúdo duplicado\" e ranking será penalizado.<br\/><br\/>Portanto, é recomendável para forçar as urls do site com o prefixo www ou não. Se você não quiser usá-lo, alguém que chegue ao seu site digitando manualmente url www.o-seusite.pt será adaptada automaticamente para o-seusite.pt.",
        "with_done": "Mudança, seu site não será mais acessível sob formato o-seusite.pt mas somente www.o-seusite.pt",
        "without_done": "Mudança, o seu site não será mais acessível sob formato www.o-seusite.pt, mas somente o-seusite.pt",
        "test": "<a href='%s' target='_blank'>Consulte o seu dite %s<\/a>",
        "state_enabled": "www. imposta",
        "state_disabled": "www. excluída",
        "feature_enabled": "<span style='font-size:1.5em;'>Prefixo www . imposta<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Prefixo www . excluída<\/span>",
        "hint": "<span class='text-success'>Força ou não o \"www.\" Prefixo urls,  alguém que vem para o seu site com a url seria o-seusite.pt alterado www.o-seusite.pt.<\/span>",
        "recommanded": "Dependendo da sua escolha pessoal"
    },
    "errors": {
        "checkconfiguration": "Muito obrigado verificar sua tela de configuração (Ferramentas - Opções) para corrigir os erros abaixo:",
        "err_missing_root_htaccess": "Usando aeSecure implica a existência de um arquivo chamado. Htaccess na raiz do seu site. Por favor, ative a função aeSecure 1.1 para criar esse arquivo; caso contrário aeSecure está inativo",
        "err_htaccess_no_aesecure": "O arquivo. htaccess na raiz do seu arquivo local não de aeSecure é que está atualmente inativa em seu site. Por favor, ative aeSecure 1.1 para incluir o código de protecção.",
        "incorrect_installation": "Instalação de aeSecure é parcial. o arquivo<strong>%s<\/strong> está ausente, o qual não deve ser o caso. Muito obrigado reinstalar uma nova versão do aeSecure.",
        "dberror": "Erro  de acesso no banco de dados :%s",
        "folderlognotfound": "O arquivo de log não existe em seu site. Muito obrigado corrigir o caminho para esta pasta, exibindo a tela de opções aeSecure e especificar uma pasta existente, esta opção para \"%s\"",
        "dirnotwritable": "A pasta está protegida contra escrita",
        "createerror": "Erro ao criar \/ actualisação arquivo %s. Se o arquivo existir, certifique-se que não esta  só em leitura.",
        "error_copying": "Ocorreu um erro ao copiar o arquivo %s <span class='label label-important'>%s<\/span>",
        "filenotfound": "Arquivo %s não encontrado",
        "cantkill": "O arquivo %s não pode ser excluído, verifique as permissões",
        "invalid_params": "Configurações incorrectas",
        "noaccessfolder": "Parece que você não tem permissão para acessar a pasta %s",
        "siteroot_foldernotfound": "O arquivo% s não existe na pasta raiz do seu sítio web",
        "foldernotfound": "Pasta não existe: %s",
        "impossible_check_jversion": "Não foi possível verificar, on-line se a sua versão  do Joomla! ® está actualizado ",
        "old_php": "A sua versão actual do PHP é a versão<strong>%s<\/strong>.  Il A versão mais recente (%s).  Se você estiver hospedado em um servidor compartilhado, consulte o FAQ no seu host e ver se é possível activar uma versão mais recente. Geralmente, isso é feito através da adição de uma linha específica no arquivo. htaccess seu site principal.",
        "old_php_major": "<span style='color:red;'>Saiba que há uma versão de PHP mais recente <\/span>.. Na verdade, o site é executado em PHP <strong>%s<\/strong>; Talvez você poderia activar esta versão %s. <span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Atentenção:<\/span>&nbsp;A transição de uma versão principal para outra não é sem consequência, pensar o fazer primeiro em local, em um site de teste para se certificar que seu site funciona corretamente.",
        "not_supported": "<span class='label label-danger'>Erro:<\/span><span style='color:red;font-style:italic;'>&nbsp;Oups, este recurso ainda não foi implementado. Número da funcionalidade: <strong>%s<\/strong>.<\/span>"
    },
    "91_cleantmpfolder": {
        "preface": "Limpa a pasta \"%1\". Se você quiser ajustar a localização desta pasta, clique em Ferramentas -> Opções.",
        "clean": "( Pasta(s) temporários purgado  : %",
        "title": "Esvaziar a pasta temporária de seu site",
        "intro": "Ocasionalmente, pense a esvaziar a pasta temporária do seu site",
        "full": "A pasta temporária pode conter um grande número de arquivos que foram por qualquer aplicativo instalado no seu site como um CMS.   Esses arquivos não são destinadas a ficar, eles estão lá apenas durante a execução de um recurso de um programa.<br\/><br\/>Estes arquivos ocupam espaço no disco e, portanto só ocupa, o espaço no disco'.  Considere excluir esses arquivos de tempos em tempos.",
        "feature_enabled": "<span style='font-size:1.5em;'>Pasta temporariamente limpa<\/span>",
        "hint": "<span class='text-success'>Excluir arquivos temporários...<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recomendado<\/span><\/span>",
        "protect": "Limpo!"
    },
    "blocked": {
        "Access denied to this folder": "O acesso direto a esta pasta \/ arquivo a partir de um URL é proibido.",
        "access to robots": "Acesso direto para o arquivo robots.txt não é permitido",
        "PHPSESSID attempt": "Tentativa de fixação de l'ID de la sessão PHP",
        "javascript attempt": "Tentando executar um código javascript na URL",
        "SQL injections": "Tentativa Injeção SQL",
        "Probited backend file's access": "O acesso não autorizado a um ficheiro do backend",
        "Probited file's access": "Tentativa de acessar um arquivo cujo acesso é proibido apartir de uma URL",
        "Probited hidden file\/directory access": "Tentativa de acessar um arquivo \/ pasta cujo acesso a partir de uma URL não é permitido",
        "Unknown component": "Componente desconhecido",
        "Are you a spammer ?": "Você é um spammer ? ",
        "Invalid referrer": "Referência inválida e \/ ou não autorizada",
        "Invalid characters in the querystring": "O URL contém caracteres ilegais ou não autorizados",
        "base64_encode within the url": "base64_encode detectado na URL",
        "Functions found in the querystring": "Chamar funções a partir do URL",
        "No file upload allowed on this website": "O upload de arquivos é estritamente proibido neste site",
        "Illegal words in the query string": "O URL contém palavras encontradas na lista negra",
        "Unauthorized access to a monitored folder": "Tentativa de acesso um arquivo cujo acesso está sob vigilância",
        "Shell attacks": "Ataque de tipo shell detectado",
        "I think you don't need to access this folder...": "Segue o teu caminho, tu não tens nada para fazer aqui",
        "Access to this file is prohibited by server's rules": "Tentativa de acesso um arquivo cujo acesso é proibido pelas regras do servidor",
        "Block specials methods from HTTP Request": "Este tipo de consultas é proibido",
        "Trying to modify the REQUEST \/ PHP GLOBAL variables": "Tentativa de modificar variáveis ​​globais ou aplicativos web passado para servidor",
        "You're definitly a bad guy.  Why trying SQL injections?": "Porque é que queres atacar o banco de dados deste site? Tu és uma besta! ",
        "PHP Easter Eggs": "PHP Ovos de Páscoa",
        "No direct access to this file": "O acesso directo a arquivos não é permitido, por favor, vá através do interface de gerenciamento aeSecure",
        "Session timeout": "Sua sessão expirou, por favor reinicie o aeSecure na interface de gerenciamento  ",
        "Incorrect key": "Chave incorreta (ou sessão expirada)",
        "Block xss tries": "Tentativa de execução de um chamado ataque XSS",
        "Registration page disallowed": "Nehnuma criação de usuário pode ser feita no site",
        "com_media fileupload disallowed": "O gerenciador de mídias não permite fazer upload de arquivos",
        "Trying to run a javascript code from the url": "Javascript código detectado na url",
        "Fingerprint attacks detected": "Ataque do tipo de fingerprint (impressão digital) detectado",
        "This script isn't allowed to be executed": "Tentativa de acesso um php não explicitamente permitido pelas regras do script do servidor web."
    },
    "quickinfo": {
        "generatedon": "Relatório de publicação %s",
        "buttonhint": "Exibe uma configuração do site mostrando a  relatório de configuração.&#10;%IsPremium%",
        "function": "Características",
        "quickoverview": "Visualização rápida",
        "fullreport": "Relatório Global",
        "value": "valor",
        "remarkversion": "A funcionalidade de armazenamento foi introduzida com a versão 1.2 aeSecure; Se você tiver uma versão anterior mais velha, você terá que ativar o recurso (por exemplo, desabilitar e habilitar a opção 1.3) para essa opção aparece acima."
    },
    "tips": {
        "did_you_know": "Você sabia que ...",
        "close_hint": "Ao clicar neste botão  fechar, você pede au aeSecure Não mostrar mais esta mensagem",
        "joomla_quick_icons": "há <strong> QuickIcons módulo 'para Joomla! <\/strong> para adicionar em sua administração Joomla! um link direto para o aeSecure interface de gerenciamento. Se você quiser instalar o módulo, por favor clique no link abaixo para sua versão do Joomla, baixar o arquivo e instalá-lo em suas extensões de interface de gestão. Note que este é um módulo para a administração; ele irá, portanto, apresentar os módulos para a administração \"cliente\". Ative o módulo e lugar, por exemplo, na posição 'Ícone' ou 'menu' Joomla.",
        "folder_ip_restriction": "Por restrição de acesso a um arquivo (eg \/ administrador), a melhor proteção é oferecido por opção 2.1 aeSecure. Na verdade, você poderia bloquear o acesso a todos, exceto algumas máquinas (endereços IP). Deve, no entanto, você tem um endereço fixo IP <strong> <\/strong> que é bastante raro, mas se este for o seu caso, opte por essa proteção.",
        "protect_aesecure": "...acesso à sua pasta \/ aesecure exige uma chave tão longa e complexa que é impossível de adivinhar. No entanto, poderia ser um spyware no seu computador para acessar a URL da sua interface aeSecure. Para garantir a segurança da sua interface, considere o uso de opções de 2.1 ou 2.2 para bloquear o acesso ao arquivo \/ aesecure.",
        "protect_dashboard": "... Se você é um usuário PRO e você usar a interface multi-site; pense a fazer a  proteção para o pasta\/ painel de instrumentos com opções de 2.1 ou 2.2.<hr\/>Maior segurança: você pode instalar o multisite apenas localmente (localhost) interface para gerenciamento centralizado de seus sites não esteja disponível online."
    },
    "27_blockrobotstxt": {
        "title": "Bloqueando o acesso ao arquivo robots.txt para os curiosos",
        "intro": "robots.txt é o nome de um arquivo que se encontra na raiz do seu site, que contém informações para os motores de busca: este índexá-lo, não indexá-lo. Este arquivo é destinado para motores de busca (bots); não para os seres humanos que pode descobrir a arquitetura do seu site.",
        "full": "Quando você acessa a url<a href='%SITEURL%robots.txt' target='_blank'>%SITEURL%robots.txt<\/a>, você abre um arquivo de texto que é linhas como Disallow: \/administrator para dizer aos robôs para não indexar a pasta administrador do seu site.<br\/><br\/>Isso é bom, exceto que você indicar que tem essa pasta no seu site.<br\/><br\/>Em alguns sites, pode haver um Disallow: \/Secrets p.ex. o que seria um pasta ou ficheiro do seu site que você deseja manter \"segreto\" e que apenas insiders podem acessar. Alguns sites são construídos para que eles não oferecem proteção especial e quem conhece a existência do arquivo \/ Secrets pode ser acessado. Estes sites são então muito vulnerável a divulgação de informações sobre o arquivo robots.txt<br\/><br\/>A proteção oferecida pela opção 2.7 é detectar que acessa o arquivo robots.txt e permitir o acesso apenas aos robôs conhecidos e levados em uma whitelist.",
        "test": "Antes de habilitar esta opção, vá a este url : <a href='%SITEURL%robots.txt' target='_blank'>%SITEURL%robots.txt<\/a>.  Você vai ver o conteúdo do arquivo. Em seguida, ative a opção e tente novamente acessar o conteúdo do arquivo serão ocultados.",
        "hint": "Bloqueio do acesso ao arquivo robots.txt para os seres humanos.<br\\\\\/><br\\\\\/><span style='font-weight:bold;' class='text-success'>Recomendado<\/span>",
        "recommanded": "Ativado"
    },
    "92_cleancachefolder": {
        "title": "Purgar as pastas de cache do seu site",
        "intro": "Arquivos ocultos são, se eles existem, o arquivo \/cache et \/administrator\/cache do seu site. Limpar o cache garante que uma nova versão da página será enviado para o usuário.",
        "full": "Em sites dinâmicos como os sites baseados em um CMS, uma vez que a página foi gerada após várias solicitações ao banco de dados, o código HTML da página é guardada no servidor de modo que se um outra pessoa solicita a exibição da mesma página, a libertação escondida pode ser utilizado e, assim, acelerar a exibição da velocidade local.<br\/><br\/>Quando você quiser forçar a atualização de uma página do seu site, deve primeiro limpar o cache para que o acesso à url provoca a leitura dos dados a partir  do banco de dados.",
        "feature_enabled": "<span style='font-size:1.5em;'>Pasta(s) cache limpa(s)<\/span>",
        "hint": "<span class='text-success'>Purgar o cache<\/span>",
        "protect": "Purgar!",
        "clean": "Pasta(s) cache purgada(s) : %s"
    },
    "12_protectFolder": {
        "skip": "Um arquivo %s já está em seu site, ele não foi modificado pelo aeSecure <span class='label label-info'>Info<\/span>",
        "title": "Protecção de pastas",
        "intro": "<ol><li>Cópia do arquivo .htaccess em pastas protegidas no seu site, a fim de limitar o acesso, impedir a execução de código em php p.ex. \/tmp, etc.<\/li><li>Copiar um arquivo php.ini na pasta raiz do seu site.<\/li><li>Digitaliza o seu site e criar um arquivo index.html em cada pasta que não possua.<\/li><\/ol>",
        "full": "<ol><li>Alguns arquivos do seu site nunca deve ser acessado a partir de um url.  É o caso p.ex. de do arquivo \/tmp : não há nenhuma razão para que alguém tente acessá-lo a partir de uma URL como http:\/\/votre_site\/tmp\/.  O facto de colocar um arquivo .htaccess com 'deny all' você vai garantir que ninguém possa acessá-lo, mas o mais importante, é que um hacker não possa incluir nenhum arquivo .php, que uma vez aplicadas, poria em causa a segurança de seu site.<\/li><li>O arquivo php.ini que esta na raiz do seu site, se levado em conta pelo seu host, você pode definir os valores que irá fechar algumas portas como p.ex. a possibilidade de abrir um arquivo php remoto (allow_url_fopen).<\/li><li>Cada pasta de seu site também é verificado para determinar se um arquivo index.html  aparece e se não for o caso, aeSecure vai colocar um arquivo cujo objectivo é proibir um visitante de aceder a uma url que aponta para essa pasta e em seguida, na ausência de um arquivo index.html, veria o conteúdo da pasta.  Na verdade, dependendo da configuração do seu servidor web, é possível que a lista de arquivos e pastas seja exibida, o que é prejudicial em termos de segurança.<\/li><\/ol>",
        "hint": "<span class='text-success'>Posicione alguns arquivos .htaccess em pastas-chave do seu site.   Em segundo lugar, analisa a árvore do seu site e cria um arquivo index.html nos casos em que este arquivo está faltando.<br\/><br\/><span class='text-success' style='font-weight:bold;'>Indispensável e obrligatorio.<\/span><\/span>",
        "install": "Implementação do Arquivo %s <span class='label label-success'>Sucesso<\/span>",
        "copy_index": "Cópia dos arquivos index.html",
        "no_index_copied": "Parabéns, todos os suas pastas já contém um arquivo index.html"
    },
    "16_blockpartURL": {
        "title": "O bloqueio com base em elementos no URL",
        "intro": "Depois de analisar os arquivos de log do seu servidor web, você vai ver as tentativas de acesso a URLs específicos: <ul> <li> URLs que se referem por exemplo, nomes de arquivos existentes em seu site(p.ex. food.php)<\/li><li>des URLs parâmetros cujos fornecidos são perigosos (por exemplo, as tentativas de fazer upload de arquivos) <\/li><\/ul> Esta opção 1.6 permite que você especifique regras para bloquear estas URLs.",
        "preface": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Aten\\u00e3o:<\/span>&nbsp;\\nSe as linhas que voc\\u00ea adiciona cont\\u00e9m um erro de sintaxe, o site fica imediatamente inacess\\u00edvel (erro 500). Voc\\u00ea ter\\u00e1, neste caso, de se conectar ao seu site usando o seu cliente FTP, edite o arquivo .htaccess localizado na raiz do seu site e manualmente apagar as linhas que voc\\u00ea acabou de adicionar.<br\/><br\/><div class='text-center'><span class='label label-primary'><i class='icon-info-sign icon-white'><\/i>&nbsp;Se voc\\u00ea quiser v\\u00e1rios bloqueios, por favor, a codificar um por linha.<\/span>&nbsp;<\/div>",
        "url": "Encode aqui bloqueios para executar<u>sur l'URL<\/u> (precede o  ponto de interrogação)",
        "url_sample": "Clique no botão \"%ADD%\" para obtenção de amostras.",
        "querystring": "Encode aqui bloqueios a realizar <u>nos parâmetros<\/u> de l'URL (parte após o ponto de interrogação)",
        "querystring_sample": "Clique no botão \"%ADD%\" para obter exemplos.",
        "full": "Quando você analisar seus registros, você vai ver como os hackers tentarem acessar o seu site.\r\nEles vão tentar explorar falhas de segurança conhecidas, como por exemplo, no final de 2013, a exploração de uma brecha no componente JCE e permitido fazer upload de uma imagem a partir de uma url com as instruções <strong>option=com_jce&task=plugin&plugin=imgmanager<\/strong>.   \r\nOutras façanhas; tentarem executar uma biblioteca php que pode estar presente em seu site(p.ex. openflashchart).\r\nÉ sempre no ficheiro log que mostra as tentativas de acesso, o local de penetração tentada site.\r\n1.6 Esta opção dá-lhe a capacidade de bloquear urls de duas maneiras: ou com base de uma palavra na URL e ou a presença de uma palavra nos parâmetros de URL. Os parâmetros são os seguem o ponto de interrogação (se presente).",
        "addmsg": "Por favor introduza abaixo uma expressão regular para bloquear URLs com base na presença de uma ou mais palavras <strong><u style='color:red;'>na l'URL<\/u><\/strong>.<br\/><br\/>Se você deseja bloquear uma palavra, use uma expressão como esta abaixo, se  por exemplo, você deseja bloquear a palavra<strong>steaming<\/strong> et ce, peu importe sa position dans l'url : <pre style='margin:0 0 2% 3%;width:90%;'>.*(streaming).*<\/pre><p>Você também pode indicar expressões regulares mais complexas como abaixo para bloquear todos os URLs que terminam com<strong>\/admin.php<\/strong><\/p><pre style='margin:0 0 2% 3%;width:90%;'>.(\\\/admin.php)$<\/pre><h4 style='background-color:rgb(205, 241, 177);margin:10px;padding:10px;border:1px solid green'>Para testar suas expressões regulares, sinta-se livre para usar este site : <a href='http:\/\/regex101.com\/' target='_blank'>http:\/\/regex101.com\/<\/a><\/h4><hr\/>Digite a sua restrição abaixo :<br\/>",
        "addmsg2": "Por favor introduza abaixo uma expressão regular para bloquear URLs com base na presença de uma ou mais palavras <strong><u style='color:red;'>Nos parâmetros l'URL<\/u><\/strong>.<br\/><br\/>Os parâmetros de uma URL representam tudo o que se segue? presente na URL. Se você tem uma URL comoindex.php?task=upload, vous pourriez bloquer <strong>la tâche d'upload<\/strong> comme ceci : <pre style='margin:0 0 2% 3%;width:90%;'>.*(task=upload).*<\/pre><h4 style='background-color:rgb(205, 241, 177);margin:10px;padding:10px;border:1px solid green'>Para testar suas expressões regulares, sinta-se livre para usar este site : <a href='http:\/\/regex101.com\/' target='_blank'>http:\/\/regex101.com\/<\/a><\/h4><hr\/>Digite sua restrição abaixo:<br\/>",
        "saved": "Suas alterações foram salvas.<br\/><br\/><span class='lead text-danger'>Se o problema de acesso, você precisa editar o arquivo htaccess atravez do seu cliente FTP.<\/span>"
    },
    "28_blockuseragent": {
        "title": "Bloquear o acesso com base no \"user-agent '",
        "intro": "Cada acesso ao seu site é através de software; geralmente um navegador. Sem exceção, cada programa tem uma assinatura: o nome dele. Estas informações são fornecidas para cada ligação em seu site; na variável 'user-agent.<br\/><br\/>Alguns deles são conhecidos por serem scripting ataques como por exemplo, \"BOT \/ 1.0 (BOT para JCE)\", que tentam atacar o seu site usando uma brecha de segurança no editor JCE (entupidos longo ).<br\/><br\/>Esta opção permite-lhe operar um acesso de bloqueio ao seu site com base no agente de usuário utilizado.",
        "full": "<div class='label label-warning'>Atenção, o agente  usuário não é informação fiável<\/div><p>&nbsp;<\/p><p>As informações do agente do usuário é inicializado pelo script \/ programa que acessa o seu site. Qualquer script pode registrar 'Firefox' como user-agent; é esta informação, então você vai ver. No entanto, alguns scripts não são spoofing e usam uma assinatura, como por exemplo, \"BOT \/ 1.0 (BOT para JCE)\", que diz claramente o que ele está tentando fazer; neste caso, tentar atacar o seu site através do Editor JCE<\/p><p>Opção 2.8 permite que você, uma vez que você tenha identificado agentes nocivos no seu site, o seu proibir qualquer acesso. Serão imediatamente bloqueado.<\/p>",
        "explain": "Por favor, indique o nome dos agentes de usuário que você deseja bloquear abaixo uma linha por nome.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Informação:<\/span>&nbsp;Você pode inserir uma expressão regular (para testes, não hesite em usar este site: : <a href='http:\/\/regex101.com\/' target='_blank'>http:\/\/regex101.com\/<\/a>).<\/div>",
        "saved": "Suas alterações foram salvas..<br\/><br\/><span class='lead text-danger'>Em caso de problema de acesso, você precisa editar o arquivo htaccess do seu cliente FTP..<\/span>"
    },
    "pentest": {
        "title": "Testes d'intrusão \/ hackers",
        "intro": "Este script irá executar uma série de textes no seu site, a fim de verificar se eles são interrompidos por aeSecure (<em>quando você ativou o bloqueio ad hoc<\/em>). La colonne Résultat apparaîtra alors en <span class='status403 success'>vert<\/span> dans ce cas précis.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Information:<\/span>&nbsp;&nbsp;Aucune attaque n'est menée, il s'agit juste de simulation.<br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;Si vous avez activé l'envoi d'une notification par email en cas d'attaque; songez à désactiver cette option avant de lancer les tests sous peine de recevoir plusieurs emails.",
        "run": "Executar teste",
        "finished": "Todos os testes foram realizados; se o resultado é destaque em verde; aeSecure bloqueou o ataque (HTTP de status 403)"
    },
    "mimetype": {
        "title": "Tipo de detecção de MIME",
        "intro": "Este script fará a verificação de todo o  website, e para cada arquivo que está se encontra, vai determinar o tipo (se é uma imagem, au um código executável, etc).) <strong>não com base na extensão do arquivo, mas com o seu conteúdo<\/strong>. O objetivo é identificar, por exemplo PHP códigos executáveis ​​à espreita em arquivos cuja extensão é.jpg.<br\/><br\/>Somente os arquivos cujo conteúdo difere do esperado será mostrado abaixo.<br\/><br\/><span class='label label-danger'><i class='icon-warning-sign icon-white'><\/i>&nbsp;ATENCÃO:<\/span>&nbsp;O tipo Mime é detectado com base na função fileinfo() de PHP.   Esta função \"tenta\" (melhor estimativa) determinar o tipo baseado no seu conteúdo : <strong>esta função  portanto, não é completamente fiável<\/strong> contudo dá uma excelente indicação do tipo de conteúdo.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Atenção:<\/span>&nbsp;Você poderia ter 'faux-positifs' como medida de precaução, sempre editar o arquivo mencionado antes de decidir sobre uma ação, como excluí-lo. Não acesse o arquivo a partir de uma URL (que iria executar o código escondido em uma imagem, por exemplo), mas abri-lo com um editor de texto.",
        "hint": "Scanne do seu  web à procura de arquivos cujo conteúdo é diferente do que era esperado com base no local de extensão..&#10;&#10;Exemplo : um arquivo com a extensão png, mas que contém código PHP.",
        "danger": "A extensão do arquivo não está de acordo com o seu conteúdo, mas mais importante, o conteúdo é executado: se o arquivo está acessível a partir de uma URL, é potencialmente perigosa.",
        "folder_hint": "Se você quiser verificar os arquivos de uma pasta específica, por favor, indicar o nome do arquivo aqui.",
        "detected": "Conteúdo detectado",
        "seefile": "Clique neste ícone para exibir o conteúdo do arquivo em modo texto: mesmo se a extensão de arquivo da para entender que é uma imagem, você verá o arquivo ASCII. Se o arquivo contém um vírus, ele não será executado, mas o seu código-fonte será exibida."
    },
    "29_blockreferrer": {
        "title": "Bloquear o acesso com base no \"referenciador\"",
        "intro": "O referente  (referente em francês), se mencionado, é o site que gerou uma consulta em seu próprio país. Por exemplo, quando alguém chega ao seu site depois de pesquisar no Google, a referência é \"www.google.com\".<br\/><br\/>Lorsqu'un site tiers affiche un flux RSS proposé par le vôtre, le referrer est le nom de domaine du site tiers.  En bloquant tel ou tel referrer, vous allez interdire le trafic venant de ces sites-là.",
        "full": "<div class='label label-warning'>Cuidado, o referer não é informação confiável; pode estar vazia ou ser manipulado.<\/div><p>&nbsp;<\/p><p>Alguns sites são ladrões de conteúdo que se aproveitam da existência de um feed RSS do seu site para que você possa \"roubar\" o tráfego de modo, infelizmente, eles são melhores referênciados que você .<\/p><p>Outros sites poderiam exibir imagens armazenadas em seu site (e roubar a sua largura de banda); veja também a opção 8.9 Prevent Hotlinking.<\/p><p>Outros sites podem fornecer um hyperlink para uma página em seu site  mesmo que você não queira que alguém possa,chegar no seu site a partir desse site, .<\/p><p>Vous pourriez encore indiquer aux moteurs de recherches que le lien proposé sur un site tiers ne doit pas arriver sur votre page car vous ne souhaitez pas être lié d'aucune sorte avec ce site-là.<\/p><p>Exemplos não faltam para desejar \"lista negra\" um site de terceiros.<\/p>",
        "explain": "Por favor, indique abaixo o bloco de domínio, uma linha por domínio (ex <strong>www.voleurs.fr<\/strong>).",
        "saved": "Suas alterações foram salvas.<br\/><br\/><span class='lead text-danger'>Se o problema de acesso, você precisa editar o arquivo htaccess do seu cliente FTP.<\/span>"
    },
    "93_crontab": {
        "title": "Crontab - Planificada para a execução no servidor",
        "intro": "Dependendo do seu pacote de hospedagem, você pode ser capaz de acessar o 'crontab': é uma opção,  lado do servidor,  que permite que você executar um trabalho por exemplo, em cada hora, uma vez por dia, o primeiro dia do mês, etc<br\/><br\/>aeSecure Pro oferece aos usuários um script que, por exemplo, pode ser executado a cada hora para detectar arquivos que foram adicionados ou alterados no seu servidor. Uma notificação por email será enviado; permitindo-lhe agir imediatamente sobre a mudança,que não tera sindo feita por voçê.",
        "full": "o script <strong>aesecure.sh<\/strong> vai, depende da sua configuração:<br\/><br\/><dl><dt>1. Analisar o data da última modificação dos arquivos<\/dt><dd>O script irá analisar a data de modificação (ou data de criação) arquivos no seu servidor e fazer um registro dos arquivos que foram alterados desde a última execução. E, se você executar o script em cada hora, você será notificado por e-mail com a lista do ficheiros adicionados \/ modificados nas últimas  horas.<br\/><br\/><\/dd><dt>2. Faça um backup do seu banco de dados<\/dt><dd>Uma vez por dia, o seu banco de dados sera salvo e armazenada na pasta<strong>\/pro\/crontab\/db_backups<\/strong> d'aeSecure.<br\/><br\/><\/dd><dt>3. Faça uma lista das últimas usuários adicionados no seu banco de dados<\/dt><dd> Uma vez por dia, aeSecure irá verificar se os novos usuários foram adicionados ao seu banco de dados, e se for esse o caso, você receberá uma notificação por e-mail, que terá os dados de que o usuário com a adesão de diferentes grupos do CMS. Assim, por Joomla!, Você vai ver se ele é um usuário 'registrado', 'autor', 'administrador', ...<br\/><br\/><\/dd><\/dl>Por favor, clique no onget \"Configurar\" para aplicar as suas escolhas e dar o caminho para o script; maneira de adicionar à sua 'crontab.",
        "option1_title": " Levantamento  arquivos modificados \/ adicionado recentemente",
        "option2_title": "Fazer o backup de seu banco de dados",
        "option3_title": "Resumo de novos usuários",
        "explain": "Por favor, configure o aesecure.sh conforme necessário, usando as opções abaixo script. Após a instalação concluída, faça login no painel de controle do seu site (cpanel do hosting). Siga as instruções da máquina a adicionar um script no crontab.<br\/><br\/>O caminho de acesso do script é esse: <blockquote><strong>%1<\/strong><\/blockquote>Não há parâmetros para acrescentar ao script; a única coisa que você precisa fazer é escolher a recorrência desejada (por exemplo, a cada dia, a cada hora 30)",
        "actualconfig_extra": "As informações abaixo são stock\\u00e9e no arquivo <strong>%s<\/strong>.<br\/><br\/>A maioria dos dados de configuração de aeSecure vem das opções  disponíveis no menu superior (Ferramentas-> menu Opções).<br\/><br\/>Os outros dados podem ser configurados no l'onglet  &quot;Configurar&quot; Aqui a esquerda",
        "actionstofire": "O que fazer a seguir",
        "sendemail": "Enviar notificações de e-mail",
        "duration": "Período entre duas programações do seu script",
        "duration_hint": "Por favor, aqui a correspondência do planejamento : Se você programou a execução de scripts aesecure.sh em cada oito horas em seu crontab, digite exatamente o mesmo valor abaixo.",
        "one_hour": "Uma hora",
        "two_hours": "Duas horas",
        "four_hours": "Quatro horas",
        "eight_hours": "Oito horas",
        "one_day": "Um dia",
        "savelogs": "Mantenha uma cópia do registro de logging",
        "savelogs_hint": "Quando o script aesecure.sh detecta uma alteração no arquivo, quando ele detecta novos usuários inscritos no banco de dados ... ele gera uma lista em um arquivo de log que será enviado por e-mail. Ao activar esta opção, os arquivos de log serão armazenados nos \/ pro \/ crontab \/ logs \/.",
        "sendemail_hint": "Permite o envio de e-mails para o script aesecure.sh: por exemplo, se um arquivo foi alterado, aeSecure vai enviar uma notificação por e-mail quando esta opção estiver habilitada."
    },
    "17_blockfiles": {
        "title": "Negação de acesso a determinados arquivos por URL",
        "intro": "Seu website contém alguns arquivos com URL de acesso direto devem ser tornadas impossíveis; Este é o caso por exemplo configuration.php arquivos (Joomla! ®) ou wp-config.php (WordPress). Este é também o caso de arquivos .htaccess, readme.txt, etc.",
        "full": "Quando uma pessoa mal intencionada quer prejudicar a sua segurança, ele vai tentar acessar arquivos como wp-config.php ou configuration.php para, tentar visualizar o conteúdo desses arquivos de configuração. Ele também tentará exibir os arquivos de ficheiros ou texto .htaccess como Changelog.txt, php.ini, readme.txt, etc. para exibir seu conteúdo e compreender o seu site (é baseada em um CMS, que, qual a versão ...). <br\/> <br\/> Você pode ter detectado um arquivo suspeito em seu site como phpinfo. php, \/media\/bad.php ... que você quer fazer com que seja impossível usar o acesso direto a exemplo http: \/\/votresite\/phpinfo.php.",
        "preface": "Por favor, insira um nome de arquivo por linha e \/ ou separados por ponto e vírgula Exemplo: <br\/>.htaccess, configuration.php, wp-config.php para bloquear o acesso a esses arquivos URL para bloquear o acesso a esses arquivos URL <br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Attention:<\/span>&nbsp;a proibição aplica-se a todos os arquivos de seu site, independentemente da localização exata do arquivo.",
        "saved": "Suas alterações foram salvas<br\/><br\/><span class='lead text-danger'>Se o problema de acesso, você precisa editar o arquivo .htaccess do seu cliente FTP. <\/span>"
    },
    "94_password": {
        "title": "Gerador de senha",
        "intro": "Esta ferramenta permitirá que você para gerar uma senha aleatória, com um comprimento entre 10 e 40 caracteres. A senha será gerada e composto por letras maiúsculas e minúsculas, números e caracteres especiais de forma aleatória.",
        "full": "Escolhendo uma boa senha é fundamental para garantir o seu website. Os ataques se multiplicam a força bruta e senhas simples são adivinhou em segundos ou instantaneamente para valores como 'admin', '123456', 'qwerty \\\"..<br\/><br\/>Uma pequena ferramenta on-line como \\\"<a href='https:\/\/howsecureismypassword.net\/' target='_blank'>How Secure Is My Password?<\/a>\\\" para testar a força de sua senha.<br\/><br\/>O gerador aeSecure proposto irá sugerir uma senha aleatória, com um comprimento entre 10 e 40 caracteres, a palavra proposta mix letras minúsculas, letras maiúsculas, números e caracteres especiais.<br\/><br\/>Uma senha, como<strong>Mw$02z3plq<\/strong> 96 anos será quebrado o que lhe dará tempo de ver o ataque. No entanto preferem um comprimento ainda maior porque o poder de calculo de computadores está em constante evolução.",
        "password_length": "Comprimento desejado da palavra-passe",
        "password_generated": "Sua senha"
    },
    "13_error_reporting": {
        "title": "Ocultar erros do Apache",
        "intro": "Em um site de produção, garantir que o visitante não possa ver erros do PHP que dão muita informação para um potencial ataques",
        "full": "Quando um erro de programação é encontrado, o servidor Web pode ser configurado para exibir. Isto é ideal para um desenvolvimento site para orientar o desenvolvedor a encontrar bugs, mas em um site de produção, se a tela é activada, o visitante poderá ter acesso a muita informação, como o nome do seu banco de dados, o nome de uma tabela, acesso o caminho de arquivo... Quantidade de informação que pode ser explorada por um atacante.<br\/><br\/>\nN'um site de produção, recomenda-se desabilitar a exibição de erros",
        "state_enabled": "Visualização proibida",
        "state_disabled": "Visualização activada",
        "feature_enabled": "<span style='font-size:1.5em;'>Quaisquer erros nunca será exibido<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Erros será exibido para o visitante<\/span>",
        "hint": "<span class='text-danger'>Ao clicar no botão 'Visualizar' você pede a exibição dos erros, on-line em um servidor de produção pode ser perigoso<\/span>",
        "recommanded": "Visualização proibida"
    },
    "14_old_htaccess": {
        "title": "A edição manual do seu .htaccess",
        "intro": "Às vezes você precisa editar o arquivo htaccess. Adicionar qualquer linha específica como a activação de uma versão do PHP, uma regra de encaminhamento, ...",
        "full": " Depois de verificar várias vezes que sua ortografia é correcta, insira algumas linhas , em seguida salvar as alterações, então depois ser adicionadas no início do arquivo .htaccess . Que se encontra na raiz do seu site.<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Atenção:<\/span>&nbsp;O arquivo .Htaccess é lido em cada solicitação para o seu web site. Enquanto as linhas adicionadas conter um erro de sintaxe ou uma instrução inválida, o servidor web retornará um erro 500 inevitavelmente. Se você tiver acesso a seus arquivos de log do servidor web, você pode ler o motivo do erro. Em todos os cenários, você precisa fazer login no seu site usando  (por exemplo FileZila) programa de FTP, você chegar à raiz do seu site e editar o arquivo. htaccess para remover linhas incorretas.",
        "explain": "Abaixo, você encontrará o conteúdo do seu.htaccess. htaccess antes que o aeSecure ser instalado. Se desejar, pode modificar essas regras ou adicionar outras. <br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Atenção:<\/span>&nbsp; Se você adicionar linhas com erros de sintaxe, o seu site será imediatamente inacessível (erro 500). Você terá neste caso de se conectar ao seu site através de seu cliente FTP, edite o arquivo htaccess. Que se encontra na raiz do seu site e manualmente apagar as linhas que você acabou de adicionar.",
        "saved": "Suas alterações foram salvas.<br\/><br\/><span class='lead text-danger'>Em caso de problemas de acesso, terá que editar o arquivo. htaccess a partir do seu cliente FTP.<\/span>"
    },
    "19_maintenance": {
        "title": "Activar \/ Desactivar o modo de manutenção",
        "intro": "Este modo permite que você redirecione todas as pessoas que chegam ao seu site cheguem em uma página 'Este site está em manutenção ...', excepto você.",
        "full": "Quando você precisa garantir a manutenção no site ou quando você quer cortar todo o acesso porque você detectou um potencial intruso, o modo de manutenção permite que você redirecione todos, qualquer que seja o acesso url usado (frontend, backend, download de um arquivo, ...) para uma página ... em manutenção ... 'tempo para você analisar o seu site e fazer as mudanças necessárias...<br\/><br\/><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Atenção!:<\/span>&nbsp;Depois de ter concluído as suas acções de manutenção, voltar a esta opção para desactivar o modo de manutenção e restaurar o acesso a todos os utilizadores..<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Informações:<\/span>&nbsp;Esta função é diferente daquela que você encontra no seu CMS (Joomla!® p.ex.) pois como a activação do modo de manutenção faz-se a nível de todo o seu site (=> tudo é bloqueado) e não apenas as páginas de site servidas pelo CMS.",
        "pagetitle": "O site \"%s\" está actualmente em manutenção",
        "comeback": "Obrigado por ter retornado, por favor volte dentro de uma hora...",
        "contact": "<a href=\"mailto:%s?subject=Site %s en maintenance\">Fale Connosco<\/a>",
        "confirm": "Você tem certeza? Mais nenhuma conexão é possível, excepto o seu (com base no seu IP).",
        "hint": "<span class='text-danger'>Ao activar o modo de manutenção, todas as ligações para o seu site será redireccionado para uma página indicando que o site está em manutenção.<br\/><br\/><span style='font-weight:bold;'> Ninguém vai aceder ao site, excepto cocê.<\/span><\/span>",
        "recommanded": "Desactivado"
    },
    "22_protectPassword": {
        "title": "Protecção por senha",
        "intro": "Coloque um arquivo htpasswd. Em um diretório para restringir o acesso apenas aos titulares do login-senha.<br\/><br\/><span class='label label-primary'><i class='icon-primary-sign icon-white'><\/i>&nbsp;Conseil:<\/span>&nbsp;Idealmente, você deve, pelo menos, proteger a sua pasta de administração. Se o backup (cópias de segurança) está localizado na sua árvore (p.ex. \/Backups), lembre-se também de o proteger.",
        "full": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Atenção!:<\/span>&nbsp;A protecção é através da criação de um arquivo htpasswd, htpasswd exige que o utilizador  introduza um login \/ senha antes de acessar uma página ou na pasta especificada.<br\/>Ideal para proteger o arquivo de administração de Joomla!® mas cuidado! pode causar problemas com alguns componentes.",
        "restrict": "Proteger um arquivo por duplo login\/password",
        "done": "Utilizador <span class='text-success' style='font-weight:bold;'>%s<\/span> Criado. Por favor, use a senha <span class='text-success' style='font-weight:bold;'>%s<\/span> para conectar-se ao arquivo <span class='text-success' style='font-weight:bold;'>%s<\/span>.",
        "testit": "Clique aqui para testar a sua protecção: <a href='%s' target='_blank'>%s<\/a>",
        "keepit": "<h5><span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Atenção:<\/span>&nbsp;pretende conservar estas informações de forma segura.<\/h5>",
        "error": "Erro ao criar arquivo.htpasswd,pasta desprotegida"
    },
    "23_blockbots": {
        "title": "limitar o SPAM",
        "intro": "Bloqueia o acesso au robôs  no seu site web seja, os scripts, programas, sites de vácuo cuja assinatura é conhecido e reconhecido como insalubre. Também bloqueia algumas palavras-chave sobre o princípio da lista negra.",
        "full": "Quando um programa, como um navegador acessa seu site, ele é identificado por sua assinatura, o \"user_agent\".  Do mesmo modo como para o vírus, <a href='http:\/\/perishablepress.com\/ultimate-htaccess-blacklist\/' title='Ultimate htaccess Blacklist | Perishable Press' target='_blank'>algumas assinaturas são conhecidas<\/a> como sendo visitantes nocivos (os 'bad bots');eles são softwares utilizados por atacantes, spammers, ...  Embora seja verdade que é muito fácil de falsificar essas informações, os visitantes cujos user_agent é um mau bot não tem nenhuma razão legítima para visitar o seu site.<br\/><br\/>Ao habilitar a protecção, você vai bloquear um grande número desses bad bots. ",
        "hint": "<span class='text-success'>Activar essa segurança, você vai negar o acesso ao seu site com robôs conhecidos.<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recomendado<\/span><\/span>",
        "recommanded": "Activado"
    },
    "24_blockfileupload": {
        "title": "Bloqueia o upload de arquivos",
        "intro": "Hacking um site geralmente é feito por meio do upload de um script malicioso.  Bloqueio de arquivos para o seu servidor, você protege-se contra este tipo de ataque.  <strong>Leia os detalhes antes de activar a explicação da protecção.<\/strong>",
        "full": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Atenção:<\/span>&nbsp;Proibir o upload, você irá bloquear os usuários a carregar um avatar,  a atualização do CMS (Joomla!® ou autro), bloquear atualização de um componente , etc.  Na verdade, as atualizaçães requerem o download de arquivos  para atualizar antes da instalação .<br\/><br\/>No entanto, você pode desabilitar o envio, a menos que você faça a sua manutenção, onde, em seguida, neste preciso momento  você pode voltar a ligar o tempo de fazer o upload para as atualizaçães.",
        "confirm": "Você tem certeza? Terá que voltar atrás e voltar a fazer o upload, senão você não pode actualizar o seu CMS.",
        "hint": "<span class='text-danger'>Se proibir o upload, você não pode atualizar o seu CMS e \/ ou extensões, você não pode permitir que seus usuários façam upload de um avatar, entre outras coisas.<br\/><br\/><span style='font-weight:bold;'>Certifique-se de que você está a fazeer ...<\/span><\/span>",
        "recommanded": "A não ser que você saiba exactamente o que está a fazer, deixe desactivado"
    },
    "25_noarchive": {
        "title": "Bloqueia a indexação de determinados arquivos",
        "intro": "Proíbe motores de buscas a fornecem links para arquivos tipo ZIP e arquivos ,MS Office presentes no seu site.",
        "full": "Proibir os motores de busca para fornecer links directos para arquivos presentes no seu site, vai forçar os usuários a visitar o seu site para visualizar as páginas do site, mas também, em termos de segurança, você garante que não tem nenhum arquivo que deveria ser discreto (p.ex. 'passwords.doc') seria recuperável dos motores de busca. Isso parece óbvio e ainda ... Google está cheio de tais ligações.",
        "hint": "Exige dos motores de busca para nunca indexar os arquivos zip e MS Office (accdb, oc, docx, mdb, ppt, pptx, xls, xlsx, zip).<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recomendado<\/span>",
        "recommanded": "Activado"
    },
    "26_blockhiddenfolders": {
        "title": "Bloquear o acesso a pastas e arquivos ocultos",
        "intro": "Os arquivos e pastas cujos nomes começam com um ponto (.) São arquivos \/ pastas ocultos. Em alguns sites, folders como. Backups,. Git. Svn ... podem estar presentes e, por padrão, acessíveis a partir de uma url. ",
        "full": "No  seu site Apache , um arquivo ou uma pasta cujo nome começa com um ponto é um arquivo \/ pasta oculta em alguns sistemas esses arquivos são escondidos em algumas telas. A nivel de um acesso de internet (por url), Apache não bloqueia o acesso e por isso é possível ter acesso, por exemplo http:\/\/votresite\/.backups\/monbackup. No entanto, não é uma arquivo seguro que, se você teve o cuidado de criar uma pasta escondida e não é fazer com que os arquivos sejam acessíveis a partir de uma URL.<br\/><br\/>O objectivo desta protecção é proibir tal acesso. Excepto . htaccess aeSecure que sistematicamente, você pode optar por bloquear o acesso (recomendado) ou, pelo contrário, para permitir a qualquer pessoa que saiba o URL.",
        "hint": "Proíbe o acesso a pastas e arquivos ocultos é dizer aqueles cujos nomes começam com um ponto (.)<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recomendado<\/span>",
        "recommanded": "Activado"
    },
    "41_joomlaversion": {
        "title": "Controle de Versão Joomla!®",
        "intro": "Enquanto você permanecer dentro da mesma versão principal (1.5.x, 2.5.x, 3.x), não  <span style='font-weight:bold;'>há nehuma<\/span> razão para não actualizar seu site Joomla!®",
        "full": "Quando uma nova versão do Joomla!® é disponibilizado para a comunidade, não só porque há novos recursos que foram desenvolvidos, mas também por causa de falhas de segurança que foram descobertos e preenchida pela equipe de desenvolvedores Joomla ®! . Portanto, é essencial para o bom funcionamento do seu site sempre ter a última versão do CMS.<br\/><br\/>No entanto, se você tem um site p.ex. Joomla!® 1.5 e você quiser instalar uma versão 2.5 ou 3.x, não falamos aqui de uma atualização, mas de por em dia : a mudança de versão,  significa que você vai ter un trabalho mais ou menos importante para alcançar (certamente um nível suprior a 1.5.x). Neste caso, o plano para por a nível e fazê-lo quando tiver tempo. Isso pode levar várias horas a vários dias, dependendo da complexidade do site e extensões usadas. ",
        "current": "Sua versão actual do Joomla!® : %s",
        "updated": "Versão mais recente do Joomla!® : %s",
        "youvethelast": "Parabéns, você tem a versão mais recente do Joomla!® (%s)",
        "url_package": "URL do pacote de actualização : %s",
        "unknown": "Pedimos desculpa, não foi possível determinar a última versão do Joomla!®"
    },
    "42_blockcomusers": {
        "title": "Bloquear as inscrições nativas Joomla!®",
        "intro": "Alguns scripts maliciosos alvo dos sites Joomla!® e com um acesso  a uma URL pública  permite aos usuários  fantasma criar contas . Se você quiser evitar a criação de contas de usuário no seu site e \/ ou se você usar outros componentes (comme Community Builder ou JomSocial), desactivar o componente nativo com_users",
        "full": "Mesmo na ausência de um menu de ligação e \/ ou o módulo de conexão do Joomla!®, é simples de criar uma conta, a url <strong>index.php?option=com_users&view=registration<\/strong>, o que permite aos scripts automatizados de criar usuários . Usuários tipo fantasmas (os mesmos usuários) irão rapidamente fazer do spam no site, em campos de comentário, no fórum,etc ...<br\/><br\/>Além disso, se você permitir que esses usuários de fazer upload de um avatar, o que põe em risco, pois a imagem pode ser um código malicioso ou de ter um visual virus etc.<br\/><br\/>Ao bloquear a gestão de usuários nativos Joomla!® (com_users), você bloqueia este tipo de script.<br\/><br\/>Se você utiliza Community Builder, você também pode bloquear com_users e permitir que os registos através CB.  Para fazer isso nas configurações gerais do User Manager, desactive a entrada, em seguida, ir para as configurações gerais CB e activar o registo <strong>independentemente<\/strong> daqueles do site.",
        "test": "Clique abaixo para visualizar em uma nova página para criar um usuário: <a href='%HTTP_HOST%\/index.php?option=com_users&view=registration' title='Visualize a página para criar um usuário com o componente nativo do Joomla!®' target='_blank'>Criar um novo usuário<\/a>.<br\/><br\/>Se a protecção ainda não está activa, você verá a página para criar uma conta. Se o seu site Joomla! está configurado para aceitar automaticamente os registos;. script pode, portanto, criar usuários fantasmas <br\/> interminável Uma vez que você tenha activado a procteção, consulte a página de procteção aeSecure que impede a exibição e criando assim usuários fantasmas .",
        "hint": "<span class='text-danger'>Bloqueia as inscrições do componente com_users o que reduz consideravelmente o spams. Se você quiser permitir que os visitantes possam inscrever-se no seu site, não selecione essa opção.<br\/><br\/><span style='font-weight:bold;'>Tenha certeza de que você está a fazer...<\/span><\/span>",
        "recommanded": "A não ser que você saiba exactamente o que está a fazer, Desactivado"
    },
    "43_protectadmin": {
        "title": "Proteja arquivos administração Joomla!®",
        "intro": "Bloquear o acesso directo (por url) a arquivos pasta\/administrator.  Alguns arquivos, como arquivos.xml, podem fornecer muita informação para um potencial hackeur (ex: a versão exata do seu Joomla!®)<br\/><br\/>O acesso a ficheiros de multimédia (css, js, png, ...) continuará a ser possível.",
        "full": "Sem protecção, do seu arquivo \/administrador são acessíveis a partir da url.  É perfeitamente possível ter acesso a arquivos .ini (langue), .xml (manifest), .txt, ... que estão localizados em sua administração apenas digitando o endereço completo do arquivo.<br\/><br\/>O problema é que esses arquivos são usados ​​para aprender muito! Como por exemplo, a versão exacta do seu Joomla!® (p.ex. 2.5.16).  Esses arquivos devem ser bloqueados pelo seu servidor web.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Informação:<\/span>&nbsp;Supérfluo se você proteger o administrador com uma senha ou restrito a um endereço IP.",
        "test": "Clique abaixo para visualizar numa nova aba, o manifesto do seu site Joomla: <a href='%HTTP_HOST%\/administrator\/manifests\/files\/joomla.xml' title='Afficher le manifest de votre site Joomla!®' target='_blank'>Ver o manifesto do seu site Joomla!®<\/a>.<br\/><br\/>\nSe a protecção ainda não está activo, você vai ver a instalação do Joomla manifesto ®: ver o número exacto da versão.<br\/><br\/>\nArquivos de manifesto de seus componentes são igualmente endereçável. Um invasor pode, portanto, testar se você tiver um tal componente e versão.",
        "recommanded": "Activar"
    },
    "44_blockcomp": {
        "title": "Bloquear o acesso a certos componentes Joomla!®",
        "intro": "No arquivo de log do servidor Apache (não no do Joomla!®), você percebe que há um grande número de linhas para as URLs do tipo index.php?option=com_xxxxx mesmo que com_xxxxx nunca tenha sido instalado no seu site.  Esta é uma tentativa de hackear no site : provavelmente com_machin é um componente Joomla!® para o qual a segurança é conhecida e hackers 'scan' da web à procura de sites potencialmente vulneráveis.<br\/><br\/>Use esta opção para bloquear esses urls.",
        "full": "Cuidado com o componente de redirecionamento (administration Joomla -> Componentes -> redirecionamento) ou no arquivo de log do seu site Joomla!® e analisar as consultas que falharam.  Se você vir um grande número de urls tipo ?option=com_xxxxx e que este componente não está instalado no seu site (e não será), é bom para bloquear este componente para proteger o seu site a partir duma potencial falha de segurança.<br\/><br\/>Para fazer isso, use o formulário e especifique o nome do componente (com_xxxxx).   aeSecure irá bloquear todas as URLs onde este nome aparecer.",
        "test": "Veja o que Joomla ® ao acessar com_xxxxx:<a href='%HTTP_HOST%\/index.php?option=com_xxxxx' target='_blank'>%HTTP_HOST%\/index.php?option=com_xxxxx<\/a>.<br\/><br\/>Se você ver uma página 404, é bom sinal, mas isso mostra que o pedido foi recebido pelo Joomla! ®. Teria sido preferível que proíbisse a página de acesso é exibido quando esta consulta é executada dezenas \/ centenas de vezes em seu site.",
        "explain": "Indique abaixo os nomes dos componentes que você deseja bloquear. Sempre 'com_' seguido pelo nome do componente (por exemplo, 'com_prettyform').<br\/><br\/>Para especificar mais de um, basta separá-los com ponto e vírgula(com_prettyform;com_survey;com_whatever).",
        "blocked": "O Componente %s será bloqueado."
    },
    "49_showredirect": {
        "title": "Exibir o conteúdo de redirecionamentos Joomla!®",
        "intro": "A partir do Joomla!® 1.7, o Joomla!® grava nos  componentes de redirecionamento das urls que falharam, por exemplo, quando o URL refere-se a um componente que não está instalado. Dê uma olhada nesta tabela, é instrutivo, pois permite que você veja as urls utilizadas possivelmente por hackers que tentam entrar no site.",
        "full": "Os hackers utilizam scripts que fazem uma varredura na Internet às cegas para tentar aceder através de urls considerados fiáveis. Assim, você vai poder ver um grande número de acessos a uma URL como %HTTP_HOST%\/index.php?option=com_xxxx ou com_xxxx é um componente que nunca tenha sido instalado em seu site.<br\/><br\/>O objectivo dos hackers é tentar encontrar locais onde esse componente esta instalado e como, provavelmente, uma falha segurança é conhecida , portanto, eles tentam explorá-la.<br\/><br\/>Verifique regularmente a tabela para  melhor proteger  o seu site.",
        "column_oldurl": "URL usado não reconhecido por Joomla!® (pagina 404).&#10;&#10;Analisar o url para, por exemplo ver se é tipo malicioso, se ele se refere a um componente que nunca foi instalado, verifique as configurações, se eles são legítimos ...&#10;&#10;Esta é uma óptima maneira de ver como o seu site está sob ataque de hackers.",
        "column_hits": "Número de vezes em que Joomla! ® encontrou esta URL.&#10;&#10; Se o número é elevado, convem de redirecionar o URL se ele é válido ou bloqueando-o atravez do .htaccess; por exemplo, o  bloqueio de um componente , se ela não estiver instalado no site .",
        "truncatetable": "Esvazie a tabela inteira, apagados todos os registros de uma só vez",
        "truncatetable_confirm": "Você está prestes a excluir todos os registos da tabela, é possível confirmar se este é o seu desejo?",
        "tablenotfound": "Desculpe,O componente de redirecionar não existe na sua versão do Joomla! ®. ",
        "deleterows": "Excluir linhas verificado o banco de dados Joomla! ®.",
        "delete_confirm": "Será que você quer excluir os registos que  foram seleccionados do componente de redirecionamento de Joomla! ®?",
        "deleted": "Gravar ID =%s apagado",
        "error_deleted": "Erro ao excluir ID =%s",
        "onlyfirstrows": "Exibição limitada a %s primeiros registos, classificados em ordem decrescente na coluna 'hits'. Então, essas são as urls mais frequentemente encontrados que você vê na tela.",
        "tryit": "Abra essa url em uma nova aba",
        "norecords": "A tabela de encaminhamento está vazio."
    },
    "71_seo_rewrite": {
        "title": "Reescrevendo urls",
        "intro": "Sites dinâmicos usam URLs com um número muito grande de parâmetros, como é o caso do Joomla!® que usa um tipo url index.php?option=com_users&amp;view=registration. Estas urls não são muito intuitivas para um motor de busca, e não permite que você defina o que a página, ao contrário por exemplo, \/ inscriptions.html que será melhor referenciado.",
        "full": "Activando a reescrita, você usa as funções de roteamento de seu CMS e as suas urls não aparecerão mais 'index.php' seguido por um grande número de parâmetros, mas o alias que você especificou para a sua página. O caminho da URL apelido será composto de diferentes menus e alias da página, a fim de ter uma url limpa e explícita para os motores de busca.<br\/><br\/><span class='label label-info'><i class='icon-info-sign icon-white'><\/i>&nbsp;Informação:<\/span>&nbsp;Note que reescrita é baseada no componente \/ programa no trabalho e CMS, e é sua responsabilidade de gerir adequadamente a reescrita.",
        "test": "Se o seu site é dinâmico (Joomla ®, Drupal, Wordpress, ...), repare na url quando você navegar no seu site. Activar rescrita e navegue novamente no seu site, você vai verificar que as suas urls são agora 'limpas' e 'explícitas'",
        "feature_enabled": "<span style='font-size:1.5em;'>Reescrita activado<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Reescrita desactivado<\/span>",
        "hint": "<span class='text-success'>Activar reescrita urls<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recomendado<\/span>",
        "recommanded": "Activar"
    },
    "81_pagespeed": {
        "title": "Beneficiar do modulo mod_pagespeed",
        "intro": "O mod_pagespeed é um módulo  Apache que pode ser ativado no seu host e se este é o caso, você pode otimizar o seu site usando este módulo.",
        "full": "<a href='https:\/\/developers.google.com\/speed\/pagespeed\/module' title='PageSpeed module by Google'>mod_pagespeed<\/a>é um módulo desenvolvido pelo Google, cujo objectivo é reduzir o peso da sua página web: remover comentários HTML, compressão de imagens, minifiant em HTML, ...<br\/><br\/>A activação do módulo mod_pagespeed depende do fornecedor e seu contracto. É possível, portanto, que não é activa na sua conta e, neste caso, a optimização aeSecure não será tomada em conta. ",
        "test": "<span class='label label-warning'><i class='icon-warning-sign icon-white'><\/i>&nbsp;Atenção:<\/span>&nbsp;Precisamos do seu host, tenha activado o módulo Apache e Google PageSpeed, se for o caso, incluiu esse recurso.<br\/><br\/>Para testar a diferença de velocidade, é necessário que o seu site esteja online para você poder fazer o teste  com uma ferramenta com o <a href='http:\/\/gtmetrix.com\/' target='_blank' title='GTMetrix | Website Speed and Performance Optimization'>GTMetrix<\/a>. Faça o teste pela primeira vez, sem permitir a optimização depois teste novamente uma vez que a optimização foi feita,  deve ver uma diferença significativa.",
        "feature_enabled": "<span style='font-size:1.5em;'>Optimização activada<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Optimização desactivada<\/span>",
        "hint": "<span class='text-success'>Activar a optimização do seu site através do mod_pagespeed (<span style='font-weight:bold;'>exige que a sua hosting  tenha este módulo activado na sua conta, a optimização não afectará outros<\/span>).<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recomendado<\/span><\/span>",
        "recommanded": "Activado"
    },
    "83_expire": {
        "title": "Especifique o tempo de vida de arquivos estáticos ",
        "intro": "Arquivos estáticos, como arquivos de javascript, css, imagens, fontes da web ... são, por padrão, baixado cada vez que uma página é vista, mesmo que seja o mesmo usuário. Especificar o tempo de vida  permite informar o navegador para não baixar o arquivo se ele já está presente em seu cache.",
        "full": "Quando a vida é definida para arquivos estáticos, o navegador do seu visitante não vai mais fazer o download do arquivo, uma vez que já está em seu cache. Assim, quando um visitante retorna para a página ou navegar de uma página para outra, um grande número de arquivos não será baixado, mas usado localmente. Isto terá um efeito imediato sobre a velocidade de navegação será aumentado significativamente.",
        "test": "Para testar a diferença de velocidade, é necessário que seu site está online e você faz o teste de velocidade com uma ferramenta como <a href='http:\/\/gtmetrix.com\/' target='_blank' title='GTMetrix | Website Speed and Performance Optimization'>GTMetrix<\/a>.  Faça o teste pela primeira vez sem otimização uma vez activado  testar novamente , você deve ver uma diferença significativa.",
        "feature_enabled": "<span style='font-size:1.5em;'>Optimização Activada<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Optimização desativada<\/span>",
        "hint": "<span class='text-success'>Informar ao navegador do usuário uma vida longa para arquivos estáticos, como folhas de estilo, JavaScript, imagens, ...<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recomendado<\/span><\/span>",
        "recommanded": "Activado num site em produção, desactivada num site em local em um teste \/ desenvolvimento"
    },
    "89_hotlinking": {
        "title": "Evitar ligações hotlinking",
        "intro": "Proibir que outros usem a sua largura de banda, fazendo referência no seu site, ou imagem do seu",
        "full": "Quando os outros sites usam imagens que estão no seu próprio site, sempre que alguém esses sites de terceiros, a sua largura de banda é usado porque o seu servidor deve fornecer a imagem para o candidato, mesmo que este site tem nada a ver consigo. Este é um site \"parasita\"<br\/><br\/>Ao permitir a exibição de uma imagem se o pedido for feito a partir do seu próprio nome de domínio e \/ ou determinados sites autorizados (como Google, Facebook, Yahoo, Bing, ...), de modo a reduzir a interferência e você conservar os recursos em seu servidor.",
        "feature_enabled": "<span style='font-size:1.5em;'>Optimização activada<\/span>",
        "feature_disabled": "<span style='font-size:1.5em;'>Optimização desactivada<\/span>",
        "hint": "<span class='text-success'>Recusa-se a apresentar uma imagem do seu site se ele é chamado por outro domínio que o seu<br\/><br\/><span style='font-weight:bold;' class='text-success'>Recomendado<\/span><\/span>",
        "recommanded": "Activado"
    },
    "install": {
        "install_done": "<strong>Instalação de aeSecure %s foi um sucesso.<\/strong>",
        "key": "Para garantir o acesso a esta tela de configuração apenas para pessoas que acessão esta página isso requer uma chave para ser especificado na URL. Quando você quiser acessar esta página, por favor use o seguinte URL:",
        "key_change": "Se quiser mudar a chave, vá para a tela Ferramentas -> Opções.",
        "postinstall": "<div class='text-primary'><strong>Observação:<\/strong>&nbsp;Para a sua segurança, instalação de arquivos aeSecure foram automaticamente excluídos.<\/div>",
        "disclaimer": "<span id='disclaimer'>Por favor teste o aeSecure numa cópia do seu site, não faça em sites de produção; <span style='text-decoration:underline;'>nunca<\/span>.  Activar ou desactivar a funcionalidade de protecção (por exemplo, a proibição de uploads) pode causar mau funcionamento do seu site. Proteger um site é um trabalho necessário, mas difícil e deve ser testado num local e estar seguro que o site está totalmente funcional.<\/span>",
        "disclaimer_checkbox": "Editor de aeSecure não se responsabiliza por qualquer anomalia..",
        "disclaimer_limitation": "Protecção como aeSecure visa essencialmente fechar muitas portas através do qual um hacker pode passar, se o seu site já está infectado com malware, por favor,  limpe antes de usar o aeSecure .",
        "disclaimer_limitation_checkbox": "Eu entendo que aeSecure aumenta a protecção do meu site, mas não pode garantir total segurança (como qualquer outro programa de segurança)",
        "pleaseaccept": "Para concluir a instalação do aeSecure, por favor verifique as caixas.",
        "finish": "Complete a instalação"
    },
    "accessdenied": {
        "banned": "Seu endereço de IP foi proibido neste site",
        "contactwebmaster": "Se você acha que isso é um erro, agradeço que contacte o administrador do site para que adapte o nível de segurança",
        "emailsent": "Um e-mail foi enviado para o administrador do site",
        "pagetitle": "Acesso negado",
        "mailwebmaster": "Se você é o webmaster do site, clique  <a href='sendkey.php'>Aqui<\/a> para receber por e-mail a palavra-passe para o seu site",
        "reminderkey_title": "Lembre-se a palavra-passe para o seu site",
        "reminderkey_info": "Alguém recentemente tentou  iniciar sessão na sua interface de gestão aeSecure com uma palavra-passe falsa, provavelmente você  (IP: %s). Veja abaixo o link com as informações da palavra-passe, não se esqueça de a por nos seus favoritos.",
        "reminderkey_secret": "Lembre-se, manter este link ao abrigo de olhares curiosos.",
        "title": "Acesso negado."
    },
    "documentation": {
        "title": "Documentação",
        "hint": "Acesse o aeSecure documentação on-line"
    },
    "forum": {
        "title": "Fórum",
        "hint": "Fórum aeSecure"
    },
    "mail": {
        "illegitimate": "Alguém tentou acessar o seu site '%s' a partir de um url não permitido",
        "url": "URL acessada",
        "attack": "Tipo de ataque",
        "title": "Atenção é necessária no seu site %s",
        "ipaddress": "Endereço IP",
        "showlog": "Mostrar logfile",
        "banip": "Bloquear o IP",
        "showvar": "Veja vários",
        "technicalinfos": "Informações técnicas"
    },
    "getlog": {
        "menu": "Log acesso negado por aeSecure",
        "menu_hint": "O arquivo  log é aquele que contém uma linha do ataque ', ou seja, o url foi bloqueado pelo aeSecure.",
        "empty": "O arquivo de log está vazio",
        "emptymore": "Parece que até agora nenhuma tentativa de acesso ilegítimo foi encontrada e capturado pelo aeSecure."
    },
    "ban": {
        "title": "O endereço %s foi banido e não poderá mais acessar o seu",
        "htaccess": "O arquivo .htaccess do seu site %s foi adaptado e uma nova  regra foi adicionada para bloquear o endereço IP %s. Ele aparece agora na lista negra."
    },
    "jQuery-messages": {
        "required": "Este campo é obrigatório.",
        "email": "Por favor insira um endereço de e-mail válido.",
        "url": "Por favor, digite um URL válido.",
        "alphabetic": "Por favor, só digitar letras.",
        "alphanumeric": "Por favor, digite apenas letras, sublinhado e números.",
        "number": "Por favor insira um número (por exemplo, 12,-12,5,1.3e-2).",
        "integer": "Por favor insira um número sem decimais.",
        "minlength": "Por favor, insira pelo menos {0} caracteres. ",
        "maxlength": "Por favor, não insira mais de {0} caracteres. ",
        "ipv4": "Por favor insira um endereço IP válido (versão 4)."
    }
}